/*

	About: Inventory system (and cases)
	Author: Foxze

*/

/*----------------------------------------------------------------------------
Functions:
	Public:
		OnPlayerConnect(playerid)
	Stock:
		Inv_GetMaxItems()
		Inv_GetMaxBanners()
		Inv_GetNameItem(item_id)
		Inv_GetInfoItem(item_id)
		Inv_GetModelItem(item_id)
		Inv_GetPosItem(item_id, &Float:x, &Float:y, &Float:z)
		Inv_GetNameBanner(banner_id)
		Inv_GetInfoBanner(banner_id)
		Inv_GetPlayerStandSkin(playerid)
		Inv_GetPlayerSkin(playerid)
		Inv_GetPlayerHead(playerid)
		Inv_GetPlayerHeadphones(playerid)
		Inv_GetPlayerGlasses(playerid)
		Inv_GetPlayerMask(playerid)
		Inv_GetPlayerWatch(playerid)
		Inv_GetPlayerBanner(playerid)
		Inv_GetBannerModel(banner_id)
		Inv_GetPlayerCellItem(playerid, num)
		Inv_GetPlayerCellItemCount(playerid, num)
		Inv_GetPlayerCellBanner(playerid, num)
		Inv_GetPlayerCellBannerCount(playerid, num)
		Inv_PlayerCreateAccount(playerid)
		Inv_DestroyPlayerBaseTD(playerid)
		Inv_SetPlayerItem(playerid, itemid, amount)
		Inv_SetPlayerBanner(playerid, itemid, amount)
		Inv_CheckPlayerFullItem(playerid, item_id = -1, item_amount = 0)
		Inv_CheckPlayerFullBanner(playerid, item_id = -1, item_amount = 0)
		Inv_CheckItemDestination(item_id)
		Inv_SetPlayerAttachItem(playerid)
		GiveAttachPlayerItem(playerid, item_id)
		RemoveAttachPlayerItem(playerid, index = -1)
		Inv_UpdateTDBase(playerid)
		Inv_UpdatePLayerData(playerid)
		Inv_IsItemForPlayer(playerid, item_id)
		Inv_ShowTDBase(playerid)
		Inv_SavePlayer(playerid) 
		Inv_UploadPlayerData(playerid) 
Enums:
	E_INV_BANNER_INFO
	E_INV_ITEM_INFO
	E_INV_PLAYER_IN_INFO
	E_INV_PLAYER_TD_INFO
	E_CASE_PLAYER_INFO
Commands:
	-
Dialogs:
	InventoryTransfer
	InventoryTransferCount
	InventoryInfoItem
	InventoryDropItem
Interfaces:
	Inventory
	Cases
------------------------------------------------------------------------------*/

#if defined _INC_INVENTORY_SYSTEM
	#endinput
#endif
#define _INC_INVENTORY_SYSTEM

/*

	* Enums *

*/

enum E_INV_BANNER_INFO {
	BN_Model[INV_MAX_ITEM_NAME_LENGTH],
	BN_Max,
	BN_Name[INV_MAX_ITEM_NAME_LENGTH],
	BN_Info[INV_MAX_ITEM_INFO_LENGTH]
}

enum E_INV_ITEM_INFO {
	IT_Model,
	Float:IT_PosX,
	Float:IT_PosY,
	Float:IT_PosZ,
	IT_Max,
	IT_Name[INV_MAX_ITEM_NAME_LENGTH],
	IT_Info[INV_MAX_ITEM_INFO_LENGTH]
}

enum E_INV_PLAYER_IN_INFO {
	IN_StandSkin,
	IN_Skin,
	IN_Head,
	IN_Headphones,
	IN_Glasses,
	IN_Mask,
	IN_Watch,
	IN_Banner
}

enum E_INV_PLAYER_TD_INFO {
	INV_ActiveTab,
	INV_ChooseTab,
	INV_ActiveCell,
	INV_ActiveCellCount,
	INV_ActiveCellItem,
	INV_ActiveChooseTab,
	INV_ActiveTD,
	INV_ActiveTypeItems,
	bool:INV_ActiveSelectCell
}

enum E_CASE_PLAYER_INFO {
	PC_Exp,
	PC_Credits,
	PC_GoldCoins,
	PC_Item[CASE_MAX_REWARDS]
}

/*

	* Vars *

*/

static const
	inv_BannerInfo[][E_INV_BANNER_INFO] = {
	 /*0*/{"", 					3,	"", ""},
	 /*1*/{"ld_drv:naward",		3,	"Металлический значок: Никакой награды",			"Данный значок самый дешёвый из всех.\nМожно получить на торговой площадке.\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	 /*2*/{"ld_drv:nawtxt",		3,	"Металлический значок",								"Данный значок самый дешёвый из всех.\nМожно получить на торговой площадке.\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	 /*3*/{"ld_drv:brboat",		3,	"Бронзовый значок: Военно-морской департамент",		"Данный значок имеет ценность.\nМожно получить на торговой площадке.\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	 /*4*/{"ld_drv:brfly",		3,	"Бронзовый значок: Летная школа",					"Данный значок имеет ценность\nМожно получить на торговой площадке.\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	 /*5*/{"ld_drv:bronze",		3,	"Бронзовый значок: Отдел вождения", 				"Данный значок имеет ценность.\nМожно получить на торговой площадке.\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	 /*6*/{"ld_drv:silboat",	3,	"Серебряный значок: Военно-морской департамент",	"Данный значок имеет немалую ценность.\nМожно получить на торговой площадке.\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	 /*7*/{"ld_drv:silfly",		3,	"Серебряный значок: Летная школа",					"Данный значок имеет немалую ценность.\nМожно получить на торговой площадке.\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	 /*8*/{"ld_drv:silver",		3,	"Серебряный значок: Отдел вождения",				"Данный значок имеет немалую ценность.\nМожно получить на торговой площадке.\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	 /*9*/{"ld_drv:goboat",		3,	"Золотой Значок: Военно-морской департамент",		"Данный значок имеет большую ценность.\nМожно получить на торговой площадке.\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	/*10*/{"ld_drv:gold",		3,	"Золотой значок: Отдел вождения",					"Данный значок имеет большую ценность.\nМожно получить на торговой площадке.\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	/*11*/{"ld_drv:golfly",		3,	"Золотой значок: Летная школа",						"Данный значок имеет большую ценность.\nМожно получить на торговой площадке.\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	/*12*/{"ld_grav:bee1",		3,	"Пчела",											"Данный баннер имеет вид пчелы.\nМожно получить на торговой площадке\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	/*13*/{"ld_grav:flwr",		3,	"Ромашка",											"Данный баннер имеет вид ромашки.\nМожно получить на торговой площадке\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	/*14*/{"ld_grav:leaf",		3,	"Лист",												"Данный баннер имеет вид листа.\nМожно получить на торговой площадке\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	/*15*/{"ld_grav:sky",		3,	"Небо",												"Данный баннер имеет вид неба.\nМожно получить на торговой площадке\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	/*16*/{"ld_grav:thorn",		3,	"Шипы",												"Данный баннер имеет вид шипов.\nМожно получить на торговой площадке\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	/*17*/{"ld_none:shpwarp",	3,	"Космический корабль",								"Данный баннер имеет вид космического корабля.\nМожно получить на торговой площадке\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	/*18*/{"ld_none:title",		3,	"Заголовок планеты Земли",							"Данный баннер имеет вид заголовка Земли.\nМожно получить на торговой площадке\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	/*19*/{"ld_otb:gride8",		3,	"Лошадь и наездник",								"Данный баннер имеет вид наездника на лошади.\nМожно получить на торговой площадке\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	/*20*/{"ld_otb:hrs7",		3,	"Конь",												"Данный баннер имеет вид коня.\nМожно получить на торговой площадке\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	/*21*/{"ld_plan:airlogo",	3,	"Логотип воздуха",									"Данный баннер имеет вид логотипа воздуха.\nМожно получить на торговой площадке\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	/*22*/{"ld_shtr:ship",		3,	"Обезьяна в корабле",								"Данный баннер имеет вид обезьяны в корабле.\nМожно получить на торговой площадке\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	/*23*/{"ld_shtr:splsh",		3,	"Вперёд космическая обезьяна",						"Данный баннер имеет вид призыва вперёд космическая обезьяна.\nМожно получить на торговой площадке\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	/*24*/{"ld_shtr:ufo",		3,	"НЛО",												"Данный баннер имеет вид НЛО.\nМожно получить на торговой площадке\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."},
	/*25*/{"ld_spac:rockshp",	3,	"Ракета",											"Данный баннер имеет вид ракеты.\nМожно получить на торговой площадке\nТребуется для установления баннера у персонажа.\nПосле смерти противника, он будет видеть этот баннер."}
};

static const
	inv_ItemInfo[][E_INV_ITEM_INFO] = {
	  /*0*/{0, 		0.0, 	0.0, 	0.0, 	5, 		"Скин: Carl Johnson (ID:0)",						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	  /*1*/{1, 		0.0, 	0.0, 	0.0, 	5, 		"Скин: The Truth (ID:1)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	  /*2*/{2, 		0.0, 	0.0, 	0.0, 	5, 		"Скин: Maccer (ID:2)",								"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	  /*3*/{3, 		0.0, 	0.0, 	0.0, 	5, 		"Скин: Andre (ID:3)",								"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	  /*4*/{4, 		0.0, 	0.0, 	0.0, 	5, 		"Скин: Barry Thorne (ID:4)",						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	  /*5*/{5, 		0.0, 	0.0, 	0.0, 	5, 		"Скин: Barry Thorne (ID:5)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	  /*6*/{6, 		0.0, 	0.0, 	0.0, 	5, 		"Скин: Emmet (ID:6)", 								"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	  /*7*/{7, 		0.0, 	0.0, 	0.0, 	5, 		"Скин: Taxi Driver (ID:7)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	  /*8*/{8, 		0.0, 	0.0, 	0.0, 	5, 		"Скин: Janitor (ID:8)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	  /*9*/{9,		0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:9)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*10*/{10, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Old Woman (ID:10)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*11*/{11, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Casino croupier (ID:11)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*12*/{12, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Rich Woman (ID:12)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*13*/{13, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Street Girl (ID:13)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*14*/{14, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:14)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*15*/{15, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Mr.Whittaker (ID:15)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*16*/{16, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Airport Ground Worker (ID:16)",				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*17*/{17, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Businessman (ID:17)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*18*/{18, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Beach Visitor (ID:18)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*19*/{19, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: DJ (ID:19)", 								"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*20*/{20, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Rich Guy (ID:20)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*21*/{21, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:21)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*22*/{22, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:22)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*23*/{23, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: BMXer (ID:23)", 								"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*24*/{24, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Madd Dogg Bodyguard (ID:24)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*25*/{25, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Madd Dogg Bodyguard (ID:25)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*26*/{26, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Backpacker (ID:26)",							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*27*/{27, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Construction Worker (ID:27)",				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*28*/{28, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Drug Dealer (ID:28)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*29*/{29, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Drug Dealer (ID:29)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*30*/{30, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Drug Dealer (ID:30)",						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*31*/{31, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Farm-Town inhabitant (ID:31)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*32*/{32, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Farm-Town inhabitant (ID:32)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*33*/{33, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Farm-Town inhabitant (ID:33)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*34*/{34, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Farm-Town inhabitant (ID:34)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*35*/{35, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Gardener (ID:35)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*36*/{36, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Golfer (ID:36)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*37*/{37, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Golfer (ID:37)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*38*/{38, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:38)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*39*/{39, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:39)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*40*/{40, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:40)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*41*/{41, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:41)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*42*/{42, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Jethro (ID:42)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*43*/{43, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:43)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*44*/{44, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:44)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*45*/{45, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Beach Visitor (ID:45)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*46*/{46, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:46)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*47*/{47, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:47)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*48*/{48, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:48)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*49*/{49, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Snakehead (ID:49)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*50*/{50, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Mechanic (ID:50)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*51*/{51, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Mountain Biker (ID:51)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*52*/{52, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Mountain Biker (ID:52)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*53*/{53, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Unknown (ID:53)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*54*/{54, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:54)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*55*/{55, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:55)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*56*/{56, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:56)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*57*/{57, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Oriental Ped (ID:57)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*58*/{58, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Oriental Ped (ID:58)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*59*/{59, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:59)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*60*/{60, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:60)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*61*/{61, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Pilot (ID:61)", 								"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*62*/{62, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Colonel Fuhrberger (ID:62)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*63*/{63, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Prostitute (ID:63)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*64*/{64, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Prostitute (ID:64)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*65*/{65, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Kendl Johnson (ID:65)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*66*/{66, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Pool Player (ID:66)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*67*/{67, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Pool Player (ID:67)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*68*/{68, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Priest/Preacher (ID:68)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*69*/{69, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:69)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*70*/{70, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Scientist (ID:70)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*71*/{71, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Security Guard (ID:71)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*72*/{72, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Hippy (ID:72)", 								"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*73*/{73, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Hippy (ID:73)", 								"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*74*/{74, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Unknown (ID:74)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*75*/{75, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Prostitute (ID:75)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*76*/{76, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Stewardess (ID:76)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*77*/{77, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Homeless (ID:77)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*78*/{78, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Homeless (ID:78)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*79*/{79, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Homeless (ID:79)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*80*/{80, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Boxer (ID:80)", 								"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*81*/{81, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Boxer (ID:81)", 								"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*82*/{82, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Black Elvis (ID:82)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*83*/{83, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: White Elvis (ID:83)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*84*/{84, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Blue Elvis (ID:84)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*85*/{85, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Prostitute (ID:85)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*86*/{86, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Ryder (ID:86)", 								"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*87*/{87, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Stripper (ID:87)",							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*88*/{88, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:88)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*89*/{89, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:89)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*90*/{90, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Jogger (ID:90)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*91*/{91, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Rich Woman (ID:91)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*92*/{92, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Rollerskater (ID:92)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*93*/{93, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:93)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*94*/{94, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:94)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*95*/{95, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:95)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*96*/{96, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Jogger (ID:96)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*97*/{97, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Lifeguard (ID:97)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*98*/{98, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:98)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	 /*99*/{99, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Rollerskater (ID:99)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*100*/{100, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Biker (ID:100)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*101*/{101, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:101)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*102*/{102, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Balla (ID:102)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*103*/{103, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Balla (ID:103)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*104*/{104, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Balla (ID:104)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*105*/{105, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Grove Street Families (ID:105)", 			"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*106*/{106, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Grove Street Families (ID:106)", 			"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*107*/{107, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Grove Street Families (ID:107)", 			"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*108*/{108, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Los Santos Vagos (ID:108)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*109*/{109, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Los Santos Vagos (ID:109)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*110*/{110, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Los Santos Vagos (ID:110)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*111*/{111, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: The Russian Mafia (ID:111)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*112*/{112, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: The Russian Mafia (ID:112)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*113*/{113, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: The Russian Mafia (ID:113)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*114*/{114, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Varios Los Aztecas (ID:114)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*115*/{115, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Varios Los Aztecas (ID:115)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*116*/{116, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Varios Los Aztecas (ID:116)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*117*/{117, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Triad (ID:117)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*118*/{118, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Triad (ID:118)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*119*/{119, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Johhny Sindacco (ID:119)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*120*/{120, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Triad Boss (ID:120)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*121*/{121, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Da Nang Boy (ID:121)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*122*/{122, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Da Nang Boy (ID:122)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*123*/{123, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Da Nang Boy (ID:123)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*124*/{124, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: The Mafia (ID:124)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*125*/{125, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: The Mafia (ID:125)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*126*/{126, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: The Mafia (ID:126)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*127*/{127, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: The Mafia (ID:127)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*128*/{128, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Farm Inhabitant (ID:128)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*129*/{129, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Farm Inhabitant (ID:129)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*130*/{130, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Farm Inhabitant (ID:130)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*131*/{131, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Farm Inhabitant (ID:131)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*132*/{132, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Farm Inhabitant (ID:132)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*133*/{133, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Farm Inhabitant (ID:133)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*134*/{134, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Homeless (ID:134)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*135*/{135, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Homeless (ID:135)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*136*/{136, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:136)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*137*/{137, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Homeless (ID:137)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*138*/{138, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Beach Visitor (ID:138)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*139*/{139, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Beach Visitor (ID:139)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*140*/{140, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Beach Visitor (ID:140)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*141*/{141, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Businesswoman (ID:141)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*142*/{142, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Taxi Driver (ID:142)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*143*/{143, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Crack Maker (ID:143)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*144*/{144, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Crack Maker (ID:144)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*145*/{145, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Crack Maker (ID:145)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*146*/{146, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Crack Maker (ID:146)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*147*/{147, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Businessman (ID:147)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*148*/{148, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Businessman (ID:148)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*149*/{149, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Big Smoke Armored (ID:149)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*150*/{150, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Businesswoman (ID:150)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*151*/{151, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:151)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*152*/{152, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Prostitute (ID:152)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*153*/{153, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Construction Worker (ID:153)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*154*/{154, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Beach Visitor (ID:154)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*155*/{155, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Stacked Pizza Worker (ID:155)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*156*/{156, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Barber (ID:156)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*157*/{157, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Hillbilly (ID:157)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*158*/{158, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Farmer (ID:158)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*159*/{159, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Hillbilly (ID:159)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*160*/{160, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Hillbilly (ID:160)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*161*/{161, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Farmer (ID:161)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*162*/{162, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Hillbilly (ID:162)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*163*/{163, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Black Bouncer (ID:163)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*164*/{164, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: White Bouncer (ID:164)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*165*/{165, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: White MIB agent (ID:165)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*166*/{166, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Black MIB agent (ID:166)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*167*/{167, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: BaCluckin' (ID:167)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*168*/{168, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Dog Vendor (ID:168)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*169*/{169, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:169)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*170*/{170, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:170)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*171*/{171, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Blackjack Dealer (ID:171)",					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*172*/{172, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Casino croupier (ID:172)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*173*/{173, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: San Fierro Rifa (ID:173)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*174*/{174, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: San Fierro Rifa (ID:174)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*175*/{175, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: San Fierro Rifa (ID:175)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*176*/{176, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Barber (ID:176)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*177*/{177, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Barber (ID:177)",							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*178*/{178, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Whore (ID:178)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*179*/{179, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Ammunation Salesman (ID:179)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*180*/{180, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Tattoo Artist (ID:180)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*181*/{181, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Punk (ID:181)", 								"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*182*/{182, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Cab Driver (ID:182)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*183*/{183, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:183)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*184*/{184, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:184)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*185*/{185, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:185)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*186*/{186, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:186)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*187*/{187, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Businessman (ID:187)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*188*/{188, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:188)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*189*/{189, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Valet (ID:189)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*190*/{190, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Barbara Schternvart (ID:190)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*191*/{191, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Helena Wankstein (ID:191)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*192*/{192, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Michelle Cannes (ID:192)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*193*/{193, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Katie Zhan (ID:193)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*194*/{194, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Millie Perkins (ID:194)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*195*/{195, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Denise Robinson (ID:195)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*196*/{196, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Farm-Town inhabitant (ID:196)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*197*/{197, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Hillbilly (ID:197)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*198*/{198, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Farm-Town inhabitant (ID:198)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*199*/{199, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Farm-Town inhabitant (ID:199)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*200*/{200, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Hillbilly (ID:200)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*201*/{201, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Farmer (ID:201)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*202*/{202, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Farmer (ID:202)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*203*/{203, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Karate Teacher (ID:203)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*204*/{204, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Karate Teacher (ID:204)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*205*/{205, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Burger Shot Cashier (ID:205)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*206*/{206, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Cab Driver (ID:206)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*207*/{207, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Prostitute (ID:207)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*208*/{208, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Su Xi Mu (Suzie) (ID:208)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*209*/{209, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Oriental stand vendor (ID:209)", 			"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*210*/{210, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: School Instructor (ID:210)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*211*/{211, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Clothes shop staff (ID:211)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*212*/{212, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Homeless (ID:212)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*213*/{213, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Weird old man (ID:213)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*214*/{214, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Waitress(ID:214)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*215*/{215, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:215)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*216*/{216, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:216)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*217*/{217, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Clothes shop staff (ID:217)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*218*/{218, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:218)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*219*/{219, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Rich Woman (ID:219)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*220*/{220, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Cab Driver (ID:220)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*221*/{221, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:221)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*222*/{222, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:222)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*223*/{223, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:223)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*224*/{224, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:224)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*225*/{225, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:225)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*226*/{226, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:226)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*227*/{227, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Oriental Businessman (ID:227)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*228*/{228, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Oriental Ped (ID:228)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*229*/{229, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Oriental Ped (ID:229)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*230*/{230, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Homeless (ID:230)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*231*/{231, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:231)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*232*/{232, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:232)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*233*/{233, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:233)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*234*/{234, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Cab Driver (ID:234)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*235*/{235, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:235)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*236*/{236, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:236)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*237*/{237, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Prostitute (ID:237)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*238*/{238, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Prostitute (ID:238)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*239*/{239, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Homeless (ID:239)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*240*/{240, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: The D.A (ID:240)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*241*/{241, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Afro-American (ID:241)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*242*/{242, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Mexican (ID:242)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*243*/{243, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Prostitute (ID:243)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*244*/{244, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Stripper (ID:244)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*245*/{245, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Prostitute (ID:245)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*246*/{246, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Stripper (ID:246)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*247*/{247, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Biker (ID:247)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*248*/{248, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Biker (ID:248)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*249*/{249, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Pimp (ID:249)", 								"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*250*/{250, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:250)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*251*/{251, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Lifeguard (ID:251)",							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*252*/{252, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Naked Valet (ID:252)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*253*/{253, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Bus Driver (ID:253)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*254*/{254, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Biker Drug Dealer (ID:254)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*255*/{255, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Chauffeur (ID:255)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*256*/{256, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Stripper (ID:256)",							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*257*/{257, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Stripper (ID:257)",							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*258*/{258, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Heckler (ID:258)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*259*/{259, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Heckler (ID:259)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*260*/{260, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Construction Worker (ID:260)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*261*/{261, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Cab driver (ID:261)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*262*/{262, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Cab driver (ID:262)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*263*/{263, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Normal Ped (ID:263)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*264*/{264, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Clown (ID:264)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*265*/{265, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Officer Frank (ID:265)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*266*/{266, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Officer Eddie Pulaski (ID:266)", 			"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*267*/{267, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Officer Jimmy (ID:267)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*268*/{268, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Dwaine/Dwayne (ID:268)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*269*/{269, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Melvin Harris (ID:269)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*270*/{270, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Sean Johnson (ID:270)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*271*/{271, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Ryder (ID:271)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*272*/{272, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Mafia Boss (ID:272)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*273*/{273, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: T-Bone Mendez (ID:273)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*274*/{274, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Paramedic (ID:274)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*275*/{275, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Paramedic (ID:275)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*276*/{276, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Paramedic (ID:276)",							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*277*/{277, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Firefighter (ID:277)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*278*/{278, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Firefighter (ID:278)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*279*/{279, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Firefighter (ID:279)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*280*/{280, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: LS Police Officer (ID:280)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*281*/{281, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: SF Police Officer (ID:281)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*282*/{282, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: LV Police Officer (ID:282)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*283*/{283, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: County Sheriff (ID:283)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*284*/{284, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: LSPD Motorbike Cop (ID:284)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*285*/{285, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: S.W.A.T (ID:285)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*286*/{286, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Federal Agent (ID:286)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*287*/{287, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: San Andreas Army (ID:287)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*288*/{288, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Desert Sheriff (ID:288)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*289*/{289, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Zero (ID:289)", 								"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*290*/{290, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Ken Rosenberg (ID:290)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*291*/{291, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Kent Paul (ID:291)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*292*/{292, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Cesar Vialpando (ID:292)",	 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*293*/{293, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Jeffery Martin (ID:293)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*294*/{294, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Wu Zi Mu (Woozie) (ID:294)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*295*/{295, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Michael Toreno (ID:295)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*296*/{296, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Jizzy B. (ID:296)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*297*/{297, 	0.0, 	0.0, 	0.0, 	5,		"Скин: Madd Dogg (ID:297)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*298*/{298, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Catalina (ID:298)", 							"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*299*/{299, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Claude Speed (ID:299)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*300*/{300, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: LS Police Officer (ID:300)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*301*/{301, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: SF Police Officer (ID:301)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*302*/{302, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: LV Police Officer (ID:302)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*303*/{303, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: LS Police Officer (ID:303)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*304*/{304, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: LS Police Officer (ID:304)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*305*/{305, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: LV Police Officer (ID:305)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*306*/{306, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: LS Police Officer (ID:306)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*307*/{307, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: SF Police Officer (ID:307)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*308*/{308, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: SF Paramedic (ID:308)", 						"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*309*/{309, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: LV Police Officer (ID:309)", 				"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*310*/{310, 	0.0, 	0.0, 	0.0, 	5, 		"Скин: Country Sheriff (ID:310)", 					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},
	/*311*/{311,	0.0, 	0.0, 	0.0, 	5, 		"Скин: Desert Sheriff (ID:311)",					"Данный скин можно получить на торговой площадке или в кейсах.\nТребуется для изменения внешнего вида персонажа."},

	/*312*/{3052,	-20.0,	0.0, 	30.0, 	999,	"Обычный кейс", 							"Данный кейс можно получить на торговой площадке или выполняя квесты.\nТребуется для получения случайных предметов."},
	/*313*/{2358, 	-20.0, 	0.0, 	150.0, 	999, 	"Особый кейс", 								"Данный кейс можно получить на торговой площадке или выполняя квесты.\nТребуется для получения случайных предметов."},
	/*314*/{964,	-10.0, 	0.0, 	150.0, 	999,	"Военный кейс", 							"Данный кейс можно получить на торговой площадке или выполняя квесты.\nТребуется для получения случайных предметов."},
	/*315*/{19141, 	50.0, 	-130.0, 100.0, 	10, 	"Шлем SWAT", 								"Данный шлем можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*316*/{19514, 	50.0, 	-130.0, 100.0, 	10, 	"Шлем SWAT №2", 							"Данный шлем можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*317*/{19520, 	50.0, 	-130.0, 100.0, 	10, 	"Фуражка пилота", 							"Данную фуражку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*318*/{19521, 	50.0, 	-130.0, 100.0, 	10, 	"Полицейская фуражка", 						"Данную фуражку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*319*/{18636, 	30.0, 	0.0, 	60.0, 	10, 	"Полицейская кепка", 						"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*320*/{19161, 	-30.0, 	-80.0, 	-20.0, 	10, 	"Полицейская кепка №2", 					"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*321*/{19162, 	-30.0, 	-80.0, 	-20.0, 	10, 	"Полицейская кепка №3", 					"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*322*/{18961, 	-30.0, 	0.0, 	60.0, 	10,		"Кепка TRUCK", 								"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*323*/{18929, 	50.0, 	-130.0, 100.0, 	10, 	"Зелёная кепка с узорами", 					"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*324*/{18933, 	50.0, 	-130.0, 100.0, 	10, 	"Тёмная кепка", 							"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*325*/{18934, 	50.0, 	-130.0, 100.0, 	10, 	"Красная кепка", 							"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*326*/{18935, 	50.0, 	-130.0, 100.0, 	10, 	"Жёлтая кепка", 							"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*327*/{18957, 	-10.0, 	-10.0, 	-110.0, 10, 	"Синяя кепка", 								"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*328*/{18939, 	90.0, 	50.0, 	90.0, 	10,		"Тёмно-синяя кепка", 						"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*329*/{18940, 	90.0, 	50.0, 	90.0, 	10,		"Светло-синяя кепка", 						"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*330*/{18941, 	90.0, 	50.0, 	90.0, 	10,		"Чёрная кепка", 							"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*331*/{18942, 	90.0, 	50.0, 	90.0, 	10,		"Серая кепка", 								"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*332*/{18943, 	90.0, 	50.0, 	90.0, 	10,		"Зелёная кепка", 							"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*333*/{19160, 	60.0, 	-120.0, 90.0, 	10, 	"Жёлтая кепка DUDE", 						"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*334*/{18926, 	50.0, 	-130.0, 100.0, 	10, 	"Военная кепка", 							"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*335*/{18927, 	50.0, 	-130.0, 100.0, 	10, 	"Голубая кепка с узорами", 					"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*336*/{18928, 	50.0, 	-130.0, 100.0, 	10, 	"Радужная кепка", 							"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*337*/{18960, 	-30.0, 	30.0, 	60.0, 	10, 	"Радужная кепка №2", 						"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*338*/{18930, 	50.0, 	-130.0, 100.0, 	10, 	"Тёмно-красная кепка", 						"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*339*/{18931, 	50.0, 	-130.0, 100.0, 	10, 	"Синяя кепка с волнами", 					"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*340*/{18932, 	50.0, 	-130.0, 100.0, 	10, 	"Светло-красная кепка", 					"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*341*/{19558, 	50.0, 	-130.0, 100.0, 	10, 	"Кепка доставщика пиццы", 					"Данную кепку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*342*/{18953, 	50.0, 	-130.0, 100.0, 	10, 	"Чёрная вязаная шапка", 					"Данную шапку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*343*/{18954, 	50.0, 	-130.0, 100.0, 	10, 	"Серая вязаная шапка", 						"Данную шапку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*344*/{19554, 	50.0, 	-130.0, 100.0, 	10, 	"Удлиненная чёрная шапка", 					"Данную шапку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*345*/{18964, 	-30.0, 	30.0, 	60.0, 	10, 	"Удлиненная чёрная шапка №2", 				"Данную шапку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*346*/{18966, 	-30.0, 	30.0, 	60.0, 	10, 	"Удлиненная радужная шапка", 				"Данную шапку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*347*/{19067, 	-50.0, 	0.0, 	50.0, 	10, 	"Красная шапка", 							"Данную шапку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*348*/{19068, 	-50.0, 	0.0, 	50.0, 	10, 	"Болотная шапка", 							"Данную шапку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*349*/{19069, 	-50.0, 	0.0, 	50.0, 	10, 	"Чёрная шапка", 							"Данную шапку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*350*/{19064, 	-50.0, 	0.0, 	50.0, 	10, 	"Новогодняя шапка", 						"Данную шапку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*351*/{18891, 	60.0, 	90.0, 	30.0, 	10, 	"Тёмно-серая бандана", 						"Данную бандану можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*352*/{18892, 	60.0, 	90.0, 	30.0, 	10, 	"Тёмно-красная бандана",					"Данную бандану можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*353*/{18893, 	60.0, 	90.0, 	30.0, 	10, 	"Белая с красными полосками бандана", 		"Данную бандану можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*354*/{18894, 	60.0, 	90.0, 	30.0, 	10, 	"Бандана песчаного цвета", 					"Данную бандану можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*355*/{18895, 	60.0, 	90.0, 	30.0, 	10, 	"Чёрная с черепами бандана", 				"Данную бандану можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*356*/{18896, 	60.0, 	90.0, 	30.0, 	10, 	"Чёрная с белыми узорами бандана", 			"Данную бандану можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*357*/{18897, 	60.0, 	90.0, 	30.0, 	10, 	"Синяя с белыми узорами бандана", 			"Данную бандану можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*358*/{18898, 	60.0, 	90.0, 	30.0, 	10, 	"Зелёная с белыми узорами бандана", 		"Данную бандану можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*359*/{18899, 	60.0, 	90.0, 	30.0, 	10, 	"Бордовая бандана", 						"Данную бандану можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*360*/{18901, 	60.0, 	90.0, 	30.0, 	10, 	"Бандана с тигриными полосками", 			"Данную бандану можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*361*/{18902, 	60.0, 	90.0, 	30.0, 	10, 	"Жёлтая бандана", 							"Данную бандану можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*362*/{18903, 	60.0, 	90.0, 	30.0, 	10, 	"Фиолетовая бандана", 						"Данную бандану можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*363*/{18904, 	40.0, 	50.0, 	0.0, 	10, 	"Синяя бандана с узорами", 					"Данную бандану можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*364*/{18905, 	60.0, 	90.0, 	30.0, 	10, 	"Песчаная бандана", 						"Данную бандану можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*365*/{18906, 	40.0, 	50.0, 	0.0, 	10,		"Красно-белая бандана", 					"Данную бандану можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*366*/{18907, 	40.0, 	50.0, 	0.0, 	10,		"Радужная бандана", 						"Данную бандану можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*367*/{18908, 	40.0, 	50.0, 	0.0, 	10,		"Светло-голубая бандана", 					"Данную бандану можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*368*/{18909, 	60.0, 	90.0, 	30.0, 	10, 	"Фиолетовая бандана №2", 					"Данную бандану можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*369*/{18910, 	40.0, 	50.0, 	0.0, 	10, 	"Бандана из лавы", 							"Данную бандану можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*370*/{18968, 	-50.0, 	0.0, 	20.0, 	10, 	"Серая панама", 							"Данную панаму можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*371*/{18969, 	-50.0, 	0.0, 	20.0, 	10, 	"Желто-оранжевая панама", 					"Данную панаму можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*372*/{19107, 	50.0, 	-130.0, 100.0, 	10, 	"Каска армейского камуфляжа", 				"Данную каску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*373*/{19109, 	50.0, 	-130.0, 100.0, 	10, 	"Каска армейского камуфляжа №2", 			"Данную каску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*374*/{19108, 	50.0, 	-130.0, 100.0, 	10, 	"Каска лесного камуфляжа", 					"Данную каску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*375*/{19110, 	50.0, 	-130.0, 100.0, 	10, 	"Каска пустынного камуфляжа", 				"Данную каску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*376*/{19113, 	50.0, 	-130.0, 100.0, 	10, 	"Каска радужного камуфляжа", 				"Данную каску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*377*/{19115, 	50.0, 	-130.0, 100.0, 	10, 	"Каска с черепом", 							"Данную каску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*378*/{19116, 	50.0, 	-130.0, 100.0, 	10, 	"Чёрная каска", 							"Данную каску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*379*/{19117, 	50.0, 	-130.0, 100.0, 	10, 	"Красная каска", 							"Данную каску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*380*/{19118, 	50.0, 	-130.0, 100.0, 	10, 	"Зелёная каска", 							"Данную каску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*381*/{19119, 	50.0, 	-130.0, 100.0, 	10, 	"Синяя каска", 								"Данную каску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*382*/{19330, 	50.0, 	-130.0, 100.0, 	10, 	"Каска пожарного", 							"Данную каску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*383*/{19331, 	50.0, 	-130.0, 100.0, 	10, 	"Каска пожарного №2", 						"Данную каску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*384*/{18638, 	50.0, 	-130.0, 100.0, 	10, 	"Строительная каска", 						"Данную каску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*385*/{18947, 	50.0, 	-130.0, 100.0, 	10, 	"Чёрная шляпа", 							"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*386*/{18948, 	50.0, 	-130.0, 100.0, 	10, 	"Голубая шляпа", 							"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*387*/{18949, 	50.0, 	-130.0, 100.0, 	10, 	"Зелёная шляпа", 							"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*388*/{18950, 	50.0, 	-130.0, 100.0, 	10, 	"Красная шляпа", 							"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*389*/{18951, 	50.0, 	-130.0, 100.0, 	10, 	"Оранжевая шляпа", 							"Данную шляпу можно получить в кейсах или на тооговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*390*/{19488, 	-50.0, 	0.0, 	60.0, 	10, 	"Белая шляпа", 								"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*391*/{18944, 	50.0, 	-130.0, 100.0, 	10, 	"Шляпа из лавы", 							"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*392*/{18945, 	50.0, 	-130.0, 100.0, 	10, 	"Зелёная с узорами шляпа", 					"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*393*/{18946, 	50.0, 	-130.0, 100.0, 	10, 	"Белая с полоской шляпа", 					"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*394*/{18970, 	-50.0, 	0.0, 	60.0, 	10, 	"Тигровая шляпа", 							"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*395*/{18971, 	-50.0, 	0.0, 	60.0, 	10, 	"Чёрно-белая шляпа в сеточку", 				"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*396*/{18972, 	-50.0, 	0.0, 	60.0, 	10, 	"Чёрно-оранжевая шляпа", 					"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*397*/{18973, 	-50.0, 	0.0, 	60.0, 	10, 	"Пчелиная шляпа", 							"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*398*/{19553, 	50.0, 	-130.0, 100.0, 	10, 	"Фермерская шляпа", 						"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*399*/{19487, 	-20.0, 	0.0, 	60.0, 	10, 	"Белая вытянутая шляпа", 					"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*400*/{18962, 	50.0, 	-130.0, 100.0, 	10, 	"Тёмная шляпа", 							"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*401*/{19095, 	50.0, 	-130.0, 100.0, 	10, 	"Коричневая шляпа", 						"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*402*/{19097, 	50.0, 	-130.0, 100.0, 	10, 	"Тёмно-красная шляпа", 						"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*403*/{19098, 	50.0, 	-130.0, 100.0, 	10, 	"Тёмно-коричневая шляпа", 					"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*404*/{19099, 	50.0, 	-130.0, 100.0, 	10, 	"Полицейская шляпа", 						"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*405*/{19100, 	50.0, 	-130.0, 100.0, 	10, 	"Полицейская шляпа №2", 					"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*406*/{18977, 	-20.0, 	0.0, 	60.0, 	10, 	"Красный шлем мотоциклиста", 				"Данный шлем можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*407*/{18978, 	-20.0, 	0.0, 	60.0, 	10, 	"Белый шлем мотоциклиста", 					"Данный шлем можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*408*/{18979, 	-20.0, 	0.0, 	60.0, 	10, 	"Фиолетовый шлем мотоциклиста", 			"Данный шлем можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*409*/{18645, 	-20.0, 	0.0, 	60.0, 	10, 	"Тёмно-красный шлем мотоциклиста", 			"Данный шлем можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*410*/{19094, 	50.0, 	-130.0, 100.0, 	10, 	"Бургер шапка", 							"Данную шапку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*411*/{19137, 	50.0, 	-130.0, 100.0, 	10,		"Петушиная шапка", 							"Данную шапку можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*412*/{19528, 	50.0, 	-130.0, 100.0, 	10,		"Шляпа волшебника", 						"Данную шляпу можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для головы персонажа."},
	/*413*/{19421, 	100.0, 	30.0, 	0.0, 	10, 	"Белые наушники", 							"Данные наушники можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для наушников персонажа."},
	/*414*/{19422, 	100.0, 	30.0, 	0.0, 	10, 	"Чёрные наушники", 							"Данные наушники можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для наушников персонажа."},
	/*415*/{19423, 	100.0, 	30.0, 	0.0, 	10, 	"Оранжевые наушники", 						"Данные наушники можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для наушников персонажа."},
	/*416*/{19424, 	100.0, 	30.0, 	0.0, 	10, 	"Синие наушники", 							"Данные наушники можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для наушников персонажа."},
	/*417*/{19138, 	0.0, 	0.0, 	60.0, 	10, 	"Чёрные солнцезащитные очки", 				"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*418*/{19139, 	0.0, 	0.0, 	60.0, 	10, 	"Красные солнцезащитные очки", 				"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*419*/{19140, 	0.0, 	0.0, 	60.0, 	10, 	"Синие солнцезащитные очки", 				"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*420*/{19006, 	0.0, 	0.0, 	60.0, 	10, 	"Красные с блеском очки", 					"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*421*/{19007, 	0.0, 	0.0, 	60.0, 	10, 	"Жёлтые с блеском очки", 					"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*422*/{19008, 	0.0, 	0.0, 	60.0, 	10, 	"Зелёные с блеском очки", 					"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*423*/{19009, 	0.0, 	0.0, 	60.0, 	10, 	"Синие с блеском очки", 					"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*424*/{19010, 	0.0, 	0.0, 	60.0, 	10, 	"Розовые с блеском очки", 					"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*425*/{19011, 	0.0, 	0.0, 	60.0, 	10, 	"Волнистые с блеском очки", 				"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*426*/{19012, 	0.0, 	0.0, 	60.0, 	10, 	"Чёрные с блеском очки", 					"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*427*/{19013, 	0.0, 	0.0, 	60.0, 	10, 	"Серые с блеском очки", 					"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*428*/{19014, 	0.0, 	0.0, 	60.0, 	10, 	"Квадратные с блеском очки", 				"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*429*/{19015, 	0.0, 	0.0, 	60.0, 	10, 	"Прозрачные с блеском очки", 				"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*430*/{19016, 	0.0, 	0.0, 	60.0, 	10, 	"Оранжевые с блеском очки", 				"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*431*/{19017, 	0.0, 	0.0, 	60.0, 	10, 	"Простые чёрные очки", 						"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*432*/{19022, 	0.0, 	0.0, 	60.0, 	10, 	"Серые авиаторские очки", 					"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*433*/{19023, 	0.0, 	0.0, 	60.0, 	10, 	"Синие авиаторские очки", 					"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*434*/{19024, 	0.0, 	0.0, 	60.0, 	10, 	"Фиолетовые авиаторские очки", 				"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*435*/{19025, 	0.0, 	0.0, 	60.0, 	10, 	"Розовые авиаторские очки", 				"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*436*/{19026, 	0.0, 	0.0, 	60.0, 	10, 	"Красные авиаторские очки", 				"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*437*/{19027, 	0.0, 	0.0, 	60.0, 	10, 	"Оранжевые авиаторские очки", 				"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*438*/{19028, 	0.0, 	0.0, 	60.0, 	10, 	"Жёлтые авиаторские очки", 					"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*439*/{19029, 	0.0, 	0.0, 	60.0, 	10, 	"Зелёные авиаторские очки", 				"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*440*/{19030, 	0.0, 	0.0, 	60.0, 	10, 	"Прозрачные очки", 							"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*441*/{19033, 	0.0, 	0.0, 	60.0, 	10, 	"Чёрные очки", 								"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*442*/{19035, 	0.0, 	0.0, 	60.0, 	10, 	"Разбитые очки", 							"Данные очки можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для очков персонажа."},
	/*443*/{18911, 	120.0, 	160.0, 	0.0, 	10, 	"Маска с черепами", 						"Данную маску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для маски персонажа."},
	/*444*/{18912, 	120.0, 	160.0, 	0.0, 	10, 	"Чёрная маска", 							"Данную маску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для маски персонажа."},
	/*445*/{18913, 	120.0, 	160.0, 	0.0, 	10, 	"Зелёная маска", 							"Данную маску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для маски персонажа."},
	/*446*/{18914, 	120.0, 	160.0, 	0.0, 	10, 	"Военная маска", 							"Данную маску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для маски персонажа."},
	/*447*/{18915, 	120.0, 	160.0, 	0.0, 	10, 	"Радужная маска", 							"Данную маску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для маски персонажа."},
	/*448*/{18916, 	120.0, 	160.0, 	0.0, 	10, 	"Жёлтая маска", 							"Данную маску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для маски персонажа."},
	/*449*/{18917, 	120.0, 	160.0, 	0.0, 	10, 	"Волнистая маска", 							"Данную маску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для маски персонажа."},
	/*450*/{18918, 	120.0, 	160.0, 	0.0, 	10, 	"Светло-зелёная маска", 					"Данную маску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для маски персонажа."},
	/*451*/{18919, 	120.0, 	160.0, 	0.0, 	10, 	"Белая маска", 								"Данную маску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для маски персонажа."},
	/*452*/{18920, 	120.0, 	160.0, 	0.0, 	10, 	"Тёмно-жёлтая маска", 						"Данную маску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для маски персонажа."},
	/*453*/{11704, 	5.0, 	0.0, 	0.0, 	10,		"Маска дьявола", 							"Данную маску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для маски персонажа."},
	/*454*/{19036, 	-20.0, 	0.0, 	80.0, 	10, 	"Белая маска хоккеиста", 					"Данную маску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для маски персонажа."},
	/*455*/{19037, 	-20.0, 	0.0, 	80.0, 	10, 	"Красная маска хоккеиста", 					"Данную маску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для маски персонажа."},
	/*456*/{19038, 	-20.0, 	0.0, 	80.0, 	10, 	"Зелёная маска хоккеиста", 					"Данную маску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для маски персонажа."},
	/*457*/{19472, 	-20.0, 	0.0, 	60.0, 	10, 	"Респиратор", 								"Данную маску можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для маски персонажа."},
	/*458*/{19469, 	50.0, 	0.0, 	60.0, 	10, 	"Шарф", 									"Данный шарф можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для маски персонажа."},
	/*459*/{19039, 	20.0, 	0.0, 	10.0, 	10, 	"Золотые часы", 							"Данные часы можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для часов персонажа."},
	/*460*/{19040, 	20.0, 	0.0, 	10.0, 	10, 	"Серебряные часы", 							"Данные часы можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для часов персонажа."},
	/*461*/{19041, 	20.0, 	0.0, 	10.0, 	10, 	"Бронзовые часы", 							"Данные часы можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для часов персонажа."},
	/*462*/{19042, 	20.0, 	0.0, 	10.0, 	10, 	"Золотые часы №2", 							"Данные часы можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для часов персонажа."},
	/*463*/{19043, 	20.0, 	0.0, 	10.0, 	10, 	"Серебряные часы №2", 						"Данные часы можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для часов персонажа."},
	/*464*/{19044, 	20.0, 	0.0, 	10.0, 	10, 	"Светло-фиолетовые часы FACE", 				"Данные часы можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для часов персонажа."},
	/*465*/{19045, 	20.0, 	0.0, 	10.0, 	10, 	"Красные часы FACE", 						"Данные часы можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для часов персонажа."},
	/*466*/{19046, 	20.0, 	0.0, 	10.0, 	10, 	"Зелёные часы FACE", 						"Данные часы можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для часов персонажа."},
	/*467*/{19047, 	20.0, 	0.0, 	10.0, 	10, 	"Тёмно-фиолетовые часы FACE", 				"Данные часы можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для часов персонажа."},
	/*468*/{19048, 	20.0, 	0.0, 	10.0, 	10, 	"Морские часы PRO",	 						"Данные часы можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для часов персонажа."},
	/*469*/{19049, 	20.0, 	0.0, 	10.0, 	10, 	"Радужные часы PRO", 						"Данные часы можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для часов персонажа."},
	/*470*/{19050, 	20.0, 	0.0, 	10.0, 	10, 	"Синие часы PRO", 							"Данные часы можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для часов персонажа."},
	/*471*/{19051, 	20.0, 	0.0, 	10.0, 	10, 	"Оранжевые часы PRO", 						"Данные часы можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для часов персонажа."},
	/*472*/{19052, 	20.0, 	0.0, 	10.0, 	10, 	"Красно-розовые часы PRO", 					"Данные часы можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для часов персонажа."},
	/*473*/{19053, 	20.0, 	0.0, 	10.0, 	10, 	"Военные часы PRO", 						"Данные часы можно получить в кейсах или на торговой площадке.\nИспользуется в качестве аксессуара для часов персонажа."}
};

static
	inv_PlayerItemInfo[MAX_PLAYERS][E_INV_PLAYER_IN_INFO],
	inv_PlayerTDInfo[MAX_PLAYERS][E_INV_PLAYER_TD_INFO];

static
	inv_PlayerCase[MAX_PLAYERS][E_CASE_PLAYER_INFO],
	inv_PlayerCaseTimer[MAX_PLAYERS],
	inv_PlayerCaseBox[MAX_PLAYERS];

static
	PlayerText:TD_InvBase[MAX_PLAYERS][30],
	PlayerText:TD_InvCellItem[MAX_PLAYERS][INV_TD_MAX_ITEMS],
	PlayerText:TD_InvCellItemCount[MAX_PLAYERS][INV_TD_MAX_ITEMS],
	PlayerText:TD_InvCellBanner[MAX_PLAYERS][INV_TD_MAX_BANNERS],
	PlayerText:TD_InvCellBannerSprite[MAX_PLAYERS][INV_TD_MAX_BANNERS],
	PlayerText:TD_InvCellBannerCount[MAX_PLAYERS][INV_TD_MAX_BANNERS],
	PlayerText:TD_InvActionCell[MAX_PLAYERS][5];

static const
	inv_MaleRewardItemsCase[][CASE_ITEMS_MALE] = {

	{ // Дешёвые предметы
		466, 440, 343, 347, 351, 356, 368, 335, 323, 444, 451, 386, 398, // Предметы
		6, 7, 8, 14, 15, 16, 20, 21, 22, 23, 27, 42, 72, 78, 79, 134, 137, 162, 200, 303, 304, 305 // Скины
	},
	{ // Средние предметы
		467, 470, 473, 417, 420, 426, 344, 352, 366, 333, 323, 341, 448, 379, 389, 407, 400, // Предметы
		4, 5, 17, 18, 19, 24, 25, 28, 29, 30, 34, 35, 36, 37, 45, 46, 47, 48, 60, 66, 67, 73, 125, 167, 206 // Скины
	},
	{ // Дорогие предметы
		468, 471, 463, 462, 430, 431, 435, 439, 348, 359, 460, 367, 338, 326, 320, 346, 456, 452, 370, 374, 376, 391, 409, 405, 411, 412, 413, 453, // Предметы
		26, 32, 33, 43, 44, 59, 61, 68, 70, 80, 81, 82, 83, 84, 86, 94, 95, 96, 97, 98, 100, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 123, 114, // Скины
		115, 116, 119, 123, 127, 132, 133, 142, 149, 154, 163, 165, 173, 174, 175, 187, 204, 220, 221, 241, 249, 285, 294
	}
};

static const
	inv_FemaleRewardItemsCase[][CASE_ITEMS_FEMALE] = {

	{ // Дешёвые предметы
		466, 440, 343, 347, 351, 356, 368, 335, 323, 444, 451, 386, 398, // Предметы
		9, 10, 11, 12, 31, 38, 39, 54, 63, 69, 77, 87, 88, 93, 193, 205 // Скины
	},
	{ // Средние предметы
		467, 470, 473, 417, 420, 426, 344, 352, 366, 333, 323, 341, 448, 379, 389, 407, 400, // Предметы
		40, 64, 75, 76, 130, 131, 150, 151, 172, 190, 191, 192, 194 // Скины
	},
	{ // Дорогие предметы
		468, 471, 463, 462, 430, 431, 435, 439, 348, 359, 460, 367, 338, 326, 320, 346, 456, 452, 370, 374, 376, 391, 409, 405, 411, 412, 413, 453, // Предметы
		13, 65, 91, 129, 152, 169, 195, 201, 214, 215, 216, 219, 224, 233, 238, 263, 298, 306 // Скины
	}
};

/*

	* Functions *

*/

stock Inv_GetMaxItems()
{
	return sizeof(inv_ItemInfo);
}

stock Inv_GetMaxBanners()
{
	return sizeof(inv_BannerInfo);
}

stock Inv_GetNameItem(item_id)
{
	static
		str[INV_MAX_ITEM_NAME_LENGTH + 1];

	str[0] = EOS;
	
	strcat(str, inv_ItemInfo[item_id][IT_Name]);
	return str;
}

stock Inv_GetInfoItem(item_id)
{
	static
		str[INV_MAX_ITEM_INFO_LENGTH + 1];

	str[0] = EOS;

	strcat(str, inv_ItemInfo[item_id][IT_Info]);
	return str;
}

stock Inv_GetModelItem(item_id)
{
	return inv_ItemInfo[item_id][IT_Model];
}

stock Inv_GetPosItem(item_id, &Float:x, &Float:y, &Float:z)
{
	x = inv_ItemInfo[item_id][IT_PosX];
	y = inv_ItemInfo[item_id][IT_PosY];
	z = inv_ItemInfo[item_id][IT_PosZ];
	return 1;
}

stock Inv_GetNameBanner(banner_id)
{
	static
		str[INV_MAX_ITEM_NAME_LENGTH + 1];

	str[0] = EOS;
	
	strcat(str, inv_BannerInfo[banner_id][BN_Name]);
	return str;
}

stock Inv_GetInfoBanner(banner_id)
{
	static
		str[INV_MAX_ITEM_INFO_LENGTH + 1];

	str[0] = EOS;
	
	strcat(str, inv_BannerInfo[banner_id][BN_Info]);
	return str;
}

stock Inv_GetPlayerStandSkin(playerid)
{
	return inv_PlayerItemInfo[playerid][IN_StandSkin];
}

stock Inv_GetPlayerSkin(playerid)
{
	return inv_PlayerItemInfo[playerid][IN_Skin];
}

stock Inv_GetPlayerHead(playerid)
{
	return inv_PlayerItemInfo[playerid][IN_Head];
}

stock Inv_GetPlayerHeadphones(playerid)
{
	return inv_PlayerItemInfo[playerid][IN_Headphones];
}

stock Inv_GetPlayerGlasses(playerid)
{
	return inv_PlayerItemInfo[playerid][IN_Glasses];
}

stock Inv_GetPlayerMask(playerid)
{
	return inv_PlayerItemInfo[playerid][IN_Mask];
}

stock Inv_GetPlayerWatch(playerid)
{
	return inv_PlayerItemInfo[playerid][IN_Watch];
}

stock Inv_GetPlayerBanner(playerid)
{
	return inv_PlayerItemInfo[playerid][IN_Banner];
}

stock Inv_GetBannerModel(banner_id)
{
	new
		str[INV_MAX_ITEM_NAME_LENGTH];
	
	strcat(str, inv_BannerInfo[banner_id][BN_Model]);
	return str;
}

stock Inv_GetPlayerCellItem(playerid, num)
{
	return pInfo[playerid][pInvItem][num];
}

stock Inv_GetPlayerCellItemCount(playerid, num)
{
	return pInfo[playerid][pInvItemCount][num];
}

stock Inv_GetPlayerCellBanner(playerid, num)
{
	return pInfo[playerid][pInvBanner][num];
}

stock Inv_GetPlayerCellBannerCount(playerid, num)
{
	return pInfo[playerid][pInvBannerCount][num];
}

stock Inv_PlayerCreateAccount(playerid)
{
	if(GetPlayerSex(playerid) == SEX_MALE) {
		new
			random_skin = random_ex(1, 3, 1);

		inv_PlayerItemInfo[playerid][IN_StandSkin] = random_skin;
		inv_PlayerItemInfo[playerid][IN_Skin] = random_skin;
	}
	else {
		switch(random(3)) {
			case 0: {
				inv_PlayerItemInfo[playerid][IN_StandSkin] = 55;
				inv_PlayerItemInfo[playerid][IN_Skin] = 55;
			}
			case 1: {
				inv_PlayerItemInfo[playerid][IN_StandSkin] = 56;
				inv_PlayerItemInfo[playerid][IN_Skin] = 56;
			}
			case 2: {
				inv_PlayerItemInfo[playerid][IN_StandSkin] = 90;
				inv_PlayerItemInfo[playerid][IN_Skin] = 90;
			}
		}
	}

	// Обычный кейс
	pInfo[playerid][pInvItem][0] = 312;
	pInfo[playerid][pInvItemCount][0] = 0;

	// Баннер
	inv_PlayerItemInfo[playerid][IN_Banner] = INITIAL_PLAYER_BANNER;
	return 1;
}

stock Inv_SetPlayerItem(playerid, itemid, amount)
{
	if(itemid == 0)
		return 1;

	switch(Inv_CheckItemDestination(itemid)) {
		case INV_PLAYER_DEST_CASES: {
			for(new i = 0, c = 0, t = 0; i < INV_PLAYER_MAX_ITEMS; i++, c++) {
				if(c == INV_TD_MAX_ITEMS) {
					c = 0;
					t++;
				}

				if(pInfo[playerid][pInvItem][i] > 0) 
					continue;

				pInfo[playerid][pInvItem][i] = itemid;

				if(amount > 
					inv_ItemInfo[itemid][IT_Max]) amount = inv_ItemInfo[itemid][IT_Max];

				pInfo[playerid][pInvItemCount][i] = amount;
				UpdatePlayerTDInventory(playerid, 1, t, i, c);
				break;
			}
		}
		default: {
			for(new i = 0, c = 0, t = 0; i < INV_PLAYER_MAX_ITEMS; i++, c++) {
				if(amount <= 0) 
					break;

				if(c == INV_TD_MAX_ITEMS) {
					c = 0;
					t++;
				}

				if(pInfo[playerid][pInvItem][i] > 0) {
					if(pInfo[playerid][pInvItem][i] == itemid) {
						if((pInfo[playerid][pInvItemCount][i] + amount) > inv_ItemInfo[itemid][IT_Max]) {
							amount = (pInfo[playerid][pInvItemCount][i] + amount) - inv_ItemInfo[itemid][IT_Max];
							pInfo[playerid][pInvItemCount][i] = inv_ItemInfo[itemid][IT_Max];
						}
						else 
							pInfo[playerid][pInvItemCount][i] = pInfo[playerid][pInvItemCount][i] + amount, amount = 0;

						UpdatePlayerTDInventory(playerid, 1, t, i, c);
					}
					else 
						continue;
				}
				else {
					pInfo[playerid][pInvItem][i] = itemid;

					if(amount > inv_ItemInfo[itemid][IT_Max]) {
						amount = amount - inv_ItemInfo[itemid][IT_Max];
						pInfo[playerid][pInvItemCount][i] = inv_ItemInfo[itemid][IT_Max];
					}
					else 
						pInfo[playerid][pInvItemCount][i] = pInfo[playerid][pInvItemCount][i] + amount, amount = 0;

					UpdatePlayerTDInventory(playerid, 1, t, i, c);
				}
			}
		}
	}

	Inv_SavePlayer(playerid);
	return 1;
}

stock Inv_SetPlayerBanner(playerid, itemid, amount)
{
	if(itemid == 0)
		return 1;

	for(new i = 0, c = 0, t = 0; i < INV_PLAYER_MAX_BANNERS; i++, c++) {
		if(amount <= 0)
			break;

		if(c == INV_TD_MAX_BANNERS) {
			c = 0;
			t++;
		}

		if(pInfo[playerid][pInvBanner][i] > 0) {
			if(pInfo[playerid][pInvBanner][i] == itemid) {
				if((pInfo[playerid][pInvBannerCount][i] + amount) > inv_BannerInfo[itemid][BN_Max]) {
					amount = (pInfo[playerid][pInvBannerCount][i] + amount) - inv_BannerInfo[itemid][BN_Max];
					pInfo[playerid][pInvBannerCount][i] = inv_BannerInfo[itemid][BN_Max];
				}
				else
					pInfo[playerid][pInvBannerCount][i] = pInfo[playerid][pInvBannerCount][i] + amount, amount = 0;

				UpdatePlayerTDInventory(playerid, 2, t, i, c);
			}
			else
				continue;
		}
		else {
			pInfo[playerid][pInvBanner][i] = itemid;

			if(amount > inv_BannerInfo[itemid][BN_Max]) {
				amount = amount - inv_BannerInfo[itemid][BN_Max];
				pInfo[playerid][pInvBannerCount][i] = inv_BannerInfo[itemid][BN_Max];
			}
			else
				pInfo[playerid][pInvBannerCount][i] = pInfo[playerid][pInvBannerCount][i] + amount, amount = 0;

			UpdatePlayerTDInventory(playerid, 2, t, i, c);
		}
	}
	Inv_SavePlayer(playerid);
	return 1;
}

stock Inv_CheckPlayerFullItem(playerid, item_id = -1, item_amount = 0)
{
	new
		bool:full_inv = false;

	if(item_id > -1) {
		switch(Inv_CheckItemDestination(item_id)) {
			case 0: full_inv = true;
			case INV_PLAYER_DEST_CASES: {
				n_for(i, INV_PLAYER_MAX_ITEMS) {
					if(pInfo[playerid][pInvItem][i] > 0) 
						continue;

					if(item_amount > inv_ItemInfo[item_id][IT_Max])
						item_amount = inv_ItemInfo[item_id][IT_Max];

					full_inv = true;
					break;
				}
			}
			default: {
				n_for(i, INV_PLAYER_MAX_ITEMS) {
					if(item_amount <= 0) { // Цикл будет работать пока не станет ноль
						full_inv = true;
						break;
					}

					if(pInfo[playerid][pInvItem][i] == item_id) {
						if((pInfo[playerid][pInvItemCount][i] + item_amount) > inv_ItemInfo[item_id][IT_Max])
							item_amount = (pInfo[playerid][pInvItemCount][i] + item_amount) - inv_ItemInfo[item_id][IT_Max];
						else 
							item_amount = 0;
					}
					else if(pInfo[playerid][pInvItem][i] == 0) {
						if(item_amount > inv_ItemInfo[item_id][IT_Max])
							item_amount = item_amount - inv_ItemInfo[item_id][IT_Max];
						else 
							item_amount = 0;
					}
				}	
			}
		}
	}
	else {
		n_for(i, INV_PLAYER_MAX_ITEMS) {
			if(pInfo[playerid][pInvItem][i] == 0) {
				full_inv = true;
				break;
			}
		}	
	}

	if(!full_inv)
		return 0;
	
	return 1;
}

stock Inv_CheckPlayerFullBanner(playerid, item_id = -1, item_amount = 0)
{
	new
		bool:full_inv = false;

	if(item_id > -1) {
		n_for(i, INV_PLAYER_MAX_BANNERS) {
			if(item_amount <= 0) { // Цикл будет работать пока не будет ноль
				full_inv = true;
				break;
			}

			if(pInfo[playerid][pInvBanner][i] == item_id) {
				if((pInfo[playerid][pInvBannerCount][i] + item_amount) > inv_BannerInfo[item_id][BN_Max])
					item_amount = (pInfo[playerid][pInvBannerCount][i] + item_amount) - inv_BannerInfo[item_id][BN_Max];
				else 
					item_amount = 0;
			}
			else if(pInfo[playerid][pInvBanner][i] == 0) {
				if(item_amount > inv_BannerInfo[item_id][BN_Max])
					item_amount = item_amount - inv_BannerInfo[item_id][BN_Max];
				else 
					item_amount = 0;
			}
		}
	}
	else {
		n_for(i, INV_PLAYER_MAX_BANNERS) {
			if(pInfo[playerid][pInvBanner][i] == 0) {
				full_inv = true;
				break;
			}
		}	
	}

	if(!full_inv)
		return 0;
	
	return 1;
}

stock Inv_CheckItemDestination(item_id)
{
	switch(item_id) {
		case 1..311: return INV_PLAYER_DEST_SKINS;
		case 312..314: return INV_PLAYER_DEST_CASES;
		case 315..412: return INV_PLAYER_DEST_HEAD;
		case 413..416: return INV_PLAYER_DEST_HEADPHONES;
		case 417..442: return INV_PLAYER_DEST_GLASSES;
		case 443..458: return INV_PLAYER_DEST_MASKS;
		case 459..473: return INV_PLAYER_DEST_WATCH;
	}
	return 0;
}

stock Inv_SetPlayerAttachItem(playerid)
{
	RemoveAttachPlayerItem(playerid);

	if(inv_PlayerItemInfo[playerid][IN_Head] > 0)
		GiveAttachPlayerItem(playerid, inv_PlayerItemInfo[playerid][IN_Head]);

	if(inv_PlayerItemInfo[playerid][IN_Headphones] > 0)
		GiveAttachPlayerItem(playerid, inv_PlayerItemInfo[playerid][IN_Headphones]);

	if(inv_PlayerItemInfo[playerid][IN_Glasses] > 0)
		GiveAttachPlayerItem(playerid, inv_PlayerItemInfo[playerid][IN_Glasses]);

	if(inv_PlayerItemInfo[playerid][IN_Mask] > 0)
		GiveAttachPlayerItem(playerid, inv_PlayerItemInfo[playerid][IN_Mask]);

	if(inv_PlayerItemInfo[playerid][IN_Watch] > 0)
		GiveAttachPlayerItem(playerid, inv_PlayerItemInfo[playerid][IN_Watch]);

	return 1;
}

stock GiveAttachPlayerItem(playerid, item_id)
{
	switch(item_id) {
		// Голова
		case 315, 316: SetAttachToPlayerSkin(playerid, item_id, 1); // Шлемы SWAT
		case 317, 318: SetAttachToPlayerSkin(playerid, item_id, 2); // Фуражки
		case 319, 322: SetAttachToPlayerSkin(playerid, item_id, 3); // Полицейские кепки 1
		case 320, 321: SetAttachToPlayerSkin(playerid, item_id, 4); // Полицейские кепки 2
		case 347..349: SetAttachToPlayerSkin(playerid, item_id, 5); // Шапки
		case 342, 343: SetAttachToPlayerSkin(playerid, item_id, 6); // Вязаные шапки
		case 344..346: SetAttachToPlayerSkin(playerid, item_id, 7); // Удлинённые шапки
		case 370, 371: SetAttachToPlayerSkin(playerid, item_id, 8); // Панамы
		case 323..341: SetAttachToPlayerSkin(playerid, item_id, 9); // Кепки
		case 385..393: SetAttachToPlayerSkin(playerid, item_id, 10); // Шляпы
		case 372..384: SetAttachToPlayerSkin(playerid, item_id, 11); // Каски
		case 351..369: SetAttachToPlayerSkin(playerid, item_id, 12); // Банданы
		case 350: SetAttachToPlayerSkin(playerid, item_id, 13); // Новогодняя шапка
		case 394..399: SetAttachToPlayerSkin(playerid, item_id, 14); // Шляпы
		case 400..405: SetAttachToPlayerSkin(playerid, item_id, 15); // Шляпы
		case 406..408: SetAttachToPlayerSkin(playerid, item_id, 16); // Шлем мотоциклиста
		case 410: SetAttachToPlayerSkin(playerid, item_id, 17); // Бургер шапка
		case 411: SetAttachToPlayerSkin(playerid, item_id, 18); // Петушиная шапка
		case 412: SetAttachToPlayerSkin(playerid, item_id, 19); // Шляпа волшебника

		// Наушники
		case 413..416: SetAttachToPlayerSkin(playerid, item_id, 1); // Наушники

		// Очки
		case 417..442: SetAttachToPlayerSkin(playerid, item_id, 1); //Очки

		// Маски 
		case 443..452: SetAttachToPlayerSkin(playerid, item_id, 1); // Маски
		case 454..456: SetAttachToPlayerSkin(playerid, item_id, 2); // Маски хоккеиста
		case 453: SetAttachToPlayerSkin(playerid, item_id, 3); // Маска дьявола
		case 457: SetAttachToPlayerSkin(playerid, item_id, 4); // Респиратор
		case 458: SetAttachToPlayerSkin(playerid, item_id, 5); // Шарф

		// Часы
		case 462..473: SetAttachToPlayerSkin(playerid, item_id, 1); // Часы
	}
	return 1;
}

stock RemoveAttachPlayerItem(playerid, index = -1)
{
	if(index > -1) {
		if(IsPlayerAttachedObjectSlotUsed(playerid, index))
			RemovePlayerAttachedObject(playerid, index);
	}
	else {
		n_for(i, MAX_PLAYER_ATTACH_ITEM) {
			if(IsPlayerAttachedObjectSlotUsed(playerid, i))
				RemovePlayerAttachedObject(playerid, i);
		}
	}
	return 1;
}

stock Inv_UpdateTDBase(playerid)
{
	// Скин
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][6], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Skin]][IT_Model]);
	PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][6], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Skin]][IT_PosX], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Skin]][IT_PosY], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Skin]][IT_PosZ], 1.000000);	
	
	// Голова
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][7], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Head]][IT_Model]);
	
	if(inv_PlayerItemInfo[playerid][IN_Head] > 0)
		PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][7], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Head]][IT_PosX], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Head]][IT_PosY], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Head]][IT_PosZ], 1.000000);
	else
		PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][7], 0.0, 0.0, 0.0, 1000.000000);	
	
	// Наушники
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][9], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Headphones]][IT_Model]);
	
	if(inv_PlayerItemInfo[playerid][IN_Headphones] > 0)
		PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][9], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Headphones]][IT_PosX], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Headphones]][IT_PosY], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Headphones]][IT_PosZ], 1.000000);
	else
		PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][9], 0.0, 0.0, 0.0, 1000.000000);	
	
	// Очки
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][11], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Glasses]][IT_Model]);
	
	if(inv_PlayerItemInfo[playerid][IN_Glasses] > 0)
		PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][11], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Glasses]][IT_PosX], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Glasses]][IT_PosY], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Glasses]][IT_PosZ], 1.000000);
	else
		PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][11], 0.0, 0.0, 0.0, 1000.000000);
	
	// Маска
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][13], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Mask]][IT_Model]);
	
	if(inv_PlayerItemInfo[playerid][IN_Mask] > 0)
		PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][13], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Mask]][IT_PosX], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Mask]][IT_PosY], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Mask]][IT_PosZ], 1.000000);
	else
		PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][13], 0.0, 0.0, 0.0, 1000.000000);
	
	// Часы
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][15], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Watch]][IT_Model]);
	
	if(inv_PlayerItemInfo[playerid][IN_Watch] > 0)
		PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][15], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Watch]][IT_PosX], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Watch]][IT_PosY], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Watch]][IT_PosZ], 1.000000);
	else
		PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][15], 0.0, 0.0, 0.0, 1000.000000);
	
	// Скин ID
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][17], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Skin]][IT_Model]);
	
	if(inv_PlayerItemInfo[playerid][IN_Skin] > 0)
		PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][17], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Skin]][IT_PosX], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Skin]][IT_PosY], inv_ItemInfo[inv_PlayerItemInfo[playerid][IN_Skin]][IT_PosZ], 1.000000);
	else
		PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][17], 0.0, 0.0, 0.0, 1000.000000);

	// Баннер
	PlayerTextDrawSetString(playerid, TD_InvBase[playerid][21], Inv_GetBannerModel(inv_PlayerItemInfo[playerid][IN_Banner]));
	
	static
		str[11 - 2 + 1 + 3];

	str[0] = EOS;

	f(str, "Скин_ID:_%i", inv_PlayerItemInfo[playerid][IN_Skin]);
	PlayerTextDrawSetString(playerid, TD_InvBase[playerid][18], str);
	return 1;
}

stock Inv_UpdatePLayerData(playerid)
{
	n_for(i, INV_PLAYER_MAX_ITEMS) {
		switch(Inv_CheckItemDestination(pInfo[playerid][pInvItem][i])) {
			case INV_PLAYER_DEST_CASES: {
				if(pInfo[playerid][pInvItemCount][i] > 0) {
					pInfo[playerid][pInvItemCount][i]--;
					Inv_SavePlayer(playerid);
				}
			}
		}
	}
	return 1;
}

stock Inv_IsItemForPlayer(playerid, item_id)
{
	switch(item_id) {
		// Голова
		case 399, 407: {
			if(Adm_GetPlayerLevel(playerid) < ADM_LEVEL_JUNIOR) {
				SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Данным аксессуаром пользуется только администратор.");
				return 0;
			} 
		}
		// Скины
		case 277, 278, 279: {
			if(Adm_GetPlayerLevel(playerid) < ADM_LEVEL_JUNIOR) {
				SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Данным скином пользуется только администратор.");
				return 0;
			}
		}
	}
	return 1;
}

stock Inv_ShowTDBase(playerid)
{
	TD_InvBase[playerid][0] = CreatePlayerTextDraw(playerid, 133.0000, 163.0000, "_"); // Задний чёрный фон персонаж
	PlayerTextDrawLetterSize(playerid, TD_InvBase[playerid][0], 0.0000, 22.6665);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][0], 256.0000, 0.0000);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][0], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawUseBox(playerid, TD_InvBase[playerid][0], true);
	PlayerTextDrawBoxColour(playerid, TD_InvBase[playerid][0], 336860413);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][0], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][0], TEXT_DRAW_FONT_AHARONI_BOLD);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][0], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][0], true);

	TD_InvBase[playerid][1] = CreatePlayerTextDraw(playerid, 133.0000, 163.0000, "_"); // Задний фон персонажа
	PlayerTextDrawLetterSize(playerid, TD_InvBase[playerid][1], 0.0000, 0.7998);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][1], 256.0000, 0.0000);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][1], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawUseBox(playerid, TD_InvBase[playerid][1], true);
	PlayerTextDrawBoxColour(playerid, TD_InvBase[playerid][1], 0xd9711cFF);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][1], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][1], TEXT_DRAW_FONT_AHARONI_BOLD);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][1], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][1], true);

	TD_InvBase[playerid][2] = CreatePlayerTextDraw(playerid, 195.0000, 160.0000, "Персонаж");
	PlayerTextDrawLetterSize(playerid, TD_InvBase[playerid][2], 0.2578, 1.2556);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][2], TEXT_DRAW_ALIGN_CENTER);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][2], -286331649);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][2], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][2], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][2], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][2], true);

	TD_InvBase[playerid][3] = CreatePlayerTextDraw(playerid, 262.0000, 163.0000, "_"); // Задний чёрный фон инвентаря
	PlayerTextDrawLetterSize(playerid, TD_InvBase[playerid][3], 0.0000, 25.2665);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][3], 477.0000, 0.0000);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][3], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawUseBox(playerid, TD_InvBase[playerid][3], true);
	PlayerTextDrawBoxColour(playerid, TD_InvBase[playerid][3], 336860413);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][3], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][3], TEXT_DRAW_FONT_AHARONI_BOLD);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][3], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][3], true);

	TD_InvBase[playerid][4] = CreatePlayerTextDraw(playerid, 262.0000, 163.0000, "_"); // Задний фон инвентаря
	PlayerTextDrawLetterSize(playerid, TD_InvBase[playerid][4], 0.0000, 0.7998);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][4], 477.0000, 0.0000);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][4], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawUseBox(playerid, TD_InvBase[playerid][4], true);
	PlayerTextDrawBoxColour(playerid, TD_InvBase[playerid][4], 0xd9711cFF);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][4], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][4], TEXT_DRAW_FONT_AHARONI_BOLD);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][4], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][4], true);

	TD_InvBase[playerid][5] = CreatePlayerTextDraw(playerid, 370.0000, 160.0000, "Инвентарь (предметы)");
	PlayerTextDrawLetterSize(playerid, TD_InvBase[playerid][5], 0.2578, 1.2556);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][5], TEXT_DRAW_ALIGN_CENTER);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][5], -286331649);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][5], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][5], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][5], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][5], true);

	TD_InvBase[playerid][6] = CreatePlayerTextDraw(playerid, 129.0000, 195.0000, "_"); // Скин
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][6], TEXT_DRAW_FONT_PREVIEW);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][6], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][6], -1061109505);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][6], 0x00000000);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][6], false);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][6], 0);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][6], 137.0000, 160.0000);
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][6], 5);
	PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][6], 0.0000, 0.0000, 0.0000, 1.0000);

	TD_InvBase[playerid][7] = CreatePlayerTextDraw(playerid, 133.0000, 180.0000, "_"); // Задний чёрный фон головы
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][7], TEXT_DRAW_FONT_PREVIEW);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][7], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][7], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][7], 892613887);
	PlayerTextDrawSetSelectable(playerid, TD_InvBase[playerid][7], true);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][7], false);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][7], 0);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][7], 31.0000, 30.0000);
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][7], 19137);
	PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][7], 50.0000, -130.0000, 100.0000, 1.0000);

	TD_InvBase[playerid][8] = CreatePlayerTextDraw(playerid, 133.0000, 171.0000, "Голова");
	PlayerTextDrawLetterSize(playerid, TD_InvBase[playerid][8], 0.1473, 0.9693);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][8], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][8], -875836929);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][8], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][8], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][8], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][8], true);

	TD_InvBase[playerid][9] = CreatePlayerTextDraw(playerid, 133.0000, 219.0000, "_"); // Задний чёрный фон наушников
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][9], TEXT_DRAW_FONT_PREVIEW);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][9], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][9], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][9], 892613887);
	PlayerTextDrawSetSelectable(playerid, TD_InvBase[playerid][9], true);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][9], false);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][9], 0);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][9], 31.0000, 30.0000);
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][9], 19421);
	PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][9], 100.0000, 30.0000, 0.0000, 1.0000);

	TD_InvBase[playerid][10] = CreatePlayerTextDraw(playerid, 133.0000, 210.0000, "Наушники");
	PlayerTextDrawLetterSize(playerid, TD_InvBase[playerid][10], 0.1473, 0.9693);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][10], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][10], -875836929);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][10], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][10], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][10], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][10], true);

	TD_InvBase[playerid][11] = CreatePlayerTextDraw(playerid, 133.0000, 258.0000, "_"); // Задний чёрный фон очков
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][11], TEXT_DRAW_FONT_PREVIEW);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][11], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][11], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][11], 892613887);
	PlayerTextDrawSetSelectable(playerid, TD_InvBase[playerid][11], true);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][11], false);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][11], 0);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][11], 31.0000, 30.0000);
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][11], 19010);
	PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][11], 0.0000, 0.0000, 60.0000, 1.0000);

	TD_InvBase[playerid][12] = CreatePlayerTextDraw(playerid, 133.0000, 249.0000, "Очки");
	PlayerTextDrawLetterSize(playerid, TD_InvBase[playerid][12], 0.1473, 0.9693);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][12], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][12], -875836929);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][12], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][12], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][12], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][12], true);

	TD_InvBase[playerid][13] = CreatePlayerTextDraw(playerid, 133.0000, 297.0000, "_"); // Задний чёрный фон маски
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][13], TEXT_DRAW_FONT_PREVIEW);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][13], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][13], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][13], 892613887);
	PlayerTextDrawSetSelectable(playerid, TD_InvBase[playerid][13], true);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][13], false);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][13], 0);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][13], 31.0000, 30.0000);
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][13], 18918);
	PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][13], 120.0000, 160.0000, 0.0000, 1.0000);

	TD_InvBase[playerid][14] = CreatePlayerTextDraw(playerid, 133.0000, 288.0000, "Маска");
	PlayerTextDrawLetterSize(playerid, TD_InvBase[playerid][14], 0.1473, 0.9693);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][14], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][14], -875836929);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][14], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][14], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][14], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][14], true);

	TD_InvBase[playerid][15] = CreatePlayerTextDraw(playerid, 133.0000, 336.0000, "_"); // Задний чёрный фон часов
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][15], TEXT_DRAW_FONT_PREVIEW);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][15], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][15], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][15], 892613887);
	PlayerTextDrawSetSelectable(playerid, TD_InvBase[playerid][15], true);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][15], false);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][15], 0);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][15], 31.0000, 30.0000);
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][15], 19039);
	PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][15], 20.0000, 0.0000, 10.0000, 1.0000);

	TD_InvBase[playerid][16] = CreatePlayerTextDraw(playerid, 133.0000, 327.0000, "Часы");
	PlayerTextDrawLetterSize(playerid, TD_InvBase[playerid][16], 0.1473, 0.9693);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][16], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][16], -875836929);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][16], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][16], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][16], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][16], true);

	TD_InvBase[playerid][17] = CreatePlayerTextDraw(playerid, 225.0000, 180.0000, "_"); // Задний чёрный фон скина
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][17], TEXT_DRAW_FONT_PREVIEW);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][17], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][17], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][17], 892613887);
	PlayerTextDrawSetSelectable(playerid, TD_InvBase[playerid][17], true);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][17], false);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][17], 0);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][17], 31.0000, 30.0000);
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][17], 1);
	PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][17], 0.0000, 0.0000, 0.0000, 1.0000);

	TD_InvBase[playerid][18] = CreatePlayerTextDraw(playerid, 256.0000, 171.0000, "_"); // ID скина
	PlayerTextDrawLetterSize(playerid, TD_InvBase[playerid][18], 0.1473, 0.9693);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][18], 238.3332, 0.0000);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][18], TEXT_DRAW_ALIGN_RIGHT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][18], -875836929);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][18], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][18], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][18], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][18], true);

	TD_InvBase[playerid][19] = CreatePlayerTextDraw(playerid, 225.0000, 219.0000, "_"); // Задний чёрный кубик баннера
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][19], TEXT_DRAW_FONT_PREVIEW);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][19], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][19], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][19], 892613887);
	PlayerTextDrawSetSelectable(playerid, TD_InvBase[playerid][19], true);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][19], false);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][19], 0);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][19], 31.0000, 30.0000);
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][19], 19039);
	PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][19], 20.0000, 0.0000, 10.0000, 1000.0000);

	TD_InvBase[playerid][20] = CreatePlayerTextDraw(playerid, 256.0000, 210.0000, "Баннер");
	PlayerTextDrawLetterSize(playerid, TD_InvBase[playerid][20], 0.1473, 0.9693);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][20], TEXT_DRAW_ALIGN_RIGHT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][20], -875836929);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][20], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][20], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][20], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][20], true);

	TD_InvBase[playerid][21] = CreatePlayerTextDraw(playerid, 227.0000, 221.0000, "ld_drv:naward"); // Спрайт баннера
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][21], 27.0000, 26.0000);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][21], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][21], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][21], 255);
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][21], TEXT_DRAW_FONT_SPRITE);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][21], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][21], false);

	TD_InvBase[playerid][22] = CreatePlayerTextDraw(playerid, 342.0000, 379.0000, "_"); // Первый отсек
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][22], TEXT_DRAW_FONT_PREVIEW);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][22], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][22], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][22], 10102203);
	PlayerTextDrawSetSelectable(playerid, TD_InvBase[playerid][22], true);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][22], false);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][22], 0);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][22], 23.0000, 10.0000);
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][22], 0);
	PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][22], 0.0000, 0.0000, 0.0000, 1000.0000);

	TD_InvBase[playerid][23] = CreatePlayerTextDraw(playerid, 368.0000, 379.0000, "_"); // Второй отсек
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][23], TEXT_DRAW_FONT_PREVIEW);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][23], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][23], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][23], 1717987003);
	PlayerTextDrawSetSelectable(playerid, TD_InvBase[playerid][23], true);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][23], false);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][23], 0);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][23], 23.0000, 10.0000);
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][23], 0);
	PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][23], 0.0000, 0.0000, 0.0000, 1000.0000);

	TD_InvBase[playerid][24] = CreatePlayerTextDraw(playerid, 132.0000, 371.9035, "_"); // Задний белый фон закрыть
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][24], TEXT_DRAW_FONT_PREVIEW);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][24], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][24], -1717986817);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][24], -1717986817);
	PlayerTextDrawSetSelectable(playerid, TD_InvBase[playerid][24], true);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][24], false);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][24], 0);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][24], 62.0000, 21.0000);
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][24], 0);
	PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][24], 0.0000, 0.0000, 0.0000, 1000.0000);

	TD_InvBase[playerid][25] = CreatePlayerTextDraw(playerid, 133.0000, 373.0000, "_"); // Задний чёрный фон закрыть
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][25], TEXT_DRAW_FONT_PREVIEW);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][25], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][25], 353703167);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][25], 353703167);
	PlayerTextDrawSetSelectable(playerid, TD_InvBase[playerid][25], true);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][25], false);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][25], 0);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][25], 60.0000, 19.0000);
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][25], 0);
	PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][25], 0.0000, 0.0000, 0.0000, 1000.0000);

	TD_InvBase[playerid][26] = CreatePlayerTextDraw(playerid, 163.0000, 376.0000, "Закрыть");
	PlayerTextDrawLetterSize(playerid, TD_InvBase[playerid][26], 0.2578, 1.2556);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][26], 15.0000, 60.0000);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][26], TEXT_DRAW_ALIGN_CENTER);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][26], -517395969);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][26], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][26], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][26], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][26], true);
	PlayerTextDrawSetSelectable(playerid, TD_InvBase[playerid][26], true);

	TD_InvBase[playerid][27] = CreatePlayerTextDraw(playerid, 195.0000, 372.0000, "_"); // Задний белый фон баннер
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][27], TEXT_DRAW_FONT_PREVIEW);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][27], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][27], -1717986817);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][27], -1717986817);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][27], false);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][27], 0);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][27], 62.0000, 21.0000);
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][27], 0);
	PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][27], 0.0000, 0.0000, 0.0000, 1000.0000);

	TD_InvBase[playerid][28] = CreatePlayerTextDraw(playerid, 196.0000, 373.0000, "_"); // Задний чёрный фон банне
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][28], TEXT_DRAW_FONT_PREVIEW);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][28], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][28], 353703167);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][28], 353703167);
	PlayerTextDrawSetSelectable(playerid, TD_InvBase[playerid][28], true);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][28], false);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][28], 0);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][28], 60.0000, 19.0000);
	PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][28], 0);
	PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][28], 0.0000, 0.0000, 0.0000, 1000.0000);

	TD_InvBase[playerid][29] = CreatePlayerTextDraw(playerid, 225.6667, 375.5851, "Баннеры");
	PlayerTextDrawLetterSize(playerid, TD_InvBase[playerid][29], 0.2578, 1.2556);
	PlayerTextDrawTextSize(playerid, TD_InvBase[playerid][29], 15.0000, 60.0000);
	PlayerTextDrawAlignment(playerid, TD_InvBase[playerid][29], TEXT_DRAW_ALIGN_CENTER);
	PlayerTextDrawColour(playerid, TD_InvBase[playerid][29], 885302783);
	PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][29], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_InvBase[playerid][29], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_InvBase[playerid][29], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvBase[playerid][29], true);
	PlayerTextDrawSetSelectable(playerid, TD_InvBase[playerid][29], true);
	return 1;
}

static CheckItemOnTDPlayerInventory(item_id, &itemtd_id, &tab_list)
{
	for(new i = 0, c = 0; i < INV_PLAYER_MAX_ITEMS; i++, c++) {
		if(c == INV_TD_MAX_ITEMS) {
			c = 0, 
			tab_list++;	
		}
		if(item_id == i) {
			itemtd_id = c;
			break;
		}
	}
	return 1;
}

static CheckBannerOnTDPlayerInventory(item_id, &itemtd_id, &tab_list)
{
	for(new i = 0, c = 0; i < INV_PLAYER_MAX_BANNERS; i++, c++) {
		if(c == INV_TD_MAX_BANNERS) {
			c = 0, 
			tab_list++;	
		}
		if(item_id == i) {
			itemtd_id = c;
			break;
		}
	}
	return 1;
}

static UpdatePlayerTDInventory(playerid, type, tab_list, cell_id, td_id)
{
	if(!Interface_IsOpen(playerid, Interface:Inventory))
		return 1;
	
	if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == type) {
		if(inv_PlayerTDInfo[playerid][INV_ActiveTab] == tab_list)
			UpdateTDCellInv(playerid, cell_id, td_id);
	}
	return 1;
}

static UsePlayerItem(playerid, item_id)
{
	switch(Inv_CheckItemDestination(pInfo[playerid][pInvItem][item_id])) {
		case INV_PLAYER_DEST_SKINS: { // Скины
			new
				using_item = inv_PlayerItemInfo[playerid][IN_Skin];

			if(using_item == pInfo[playerid][pInvItem][item_id])
				return 1;

			if(!Inv_IsItemForPlayer(playerid, pInfo[playerid][pInvItem][item_id]))
				return 1;
			
			if(pInfo[playerid][pInvItemCount][item_id] > 1) {
				if(using_item != inv_PlayerItemInfo[playerid][IN_StandSkin]) {
					if(!Inv_CheckPlayerFullItem(playerid, using_item, 1)) {
						SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
						return 1;
					}
					Inv_SetPlayerItem(playerid, using_item, 1);
				}
				inv_PlayerItemInfo[playerid][IN_Skin] = pInfo[playerid][pInvItem][item_id];

				using_item = pInfo[playerid][pInvItem][item_id];
				pInfo[playerid][pInvItemCount][item_id]--;
			}
			else {
				new
					item = pInfo[playerid][pInvItem][item_id];

				inv_PlayerItemInfo[playerid][IN_Skin] = item;

				if(using_item != inv_PlayerItemInfo[playerid][IN_StandSkin]) 
					pInfo[playerid][pInvItem][item_id] = using_item;
				
				if(using_item == inv_PlayerItemInfo[playerid][IN_StandSkin]) {
					pInfo[playerid][pInvItem][item_id] = 0;
					pInfo[playerid][pInvItemCount][item_id] = 0;
				}
				using_item = item;
			}
			new
				itemtd_id, 
				tab_list;

			CheckItemOnTDPlayerInventory(item_id, itemtd_id, tab_list);
			UpdatePlayerTDInventory(playerid, 1, tab_list, item_id, itemtd_id);
			
			PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][6], inv_ItemInfo[using_item][IT_Model]);
			PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][6], inv_ItemInfo[using_item][IT_PosX], inv_ItemInfo[using_item][IT_PosY], inv_ItemInfo[using_item][IT_PosZ], 1.000000);
			PlayerTextDrawShow(playerid, TD_InvBase[playerid][6]);

			PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][17], inv_ItemInfo[using_item][IT_Model]);
			PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][17], inv_ItemInfo[using_item][IT_PosX], inv_ItemInfo[using_item][IT_PosY], inv_ItemInfo[using_item][IT_PosZ], 1.000000);
			PlayerTextDrawShow(playerid, TD_InvBase[playerid][17]);

			static
				str[11 - 2 + 1 + 3];

			str[0] = EOS;

			f(str, "Скин_ID:_%i", inv_ItemInfo[using_item][IT_Model]);
			PlayerTextDrawSetString(playerid, TD_InvBase[playerid][18], str);

			HideSelectedCell(playerid);
			Inv_SavePlayer(playerid);
		}
		case INV_PLAYER_DEST_CASES: { // Кейсы
			if(pInfo[playerid][pInvItemCount][item_id] < 1) {
				StartOpenPlayerCase(playerid, pInfo[playerid][pInvItem][item_id], inv_PlayerTDInfo[playerid][INV_ActiveCellItem]);
				
				Interface_Close(playerid, Interface:Inventory);
				SetPlayerCarabSpectating(playerid, true);
			}
		}
		case INV_PLAYER_DEST_HEAD: { // Голова
			new
				using_item = inv_PlayerItemInfo[playerid][IN_Head];

			if(using_item == pInfo[playerid][pInvItem][item_id]) 
				return 1;

			if(!Inv_IsItemForPlayer(playerid, pInfo[playerid][pInvItem][item_id])) 
				return 1;
			
			if(pInfo[playerid][pInvItemCount][item_id] > 1) {
				if(!Inv_CheckPlayerFullItem(playerid, using_item, 1)) {
					SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
					return 1;
				}
				inv_PlayerItemInfo[playerid][IN_Head] = pInfo[playerid][pInvItem][item_id];

				Inv_SetPlayerItem(playerid, using_item, 1);
				using_item = pInfo[playerid][pInvItem][item_id];
				pInfo[playerid][pInvItemCount][item_id]--;
			}
			else {
				new
					item = pInfo[playerid][pInvItem][item_id];

				inv_PlayerItemInfo[playerid][IN_Head] = item;

				pInfo[playerid][pInvItem][item_id] = using_item;
				if(using_item == 0) 
					pInfo[playerid][pInvItemCount][item_id] = 0;

				using_item = item;
			}
			new
				itemtd_id, 
				tab_list;

			CheckItemOnTDPlayerInventory(item_id, itemtd_id, tab_list);
			UpdatePlayerTDInventory(playerid, 1, tab_list, item_id, itemtd_id);
			
			PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][7], inv_ItemInfo[using_item][IT_Model]);
			PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][7], inv_ItemInfo[using_item][IT_PosX], inv_ItemInfo[using_item][IT_PosY], inv_ItemInfo[using_item][IT_PosZ], 1.000000);
			PlayerTextDrawShow(playerid, TD_InvBase[playerid][7]);

			HideSelectedCell(playerid);
			Inv_SavePlayer(playerid);
		}
		case INV_PLAYER_DEST_HEADPHONES: { // Наушники
			new
				using_item = inv_PlayerItemInfo[playerid][IN_Headphones];

			if(using_item == pInfo[playerid][pInvItem][item_id])
				return 1;

			if(!Inv_IsItemForPlayer(playerid, pInfo[playerid][pInvItem][item_id]))
				return 1;
			
			if(pInfo[playerid][pInvItemCount][item_id] > 1) {
				if(!Inv_CheckPlayerFullItem(playerid, using_item, 1)) {
					SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
					return 1;
				}
				inv_PlayerItemInfo[playerid][IN_Headphones] = pInfo[playerid][pInvItem][item_id];
				
				Inv_SetPlayerItem(playerid, using_item, 1);
				using_item = pInfo[playerid][pInvItem][item_id];
				pInfo[playerid][pInvItemCount][item_id]--;
			}
			else {
				new
					item = pInfo[playerid][pInvItem][item_id];

				inv_PlayerItemInfo[playerid][IN_Headphones] = item;

				pInfo[playerid][pInvItem][item_id] = using_item;
				if(using_item == 0) 
					pInfo[playerid][pInvItemCount][item_id] = 0;

				using_item = item;
			}
			new
				itemtd_id, 
				tab_list;

			CheckItemOnTDPlayerInventory(item_id, itemtd_id, tab_list);
			UpdatePlayerTDInventory(playerid, 1, tab_list, item_id, itemtd_id);
			
			PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][9], inv_ItemInfo[using_item][IT_Model]);
			PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][9], inv_ItemInfo[using_item][IT_PosX], inv_ItemInfo[using_item][IT_PosY], inv_ItemInfo[using_item][IT_PosZ], 1.000000);
			PlayerTextDrawShow(playerid, TD_InvBase[playerid][9]);

			HideSelectedCell(playerid);
			Inv_SavePlayer(playerid);
		}
		case INV_PLAYER_DEST_GLASSES: { // Очки
			new
				using_item = inv_PlayerItemInfo[playerid][IN_Glasses];

			if(using_item == pInfo[playerid][pInvItem][item_id]) 
				return 1;

			if(!Inv_IsItemForPlayer(playerid, pInfo[playerid][pInvItem][item_id])) 
				return 1;
			
			if(pInfo[playerid][pInvItemCount][item_id] > 1) {
				if(!Inv_CheckPlayerFullItem(playerid, using_item, 1)) {
					SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
					return 1;
				}
				inv_PlayerItemInfo[playerid][IN_Glasses] = pInfo[playerid][pInvItem][item_id];

				Inv_SetPlayerItem(playerid, using_item, 1);
				using_item = pInfo[playerid][pInvItem][item_id];
				pInfo[playerid][pInvItemCount][item_id]--;
			}
			else {
				new
					item = pInfo[playerid][pInvItem][item_id];

				inv_PlayerItemInfo[playerid][IN_Glasses] = item;

				pInfo[playerid][pInvItem][item_id] = using_item;
				if(using_item == 0) 
					pInfo[playerid][pInvItemCount][item_id] = 0;

				using_item = item;
			}
			new
				itemtd_id, 
				tab_list;

			CheckItemOnTDPlayerInventory(item_id, itemtd_id, tab_list);
			UpdatePlayerTDInventory(playerid, 1, tab_list, item_id, itemtd_id);
			
			PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][11], inv_ItemInfo[using_item][IT_Model]);
			PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][11], inv_ItemInfo[using_item][IT_PosX], inv_ItemInfo[using_item][IT_PosY], inv_ItemInfo[using_item][IT_PosZ], 1.000000);
			PlayerTextDrawShow(playerid, TD_InvBase[playerid][11]);

			HideSelectedCell(playerid);
			Inv_SavePlayer(playerid);
		}
		case INV_PLAYER_DEST_MASKS: { // Маска
			new
				using_item = inv_PlayerItemInfo[playerid][IN_Mask];

			if(using_item == pInfo[playerid][pInvItem][item_id]) 
				return 1;

			if(!Inv_IsItemForPlayer(playerid, pInfo[playerid][pInvItem][item_id])) 
				return 1;
			
			if(pInfo[playerid][pInvItemCount][item_id] > 1) {
				if(!Inv_CheckPlayerFullItem(playerid, using_item, 1)) {
					SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
					return 1;
				}
				inv_PlayerItemInfo[playerid][IN_Mask] = pInfo[playerid][pInvItem][item_id];
				
				Inv_SetPlayerItem(playerid, using_item, 1);
				using_item = pInfo[playerid][pInvItem][item_id];
				pInfo[playerid][pInvItemCount][item_id]--;
			}
			else {
				new
					item = pInfo[playerid][pInvItem][item_id];

				inv_PlayerItemInfo[playerid][IN_Mask] = item;

				pInfo[playerid][pInvItem][item_id] = using_item;
				if(using_item == 0) 
					pInfo[playerid][pInvItemCount][item_id] = 0;

				using_item = item;
			}
			new
				itemtd_id, 
				tab_list;

			CheckItemOnTDPlayerInventory(item_id, itemtd_id, tab_list);
			UpdatePlayerTDInventory(playerid, 1, tab_list, item_id, itemtd_id);
			
			PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][13], inv_ItemInfo[using_item][IT_Model]);
			PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][13], inv_ItemInfo[using_item][IT_PosX], inv_ItemInfo[using_item][IT_PosY], inv_ItemInfo[using_item][IT_PosZ], 1.000000);
			PlayerTextDrawShow(playerid, TD_InvBase[playerid][13]);

			HideSelectedCell(playerid);
			Inv_SavePlayer(playerid);
		}
		case INV_PLAYER_DEST_WATCH: { // Часы
			new
				using_item = inv_PlayerItemInfo[playerid][IN_Watch];

			if(using_item == pInfo[playerid][pInvItem][item_id]) 
				return 1;

			if(!Inv_IsItemForPlayer(playerid, pInfo[playerid][pInvItem][item_id])) 
				return 1;
			
			if(pInfo[playerid][pInvItemCount][item_id] > 1) {
				if(!Inv_CheckPlayerFullItem(playerid, using_item, 1)) {
					SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
					return 1;
				}
				inv_PlayerItemInfo[playerid][IN_Watch] = pInfo[playerid][pInvItem][item_id];

				Inv_SetPlayerItem(playerid, using_item, 1);
				using_item = pInfo[playerid][pInvItem][item_id];
				pInfo[playerid][pInvItemCount][item_id]--;
			}
			else {
				new
					item = pInfo[playerid][pInvItem][item_id];

				inv_PlayerItemInfo[playerid][IN_Watch] = item;

				pInfo[playerid][pInvItem][item_id] = using_item;
				if(using_item == 0) 
					pInfo[playerid][pInvItemCount][item_id] = 0;

				using_item = item;
			}
			new
				itemtd_id, 
				tab_list;

			CheckItemOnTDPlayerInventory(item_id, itemtd_id, tab_list);
			UpdatePlayerTDInventory(playerid, 1, tab_list, item_id, itemtd_id);
			
			PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][15], inv_ItemInfo[using_item][IT_Model]);
			PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][15], inv_ItemInfo[using_item][IT_PosX], inv_ItemInfo[using_item][IT_PosY], inv_ItemInfo[using_item][IT_PosZ], 1.000000);
			PlayerTextDrawShow(playerid, TD_InvBase[playerid][15]);

			HideSelectedCell(playerid);
			Inv_SavePlayer(playerid);
		}
	}
	ClosePlayerDialog(playerid);
	return 1;
}

static UsePlayerBanner(playerid, item_id)
{
	new
		using_item = inv_PlayerItemInfo[playerid][IN_Banner];

	if(using_item == pInfo[playerid][pInvBanner][item_id])
		return 1;
	
	if(pInfo[playerid][pInvBannerCount][item_id] > 1) {
		if(using_item != INITIAL_PLAYER_BANNER) {
			if(!Inv_CheckPlayerFullItem(playerid, using_item, 1)) {
				SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
				return 1;
			}
			Inv_SetPlayerBanner(playerid, using_item, 1);
		}
		inv_PlayerItemInfo[playerid][IN_Banner] = pInfo[playerid][pInvBanner][item_id];

		using_item = pInfo[playerid][pInvBanner][item_id];
		pInfo[playerid][pInvBannerCount][item_id]--;
	}
	else {
		new
			item = pInfo[playerid][pInvBanner][item_id];

		inv_PlayerItemInfo[playerid][IN_Banner] = item;

		if(using_item != INITIAL_PLAYER_BANNER) 
			pInfo[playerid][pInvBanner][item_id] = using_item;
		
		if(using_item == INITIAL_PLAYER_BANNER) {
			pInfo[playerid][pInvBanner][item_id] = 0;
			pInfo[playerid][pInvBannerCount][item_id] = 0;
		}
		using_item = item;
	}
	new
		itemtd_id,
		tab_list;

	CheckBannerOnTDPlayerInventory(item_id, itemtd_id, tab_list);
	UpdatePlayerTDInventory(playerid, 2, tab_list, item_id, itemtd_id);
	
	PlayerTextDrawSetString(playerid, TD_InvBase[playerid][21], Inv_GetBannerModel(using_item));
	PlayerTextDrawShow(playerid, TD_InvBase[playerid][21]);

	HideSelectedCell(playerid);
	Inv_SavePlayer(playerid);

	ClosePlayerDialog(playerid);
	return 1;
}

static HideSelectedCell(playerid)
{
	inv_PlayerTDInfo[playerid][INV_ChooseTab] =
	inv_PlayerTDInfo[playerid][INV_ActiveCell] =
	inv_PlayerTDInfo[playerid][INV_ActiveCellCount] = 0;
	inv_PlayerTDInfo[playerid][INV_ActiveCellItem] = -1;

	if(inv_PlayerTDInfo[playerid][INV_ActiveChooseTab] > -1) {
		switch(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems]) {
			// Предметы
			case 1: {
				PlayerTextDrawBackgroundColour(playerid, TD_InvCellItem[playerid][inv_PlayerTDInfo[playerid][INV_ActiveChooseTab]], 0x919191BB);
				PlayerTextDrawShow(playerid, TD_InvCellItem[playerid][inv_PlayerTDInfo[playerid][INV_ActiveChooseTab]]);
			}
			// Баннеры
			case 2: {
				PlayerTextDrawBackgroundColour(playerid, TD_InvCellBanner[playerid][inv_PlayerTDInfo[playerid][INV_ActiveChooseTab]], 0x919191BB);
				PlayerTextDrawShow(playerid, TD_InvCellBanner[playerid][inv_PlayerTDInfo[playerid][INV_ActiveChooseTab]]);
			}
		}
		n_for(t, sizeof(TD_InvActionCell[]))
			DestroyPlayerTD(playerid, TD_InvActionCell[playerid][t]);
	}
	inv_PlayerTDInfo[playerid][INV_ActiveChooseTab] = -1;
	inv_PlayerTDInfo[playerid][INV_ActiveTD] = -1;
	return 1;
}

static ShowTDActionCell(playerid, idcell)
{
	new
		Float:initialcoords[2] = {262.0, 188.0};

	if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 1) {
		for(new i = 0, s = 1; i < INV_TD_MAX_ITEMS; i++, s++) {
			if(i == idcell)
				break;

			if(s == INV_TD_MAX_COLUMN_ITEMS) {
				s = 0;
				initialcoords[0] = 262.0;
				initialcoords[1] += 32.0;
			}
			else
				initialcoords[0] += 36.0;
		}
	}
	else if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 2) {
		for(new i = 0, s = 1; i < INV_TD_MAX_BANNERS; i++, s++) {
			if(i == idcell)
				break;

			if(s == INV_TD_MAX_COLUMN_BANNERS) {
				s = 0;
				initialcoords[0] = 262.0;
				initialcoords[1] += 32.0;
			}
			else
				initialcoords[0] += 36.0;
		}
	}

	TD_InvActionCell[playerid][0] = CreatePlayerTextDraw(playerid, initialcoords[0], initialcoords[1], "_");
	PlayerTextDrawFont(playerid, TD_InvActionCell[playerid][0], TEXT_DRAW_FONT_PREVIEW);
	PlayerTextDrawAlignment(playerid, TD_InvActionCell[playerid][0], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_InvActionCell[playerid][0], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_InvActionCell[playerid][0], 0x212121FF);
	PlayerTextDrawSetShadow(playerid, TD_InvActionCell[playerid][0], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvActionCell[playerid][0], false);
	PlayerTextDrawTextSize(playerid, TD_InvActionCell[playerid][0], 35.000000, 41.000000);
	PlayerTextDrawSetPreviewModel(playerid, TD_InvActionCell[playerid][0], 0);
	PlayerTextDrawSetPreviewRot(playerid, TD_InvActionCell[playerid][0], 0.000000, 0.000000, 0.000000, 1000.000000);
	
	TD_InvActionCell[playerid][1] = CreatePlayerTextDraw(playerid, initialcoords[0] + 18.0, initialcoords[1] - 1.0, "Использ.");
	PlayerTextDrawLetterSize(playerid, TD_InvActionCell[playerid][1], 0.130664, 1.056590);
	PlayerTextDrawTextSize(playerid, TD_InvActionCell[playerid][1], 7.000000, 30.000000);
	PlayerTextDrawAlignment(playerid, TD_InvActionCell[playerid][1], TEXT_DRAW_ALIGN_CENTER);
	PlayerTextDrawFont(playerid, TD_InvActionCell[playerid][1], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawColour(playerid, TD_InvActionCell[playerid][1], 0xFFFFFFFF);
	PlayerTextDrawSetShadow(playerid, TD_InvActionCell[playerid][1], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvActionCell[playerid][1], true);
	PlayerTextDrawSetSelectable(playerid, TD_InvActionCell[playerid][1], true);

	TD_InvActionCell[playerid][2] = CreatePlayerTextDraw(playerid, initialcoords[0] + 18.0, initialcoords[1] - 1.0 + 10.0, "Передать");
	PlayerTextDrawLetterSize(playerid, TD_InvActionCell[playerid][2], 0.130664, 1.056590);
	PlayerTextDrawTextSize(playerid, TD_InvActionCell[playerid][2], 7.000000, 30.000000);
	PlayerTextDrawAlignment(playerid, TD_InvActionCell[playerid][2], TEXT_DRAW_ALIGN_CENTER);
	PlayerTextDrawFont(playerid, TD_InvActionCell[playerid][2], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawColour(playerid, TD_InvActionCell[playerid][2], 0xFFFFFFFF);
	PlayerTextDrawSetShadow(playerid, TD_InvActionCell[playerid][2], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvActionCell[playerid][2], true);
	PlayerTextDrawSetSelectable(playerid, TD_InvActionCell[playerid][2], true);

	TD_InvActionCell[playerid][3] = CreatePlayerTextDraw(playerid, initialcoords[0] + 18.0, initialcoords[1] - 1.0 + 20.0, "Инфо.");
	PlayerTextDrawLetterSize(playerid, TD_InvActionCell[playerid][3], 0.130664, 1.056590);
	PlayerTextDrawTextSize(playerid, TD_InvActionCell[playerid][3], 7.000000, 30.000000);
	PlayerTextDrawAlignment(playerid, TD_InvActionCell[playerid][3], TEXT_DRAW_ALIGN_CENTER);
	PlayerTextDrawFont(playerid, TD_InvActionCell[playerid][3], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawColour(playerid, TD_InvActionCell[playerid][3], 0xFFFFFFFF);
	PlayerTextDrawSetShadow(playerid, TD_InvActionCell[playerid][3], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvActionCell[playerid][3], true);
	PlayerTextDrawSetSelectable(playerid, TD_InvActionCell[playerid][3], true);

	TD_InvActionCell[playerid][4] = CreatePlayerTextDraw(playerid, initialcoords[0] + 18.0, initialcoords[1] - 1.0 + 30.0, "Выкинуть");
	PlayerTextDrawLetterSize(playerid, TD_InvActionCell[playerid][4], 0.130664, 1.056590);
	PlayerTextDrawTextSize(playerid, TD_InvActionCell[playerid][4], 7.000000, 30.000000);
	PlayerTextDrawAlignment(playerid, TD_InvActionCell[playerid][4], TEXT_DRAW_ALIGN_CENTER);
	PlayerTextDrawFont(playerid, TD_InvActionCell[playerid][4], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawColour(playerid, TD_InvActionCell[playerid][4], 0xFFFFFFFF);
	PlayerTextDrawSetShadow(playerid, TD_InvActionCell[playerid][4], 0);
	PlayerTextDrawSetProportional(playerid, TD_InvActionCell[playerid][4], true);
	PlayerTextDrawSetSelectable(playerid, TD_InvActionCell[playerid][4], true);
	return 1;
}

static UpdatePlayerTDSlots(playerid, id_newtab, idtd_newtab, idtd_oldtab)
{
	if(inv_PlayerTDInfo[playerid][INV_ActiveTab] != id_newtab) {
		if(inv_PlayerTDInfo[playerid][INV_ActiveChooseTab]> -1) {
			PlayerTextDrawBackgroundColour(playerid, TD_InvCellItem[playerid][inv_PlayerTDInfo[playerid][INV_ActiveChooseTab]], 0x919191BB), PlayerTextDrawShow(playerid, TD_InvCellItem[playerid][inv_PlayerTDInfo[playerid][INV_ActiveChooseTab]]);
			
			n_for(t, sizeof(TD_InvActionCell[]))
				DestroyPlayerTD(playerid, TD_InvActionCell[playerid][t]);

			inv_PlayerTDInfo[playerid][INV_ActiveChooseTab] = -1;
		}

		PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][idtd_newtab], 0x007a25BB), PlayerTextDrawShow(playerid, TD_InvBase[playerid][idtd_newtab]);
		PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][idtd_oldtab], 0x666666BB), PlayerTextDrawShow(playerid, TD_InvBase[playerid][idtd_oldtab]);

		inv_PlayerTDInfo[playerid][INV_ActiveTab] = id_newtab;
		UpdateTDItemsInv(playerid);
	}
	return 1;
}

static UpdateTDCellInv(playerid, idcell1, td1, idcell2 = -1, td2 = -1)
{
	if(idcell1 > -1 && td1 > -1) {
		if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 1)
			ShowTDItemInv(playerid, idcell1, td1);
		else if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 2)
			ShowTDBannerInv(playerid, idcell1, td1);
	}
	if(idcell2 > -1 && td2 > -1) {
		if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 1)
			ShowTDItemInv(playerid, idcell2, td2);
		else if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 2)
			ShowTDBannerInv(playerid, idcell2, td2);	
	}
	return 1;
}

static ShowTDCellInv(playerid)
{
	inv_PlayerTDInfo[playerid][INV_ActiveChooseTab] = -1;

	new
		Float:initialcoords[2] = {262.0, 173.0};

	for(new i = 0, s = 1; i < INV_TD_MAX_ITEMS; i++, s++) {
		TD_InvCellItem[playerid][i] = CreatePlayerTextDraw(playerid, initialcoords[0], initialcoords[1], "_");
		PlayerTextDrawFont(playerid, TD_InvCellItem[playerid][i], TEXT_DRAW_FONT_PREVIEW);
		PlayerTextDrawAlignment(playerid, TD_InvCellItem[playerid][i], TEXT_DRAW_ALIGN_LEFT);
		PlayerTextDrawColour(playerid, TD_InvCellItem[playerid][i], 0xFFFFFFFF);
		PlayerTextDrawBackgroundColour(playerid, TD_InvCellItem[playerid][i], 0x919191BB);
		PlayerTextDrawSetProportional(playerid, TD_InvCellItem[playerid][i], false);
		PlayerTextDrawSetShadow(playerid, TD_InvCellItem[playerid][i], 0);
		PlayerTextDrawTextSize(playerid, TD_InvCellItem[playerid][i], 35.000000, 31.000000);
		PlayerTextDrawSetPreviewModel(playerid, TD_InvCellItem[playerid][i], 0);
		PlayerTextDrawSetPreviewRot(playerid, TD_InvCellItem[playerid][i], 0.000000, 0.000000, 0.000000, 1000.000000);
		PlayerTextDrawSetSelectable(playerid, TD_InvCellItem[playerid][i], true);

		TD_InvCellItemCount[playerid][i] = CreatePlayerTextDraw(playerid, initialcoords[0] + 34.0, initialcoords[1] - 1.0, "_");
		PlayerTextDrawLetterSize(playerid, TD_InvCellItemCount[playerid][i], 0.177999, 0.998518);
		PlayerTextDrawAlignment(playerid, TD_InvCellItemCount[playerid][i], TEXT_DRAW_ALIGN_RIGHT);
		PlayerTextDrawColour(playerid, TD_InvCellItemCount[playerid][i], 1499027967);
		PlayerTextDrawBackgroundColour(playerid, TD_InvCellItemCount[playerid][i], 0xFFFFFFFF);
		PlayerTextDrawFont(playerid, TD_InvCellItemCount[playerid][i], TEXT_DRAW_FONT_BANK_GOTHIC);
		PlayerTextDrawSetShadow(playerid, TD_InvCellItemCount[playerid][i], 0);
		PlayerTextDrawSetProportional(playerid, TD_InvCellItemCount[playerid][i], true);

		if(s == INV_TD_MAX_COLUMN_ITEMS) {
			s = 0;
			initialcoords[0] = 262.0;
			initialcoords[1] += 32.0;
		}
		else 
			initialcoords[0] += 36.0;
	}
	return 1;
}

static UpdateTDItemsInv(playerid)
{
	new
		c = 0;

	if(inv_PlayerTDInfo[playerid][INV_ActiveTab] > 0)
		c = INV_TD_MAX_ITEMS * inv_PlayerTDInfo[playerid][INV_ActiveTab];

	n_for(i, INV_TD_MAX_ITEMS) {
		ShowTDItemInv(playerid, c, i);
		c++;
	}
	return 1;
}

static ShowTDItemInv(playerid, item_id, td_id)
{
	static
		str[10 - 2 + 1];

	str[0] = EOS;

	if(pInfo[playerid][pInvItem][item_id] > 0) {
		switch(Inv_CheckItemDestination(pInfo[playerid][pInvItem][item_id])) {
			case INV_PLAYER_DEST_CASES: {
				f(str, "%i мин", pInfo[playerid][pInvItemCount][item_id]);
				PlayerTextDrawSetString(playerid, TD_InvCellItemCount[playerid][td_id], str);

			}
			default: {
				f(str, "%i", pInfo[playerid][pInvItemCount][item_id]);
				PlayerTextDrawSetString(playerid, TD_InvCellItemCount[playerid][td_id], str);
			}
		}

		PlayerTextDrawSetPreviewModel(playerid, TD_InvCellItem[playerid][td_id], inv_ItemInfo[pInfo[playerid][pInvItem][item_id]][IT_Model]);
		PlayerTextDrawSetPreviewRot(playerid, TD_InvCellItem[playerid][td_id], inv_ItemInfo[pInfo[playerid][pInvItem][item_id]][IT_PosX], inv_ItemInfo[pInfo[playerid][pInvItem][item_id]][IT_PosY], inv_ItemInfo[pInfo[playerid][pInvItem][item_id]][IT_PosZ], 1.000000);
		PlayerTextDrawShow(playerid, TD_InvCellItem[playerid][td_id]);
	}
	else {
		PlayerTextDrawSetString(playerid, TD_InvCellItemCount[playerid][td_id], "_");
		PlayerTextDrawSetPreviewModel(playerid, TD_InvCellItem[playerid][td_id], 0);
		PlayerTextDrawSetPreviewRot(playerid, TD_InvCellItem[playerid][td_id], 0.000000, 0.000000, 0.000000, 1000.000000);
		PlayerTextDrawShow(playerid, TD_InvCellItem[playerid][td_id]);
	}
	return 1;
}

static ShowTDCellBannersInv(playerid)
{
	inv_PlayerTDInfo[playerid][INV_ActiveChooseTab] = -1;

	new
		Float:initialcoords[2] = {262.0, 173.0};

	for(new i = 0, s = 1; i < INV_TD_MAX_BANNERS; i++, s++) {
		TD_InvCellBanner[playerid][i] = CreatePlayerTextDraw(playerid, initialcoords[0], initialcoords[1], "_");
		PlayerTextDrawFont(playerid, TD_InvCellBanner[playerid][i], TEXT_DRAW_FONT_PREVIEW);
		PlayerTextDrawAlignment(playerid, TD_InvCellBanner[playerid][i], TEXT_DRAW_ALIGN_LEFT);
		PlayerTextDrawColour(playerid, TD_InvCellBanner[playerid][i], 0xFFFFFFFF);
		PlayerTextDrawBackgroundColour(playerid, TD_InvCellBanner[playerid][i], 0x919191BB);
		PlayerTextDrawSetProportional(playerid, TD_InvCellBanner[playerid][i], false);
		PlayerTextDrawSetShadow(playerid, TD_InvCellBanner[playerid][i], 0);
		PlayerTextDrawTextSize(playerid, TD_InvCellBanner[playerid][i], 35.000000, 31.000000);
		PlayerTextDrawSetPreviewModel(playerid, TD_InvCellBanner[playerid][i], 0);
		PlayerTextDrawSetPreviewRot(playerid, TD_InvCellBanner[playerid][i], 0.000000, 0.000000, 0.000000, 1000.000000);
		PlayerTextDrawSetSelectable(playerid, TD_InvCellBanner[playerid][i], true);

		TD_InvCellBannerSprite[playerid][i] = CreatePlayerTextDraw(playerid, initialcoords[0] + 2.0, initialcoords[1] + 2.0, "_");
		PlayerTextDrawTextSize(playerid, TD_InvCellBannerSprite[playerid][i], 31.0000, 27.0000);
		PlayerTextDrawAlignment(playerid, TD_InvCellBannerSprite[playerid][i], TEXT_DRAW_ALIGN_LEFT);
		PlayerTextDrawColour(playerid, TD_InvCellBannerSprite[playerid][i], 0xFFFFFFFF);
		PlayerTextDrawBackgroundColour(playerid, TD_InvCellBannerSprite[playerid][i], 0xFFFFFFFF);
		PlayerTextDrawSetShadow(playerid, TD_InvCellBannerSprite[playerid][i], 0);
		PlayerTextDrawSetProportional(playerid, TD_InvCellBannerSprite[playerid][i], false);
		PlayerTextDrawFont(playerid, TD_InvCellBannerSprite[playerid][i], TEXT_DRAW_FONT_SPRITE);

		TD_InvCellBannerCount[playerid][i] = CreatePlayerTextDraw(playerid, initialcoords[0] + 34.0, initialcoords[1] - 1.0, "_");
		PlayerTextDrawLetterSize(playerid, TD_InvCellBannerCount[playerid][i], 0.177999, 0.998518);
		PlayerTextDrawAlignment(playerid, TD_InvCellBannerCount[playerid][i], TEXT_DRAW_ALIGN_RIGHT);
		PlayerTextDrawColour(playerid, TD_InvCellBannerCount[playerid][i], 1499027967);
		PlayerTextDrawBackgroundColour(playerid, TD_InvCellBannerCount[playerid][i], 0xFFFFFFFF);
		PlayerTextDrawFont(playerid, TD_InvCellBannerCount[playerid][i], TEXT_DRAW_FONT_BANK_GOTHIC);
		PlayerTextDrawSetShadow(playerid, TD_InvCellBannerCount[playerid][i], 0);
		PlayerTextDrawSetProportional(playerid, TD_InvCellBannerCount[playerid][i], true);

		if(s == INV_TD_MAX_COLUMN_BANNERS) {
			s = 0;
			initialcoords[0] = 262.0;
			initialcoords[1] += 32.0;
		}
		else 
			initialcoords[0] += 36.0;
	}
	return 1;
}

static UpdateTDBannersInv(playerid) 
{
	new
		c = 0;

	if(inv_PlayerTDInfo[playerid][INV_ActiveTab] > 0)
		c = INV_TD_MAX_BANNERS * inv_PlayerTDInfo[playerid][INV_ActiveTab];

	n_for(i, INV_TD_MAX_BANNERS) {
		ShowTDBannerInv(playerid, c, i);
		c++;
	}
	return 1;
}

static ShowTDBannerInv(playerid, item_id, td_id)
{
	static
		str[3 - 2 + 1];

	str[0] = EOS;

	if(pInfo[playerid][pInvBanner][item_id] > 0) {
		f(str, "%i", pInfo[playerid][pInvBannerCount][item_id]);
		PlayerTextDrawSetString(playerid, TD_InvCellBannerCount[playerid][td_id], str);
		PlayerTextDrawSetString(playerid, TD_InvCellBannerSprite[playerid][td_id], Inv_GetBannerModel(pInfo[playerid][pInvBanner][item_id]));
	}
	else {
		PlayerTextDrawSetString(playerid, TD_InvCellBannerSprite[playerid][td_id], "_");
		PlayerTextDrawSetString(playerid, TD_InvCellBannerCount[playerid][td_id], "_");
	}
	return 1;
}

static SetRewardItemPlayerCase(playerid, case_id)
{
	switch(case_id) {
		case 312: {
			inv_PlayerCase[playerid][PC_Exp] = random_ex(300, 1000, 50), SetPlayerExp(playerid, inv_PlayerCase[playerid][PC_Exp]);
			inv_PlayerCase[playerid][PC_Credits] = random_ex(500, 2000, 100), SetPlayerCredit(playerid, inv_PlayerCase[playerid][PC_Credits]);
			inv_PlayerCase[playerid][PC_GoldCoins] = random_ex(1, 10, 1), SetPlayerGoldCoins(playerid, inv_PlayerCase[playerid][PC_GoldCoins]);
			
			new
				a_items;

			if(GetPlayerSex(playerid) == 1) {
				n_for(i, CASE_ITEMS_MALE) {
					if(inv_MaleRewardItemsCase[0][i] > 0) 
						a_items++;
				}
				n_for(i, random_ex(3, 4, 1)) {
					inv_PlayerCase[playerid][PC_Item][i] = inv_MaleRewardItemsCase[0][random(a_items)];
					Inv_SetPlayerItem(playerid, inv_PlayerCase[playerid][PC_Item][i], 1);
				}
			}
			else if(GetPlayerSex(playerid) == 2) {
				n_for(i, CASE_ITEMS_FEMALE) {
					if(inv_FemaleRewardItemsCase[0][i] > 0) 
						a_items++;
				}
				n_for(i, random_ex(3, 4, 1)) {
					inv_PlayerCase[playerid][PC_Item][i] = inv_FemaleRewardItemsCase[0][random(a_items)];
					Inv_SetPlayerItem(playerid, inv_PlayerCase[playerid][PC_Item][i], 1);
				}
			}	
		}
		case 313: {
			inv_PlayerCase[playerid][PC_Exp] = random_ex(1000, 3000, 100), SetPlayerExp(playerid, inv_PlayerCase[playerid][PC_Exp]);
			inv_PlayerCase[playerid][PC_Credits] = random_ex(1500, 4000, 100), SetPlayerCredit(playerid, inv_PlayerCase[playerid][PC_Credits]);
			inv_PlayerCase[playerid][PC_GoldCoins] = random_ex(10, 20, 5), SetPlayerGoldCoins(playerid, inv_PlayerCase[playerid][PC_GoldCoins]);
			
			new
				a_items;

			if(GetPlayerSex(playerid) == 1) {
				n_for(i, CASE_ITEMS_MALE) {
					if(inv_MaleRewardItemsCase[1][i] > 0) 
						a_items++;
				}
				n_for(i, random_ex(3, 4, 1)) {
					inv_PlayerCase[playerid][PC_Item][i] = inv_MaleRewardItemsCase[1][random(a_items)];
					Inv_SetPlayerItem(playerid, inv_PlayerCase[playerid][PC_Item][i], 1);
				}
			}
			else if(GetPlayerSex(playerid) == 2) {
				n_for(i, CASE_ITEMS_FEMALE) {
					if(inv_FemaleRewardItemsCase[1][i] > 0) 
						a_items++;
				}
				n_for(i, random_ex(3, 4, 1)) {
					inv_PlayerCase[playerid][PC_Item][i] = inv_FemaleRewardItemsCase[1][random(a_items)];
					Inv_SetPlayerItem(playerid, inv_PlayerCase[playerid][PC_Item][i], 1);
				}
			}
		}
		case 314: {
			inv_PlayerCase[playerid][PC_Exp] = random_ex(3000, 5000, 100), SetPlayerExp(playerid, inv_PlayerCase[playerid][PC_Exp]);
			inv_PlayerCase[playerid][PC_Credits] = random_ex(5000, 10000, 100), SetPlayerCredit(playerid, inv_PlayerCase[playerid][PC_Credits]);
			inv_PlayerCase[playerid][PC_GoldCoins] = random_ex(20, 30, 5), SetPlayerGoldCoins(playerid, inv_PlayerCase[playerid][PC_GoldCoins]);
			
			new
				a_items;
				
			if(GetPlayerSex(playerid) == 1) {
				n_for(i, CASE_ITEMS_MALE) {
					if(inv_MaleRewardItemsCase[2][i] > 0) 
						a_items++;
				}
				n_for(i, random_ex(4, 5, 1)) {
					inv_PlayerCase[playerid][PC_Item][i] = inv_MaleRewardItemsCase[2][random(a_items)];
					Inv_SetPlayerItem(playerid, inv_PlayerCase[playerid][PC_Item][i], 1);
				}
			}
			else if(GetPlayerSex(playerid) == 2) {
				n_for(i, CASE_ITEMS_FEMALE) {
					if(inv_FemaleRewardItemsCase[2][i] > 0) 
						a_items++;
				}
				n_for(i, random_ex(4, 5, 1)) {
					inv_PlayerCase[playerid][PC_Item][i] = inv_FemaleRewardItemsCase[2][random(a_items)];
					Inv_SetPlayerItem(playerid, inv_PlayerCase[playerid][PC_Item][i], 1);
				}
			}
		}
	}
	return 1;
}

static ShowTDRewardItemPlayerCase(playerid, type)
{
	switch(type) {
		case 0: { // TD's
			new
				str[60],
				exp, 
				credits, 
				goldcoins;

			for(new i = 0, t = 7, item = 0; i < CASE_MAX_REWARDS; i++, t++) {
				if(exp == 0 && inv_PlayerCase[playerid][PC_Exp] > 0) {
					f(str, "%i EXP", inv_PlayerCase[playerid][PC_Exp]);
					PlayerTextDrawColour(playerid, TD_OpeningCase[playerid][t], 0xc27b11FF);
					PlayerTextDrawSetString(playerid, TD_OpeningCase[playerid][t], str);

					exp++;
					str[0] = EOS;

					continue;
				}
				if(credits == 0 && inv_PlayerCase[playerid][PC_Credits] > 0) {
					f(str, "%i$", inv_PlayerCase[playerid][PC_Credits]);
					PlayerTextDrawColour(playerid, TD_OpeningCase[playerid][t], 0x35c211FF);
					PlayerTextDrawSetString(playerid, TD_OpeningCase[playerid][t], str);

					credits++;
					str[0] = EOS;

					continue;
				}
				if(goldcoins == 0 && inv_PlayerCase[playerid][PC_GoldCoins] > 0) {
					f(str, "%i GoldCoins", inv_PlayerCase[playerid][PC_GoldCoins]);
					PlayerTextDrawColour(playerid, TD_OpeningCase[playerid][t], 0xbcc211FF);
					PlayerTextDrawSetString(playerid, TD_OpeningCase[playerid][t], str);
					
					goldcoins++;
					str[0] = EOS;

					continue;
				}
				if(inv_PlayerCase[playerid][PC_Item][item] > 0) {
					f(str, "%s", inv_ItemInfo[inv_PlayerCase[playerid][PC_Item][item]][IT_Name]);
					PlayerTextDrawColour(playerid, TD_OpeningCase[playerid][t], 0x11bcc2FF);
					PlayerTextDrawSetString(playerid, TD_OpeningCase[playerid][t], str);
					
					item++;
					str[0] = EOS;
				}
			}
		}
		case 1: { // Диалоговое окно
			new
				str[300],
				exp, 
				credits, 
				goldcoins;

			for(new i = 0, item = 0; i < CASE_MAX_REWARDS; i++) {
				if(exp == 0 && inv_PlayerCase[playerid][PC_Exp] > 0) {
					f(str, "%s{c27b11}%i EXP\n", str, inv_PlayerCase[playerid][PC_Exp]);
					exp++;
					continue;
				}
				if(credits == 0 && inv_PlayerCase[playerid][PC_Credits] > 0) {
					f(str, "%s{35c211}%i$\n", str, inv_PlayerCase[playerid][PC_Credits]);
					credits++;
					continue;
				}
				if(goldcoins == 0 && inv_PlayerCase[playerid][PC_GoldCoins] > 0) {
					f(str, "%s{bcc211}%i GoldCoins\n", str, inv_PlayerCase[playerid][PC_GoldCoins]);
					goldcoins++;
					continue;
				}
				if(inv_PlayerCase[playerid][PC_Item][item] > 0) {
					f(str, "%s{11bcc2}%s\n", str, inv_ItemInfo[inv_PlayerCase[playerid][PC_Item][item]][IT_Name]);
					item++;
				}
			}
			new
				str2[INV_MAX_ITEM_NAME_LENGTH + 1];

			f(str2, "%s", inv_ItemInfo[GetPVarInt(playerid, "CaseType_PVar")][IT_Name]);
			Dialog_Message(playerid, str2, str, "Хорошо");
		}
	}
	return 1;
}

static ShowTDOpeningPlayerCase(playerid)
{
	TD_OpeningCase[playerid][0] = CreatePlayerTextDraw(playerid, 230.000000, 126.000000, "_"); // Основной задний фон
	PlayerTextDrawLetterSize(playerid, TD_OpeningCase[playerid][0], 0.000000, 24.866649);
	PlayerTextDrawTextSize(playerid, TD_OpeningCase[playerid][0], 414.000000, 0.000000);
	PlayerTextDrawAlignment(playerid, TD_OpeningCase[playerid][0], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawSetShadow(playerid, TD_OpeningCase[playerid][0], 0);
	PlayerTextDrawUseBox(playerid, TD_OpeningCase[playerid][0], true);
	PlayerTextDrawBoxColour(playerid, TD_OpeningCase[playerid][0], 774781695);
	PlayerTextDrawBackgroundColour(playerid, TD_OpeningCase[playerid][0], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_OpeningCase[playerid][0], TEXT_DRAW_FONT_AHARONI_BOLD);
	PlayerTextDrawSetProportional(playerid, TD_OpeningCase[playerid][0], true);

	new
		str[INV_MAX_ITEM_NAME_LENGTH - 2 + 1];

	f(str, "%s", inv_ItemInfo[GetPVarInt(playerid, "CaseType_PVar")][IT_Name]);
	TD_OpeningCase[playerid][1] = CreatePlayerTextDraw(playerid, 323.000000, 125.000000, str); // Текст
	PlayerTextDrawLetterSize(playerid, TD_OpeningCase[playerid][1], 0.290666, 1.438222);
	PlayerTextDrawAlignment(playerid, TD_OpeningCase[playerid][1], TEXT_DRAW_ALIGN_CENTER);
	PlayerTextDrawColour(playerid, TD_OpeningCase[playerid][1], -1515871233);
	PlayerTextDrawSetOutline(playerid, TD_OpeningCase[playerid][1], 1);
	PlayerTextDrawBackgroundColour(playerid, TD_OpeningCase[playerid][1], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_OpeningCase[playerid][1], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_OpeningCase[playerid][1], 0);
	PlayerTextDrawSetProportional(playerid, TD_OpeningCase[playerid][1], true);

	TD_OpeningCase[playerid][2] = CreatePlayerTextDraw(playerid, 230.000000, 322.000000, "_"); // Кликабельный фон Диалоговое окно
	PlayerTextDrawFont(playerid, TD_OpeningCase[playerid][2], TEXT_DRAW_FONT_PREVIEW);
	PlayerTextDrawAlignment(playerid, TD_OpeningCase[playerid][2], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_OpeningCase[playerid][2], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_OpeningCase[playerid][2], 974263551);
	PlayerTextDrawSetShadow(playerid, TD_OpeningCase[playerid][2], 0);
	PlayerTextDrawSetSelectable(playerid, TD_OpeningCase[playerid][2], true);
	PlayerTextDrawSetProportional(playerid, TD_OpeningCase[playerid][2], false);
	PlayerTextDrawTextSize(playerid, TD_OpeningCase[playerid][2], 61.000000, 28.000000);
	PlayerTextDrawSetPreviewModel(playerid, TD_OpeningCase[playerid][2], 0);
	PlayerTextDrawSetPreviewRot(playerid, TD_OpeningCase[playerid][2], 0.000000, 0.000000, 0.000000, 1000.000000);

	TD_OpeningCase[playerid][3] = CreatePlayerTextDraw(playerid, 353.000000, 322.000000, "_"); // Кликабельный фон Забрать
	PlayerTextDrawFont(playerid, TD_OpeningCase[playerid][3], TEXT_DRAW_FONT_PREVIEW);
	PlayerTextDrawAlignment(playerid, TD_OpeningCase[playerid][3], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_OpeningCase[playerid][3], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_OpeningCase[playerid][3], 974263551);
	PlayerTextDrawSetShadow(playerid, TD_OpeningCase[playerid][3], 0);
	PlayerTextDrawSetSelectable(playerid, TD_OpeningCase[playerid][3], true);
	PlayerTextDrawSetProportional(playerid, TD_OpeningCase[playerid][3], false);
	PlayerTextDrawTextSize(playerid, TD_OpeningCase[playerid][3], 61.000000, 28.000000);
	PlayerTextDrawSetPreviewModel(playerid, TD_OpeningCase[playerid][3], 0);
	PlayerTextDrawSetPreviewRot(playerid, TD_OpeningCase[playerid][3], 0.000000, 0.000000, 0.000000, 1000.000000);

	TD_OpeningCase[playerid][4] = CreatePlayerTextDraw(playerid, 260.000000, 327.000000, "Диалоговое окно"); 
	PlayerTextDrawLetterSize(playerid, TD_OpeningCase[playerid][4], 0.151999, 1.716147);
	PlayerTextDrawAlignment(playerid, TD_OpeningCase[playerid][4], TEXT_DRAW_ALIGN_CENTER);
	PlayerTextDrawColour(playerid, TD_OpeningCase[playerid][4], -842150913);
	PlayerTextDrawBackgroundColour(playerid, TD_OpeningCase[playerid][4], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_OpeningCase[playerid][4], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_OpeningCase[playerid][4], 0);
	PlayerTextDrawSetProportional(playerid, TD_OpeningCase[playerid][4], true);

	TD_OpeningCase[playerid][5] = CreatePlayerTextDraw(playerid, 384.000000, 326.000000, "Забрать");
	PlayerTextDrawLetterSize(playerid, TD_OpeningCase[playerid][5], 0.204999, 1.898665);
	PlayerTextDrawAlignment(playerid, TD_OpeningCase[playerid][5], TEXT_DRAW_ALIGN_CENTER);
	PlayerTextDrawColour(playerid, TD_OpeningCase[playerid][5], -842150913);
	PlayerTextDrawBackgroundColour(playerid, TD_OpeningCase[playerid][5], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_OpeningCase[playerid][5], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_OpeningCase[playerid][5], 0);
	PlayerTextDrawSetProportional(playerid, TD_OpeningCase[playerid][5], true);

	TD_OpeningCase[playerid][6] = CreatePlayerTextDraw(playerid, 230.000000, 126.000000, "_"); // Задний фон текста
	PlayerTextDrawLetterSize(playerid, TD_OpeningCase[playerid][6], 0.000000, 1.433331);
	PlayerTextDrawTextSize(playerid, TD_OpeningCase[playerid][6], 414.000000, 0.000000);
	PlayerTextDrawAlignment(playerid, TD_OpeningCase[playerid][6], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_OpeningCase[playerid][6], 0xFFFFFFFF);
	PlayerTextDrawSetShadow(playerid, TD_OpeningCase[playerid][6], 0);
	PlayerTextDrawUseBox(playerid, TD_OpeningCase[playerid][6], true);
	PlayerTextDrawBoxColour(playerid, TD_OpeningCase[playerid][6], 690563583);
	PlayerTextDrawBackgroundColour(playerid, TD_OpeningCase[playerid][6], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_OpeningCase[playerid][6], TEXT_DRAW_FONT_AHARONI_BOLD);
	PlayerTextDrawSetProportional(playerid, TD_OpeningCase[playerid][6], true);

	TD_OpeningCase[playerid][7] = CreatePlayerTextDraw(playerid, 232.000000, 144.000000, "_"); // Текст 1
	PlayerTextDrawLetterSize(playerid, TD_OpeningCase[playerid][7], 0.186333, 1.301333);
	PlayerTextDrawAlignment(playerid, TD_OpeningCase[playerid][7], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_OpeningCase[playerid][7], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_OpeningCase[playerid][7], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_OpeningCase[playerid][7], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_OpeningCase[playerid][7], 0);
	PlayerTextDrawSetProportional(playerid, TD_OpeningCase[playerid][7], true);

	TD_OpeningCase[playerid][8] = CreatePlayerTextDraw(playerid, 232.000000, 157.000000, "_"); // Текст 2
	PlayerTextDrawLetterSize(playerid, TD_OpeningCase[playerid][8], 0.186333, 1.301333);
	PlayerTextDrawAlignment(playerid, TD_OpeningCase[playerid][8], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_OpeningCase[playerid][8], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_OpeningCase[playerid][8], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_OpeningCase[playerid][8], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_OpeningCase[playerid][8], 0);
	PlayerTextDrawSetProportional(playerid, TD_OpeningCase[playerid][8], true);

	TD_OpeningCase[playerid][9] = CreatePlayerTextDraw(playerid, 232.000000, 170.000000, "_"); // Текст 3
	PlayerTextDrawLetterSize(playerid, TD_OpeningCase[playerid][9], 0.186333, 1.301333);
	PlayerTextDrawAlignment(playerid, TD_OpeningCase[playerid][9], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_OpeningCase[playerid][9], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_OpeningCase[playerid][9], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_OpeningCase[playerid][9], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_OpeningCase[playerid][9], 0);
	PlayerTextDrawSetProportional(playerid, TD_OpeningCase[playerid][9], true);

	TD_OpeningCase[playerid][10] = CreatePlayerTextDraw(playerid, 232.000000, 183.000000, "_"); // Текст 4
	PlayerTextDrawLetterSize(playerid, TD_OpeningCase[playerid][10], 0.186333, 1.301333);
	PlayerTextDrawAlignment(playerid, TD_OpeningCase[playerid][10], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_OpeningCase[playerid][10], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_OpeningCase[playerid][10], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_OpeningCase[playerid][10], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_OpeningCase[playerid][10], 0);
	PlayerTextDrawSetProportional(playerid, TD_OpeningCase[playerid][10], true);

	TD_OpeningCase[playerid][11] = CreatePlayerTextDraw(playerid, 232.000000, 196.000000, "_"); // Текст 5
	PlayerTextDrawLetterSize(playerid, TD_OpeningCase[playerid][11], 0.186333, 1.301333);
	PlayerTextDrawAlignment(playerid, TD_OpeningCase[playerid][11], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_OpeningCase[playerid][11], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_OpeningCase[playerid][11], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_OpeningCase[playerid][11], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_OpeningCase[playerid][11], 0);
	PlayerTextDrawSetProportional(playerid, TD_OpeningCase[playerid][11], true);

	TD_OpeningCase[playerid][12] = CreatePlayerTextDraw(playerid, 232.000000, 209.000000, "_"); // Текст 6
	PlayerTextDrawLetterSize(playerid, TD_OpeningCase[playerid][12], 0.186333, 1.301333);
	PlayerTextDrawAlignment(playerid, TD_OpeningCase[playerid][12], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_OpeningCase[playerid][12], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_OpeningCase[playerid][12], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_OpeningCase[playerid][12], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_OpeningCase[playerid][12], 0);
	PlayerTextDrawSetProportional(playerid, TD_OpeningCase[playerid][12], true);

	TD_OpeningCase[playerid][13] = CreatePlayerTextDraw(playerid, 232.000000, 222.000000, "_"); // Текст 7
	PlayerTextDrawLetterSize(playerid, TD_OpeningCase[playerid][13], 0.186333, 1.301333);
	PlayerTextDrawAlignment(playerid, TD_OpeningCase[playerid][13], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_OpeningCase[playerid][13], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_OpeningCase[playerid][13], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_OpeningCase[playerid][13], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_OpeningCase[playerid][13], 0);
	PlayerTextDrawSetProportional(playerid, TD_OpeningCase[playerid][13], true);

	TD_OpeningCase[playerid][14] = CreatePlayerTextDraw(playerid, 232.000000, 235.000000, "_"); // Текст 8
	PlayerTextDrawLetterSize(playerid, TD_OpeningCase[playerid][14], 0.186333, 1.301333);
	PlayerTextDrawAlignment(playerid, TD_OpeningCase[playerid][14], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_OpeningCase[playerid][14], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_OpeningCase[playerid][14], 0xFFFFFFFF);
	PlayerTextDrawFont(playerid, TD_OpeningCase[playerid][14], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_OpeningCase[playerid][14], 0);
	PlayerTextDrawSetProportional(playerid, TD_OpeningCase[playerid][14], true);
	return 1;
}

static ShowTDOpenPlayerCase(playerid) 
{
	TD_OpenCase[playerid][0] = CreatePlayerTextDraw(playerid, 269.666687, 325.488922, "_"); // Кликабельный фон кнопки открыть
	PlayerTextDrawFont(playerid, TD_OpenCase[playerid][0], TEXT_DRAW_FONT_PREVIEW);
	PlayerTextDrawAlignment(playerid, TD_OpenCase[playerid][0], TEXT_DRAW_ALIGN_LEFT);
	PlayerTextDrawColour(playerid, TD_OpenCase[playerid][0], 0xFFFFFFFF);
	PlayerTextDrawBackgroundColour(playerid, TD_OpenCase[playerid][0], 1313754879);
	PlayerTextDrawSetShadow(playerid, TD_OpenCase[playerid][0], 0);
	PlayerTextDrawSetSelectable(playerid, TD_OpenCase[playerid][0], true);
	PlayerTextDrawSetProportional(playerid, TD_OpenCase[playerid][0], false);
	PlayerTextDrawTextSize(playerid, TD_OpenCase[playerid][0], 96.000000, 32.000000);
	PlayerTextDrawSetPreviewModel(playerid, TD_OpenCase[playerid][0], 0);
	PlayerTextDrawSetPreviewRot(playerid, TD_OpenCase[playerid][0], 0.000000, 0.000000, 0.000000, 1000.000000);

	TD_OpenCase[playerid][1] = CreatePlayerTextDraw(playerid, 318.000000, 331.000000, "Открыть");
	PlayerTextDrawLetterSize(playerid, TD_OpenCase[playerid][1], 0.332333, 1.906962);
	PlayerTextDrawAlignment(playerid, TD_OpenCase[playerid][1], TEXT_DRAW_ALIGN_CENTER);
	PlayerTextDrawColour(playerid, TD_OpenCase[playerid][1], 0xFFFFFFFF);
	PlayerTextDrawSetOutline(playerid, TD_OpenCase[playerid][1], 1);
	PlayerTextDrawBackgroundColour(playerid, TD_OpenCase[playerid][1], 48);
	PlayerTextDrawFont(playerid, TD_OpenCase[playerid][1], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetShadow(playerid, TD_OpeningCase[playerid][1], 0);
	PlayerTextDrawSetProportional(playerid, TD_OpenCase[playerid][1], true);

	new
		str[INV_MAX_ITEM_NAME_LENGTH - 2 + 1];

	f(str, "%s", inv_ItemInfo[GetPVarInt(playerid, "CaseType_PVar")][IT_Name]);
	TD_OpenCase[playerid][2] = CreatePlayerTextDraw(playerid, 318.000000, 310.000000, str); // Вид кейса
	PlayerTextDrawLetterSize(playerid, TD_OpenCase[playerid][2], 0.241333, 1.707851);
	PlayerTextDrawAlignment(playerid, TD_OpenCase[playerid][2], TEXT_DRAW_ALIGN_CENTER);

	switch(GetPVarInt(playerid, "CaseType_PVar")) {
		case 312: PlayerTextDrawColour(playerid, TD_OpenCase[playerid][2], -1378294017);
		case 313: PlayerTextDrawColour(playerid, TD_OpenCase[playerid][2], 0xfaf039FF);
		case 314: PlayerTextDrawColour(playerid, TD_OpenCase[playerid][2], 0xe63737FF);
	}

	PlayerTextDrawSetOutline(playerid, TD_OpenCase[playerid][2], 1);
	PlayerTextDrawBackgroundColour(playerid, TD_OpenCase[playerid][2], 32);
	PlayerTextDrawFont(playerid, TD_OpenCase[playerid][2], TEXT_DRAW_FONT_BANK_GOTHIC);
	PlayerTextDrawSetProportional(playerid, TD_OpenCase[playerid][2], true);
	return 1;
}

static StartOpenPlayerCase(playerid, case_type, item_id)
{
	// 312 малый кейс / 313 средний кейс / 314 большой кейс

	SetPVarInt(playerid, "CaseType_PVar", case_type);
	SetPVarInt(playerid, "CaseCellID_PVar", item_id);

	switch(case_type) {
		case 312: inv_PlayerCaseBox[playerid] = CreatePlayerObject(playerid, inv_ItemInfo[312][IT_Model], 3446.03418, 2285.24268, 18.40650, 0.00000, 0.00000, -127.00000);
		case 313: inv_PlayerCaseBox[playerid] = CreatePlayerObject(playerid, inv_ItemInfo[313][IT_Model], 3446.03418, 2285.24268, 18.40650, 0.00000, 0.00000, -127.00000);
		case 314: inv_PlayerCaseBox[playerid] = CreatePlayerObject(playerid, inv_ItemInfo[314][IT_Model], 3446.03418, 2285.24268, 18.26650, 0.00000, 0.00000, -127.00000);
	}

	switch(case_type) {
		case 312: {
			InterpolateCameraPos(playerid, 3375.232910, 2321.071777, 19.390857, 3444.799560, 2286.132812, 18.579978, 3500);
			InterpolateCameraLookAt(playerid, 3380.231689, 2321.063476, 19.279409, 3448.812988, 2283.194091, 18.074501, 3500);
		}
		case 313: {
			InterpolateCameraPos(playerid, 3375.232910, 2321.071777, 19.390857, 3444.799560, 2286.132812, 18.579978, 3500);
			InterpolateCameraLookAt(playerid, 3380.231689, 2321.063476, 19.279409, 3448.812988, 2283.194091, 18.074501, 3500);
		}
		case 314: {
			InterpolateCameraPos(playerid, 3375.232910, 2321.071777, 19.390857, 3443.762207, 2287.088867, 19.196407, 3500);
			InterpolateCameraLookAt(playerid, 3380.231689, 2321.063476, 19.279409, 3447.550537, 2283.934326, 18.361534, 3500);
		}
	}

	n_for(i, sizeof(TD_BlackStripe))
		TextDrawShowForPlayer(playerid, TD_BlackStripe[i]);

	inv_PlayerCaseTimer[playerid] = SetPlayerTimer(playerid, "Inv_TurnPlayerCase", 3500, false);
	return 1;
}

static StartPlayerBackCameraCase(playerid)
{
	switch(GetPVarInt(playerid, "CaseType_PVar")) {
		case 312: {
			InterpolateCameraPos(playerid, 3444.799560, 2286.132812, 18.579978, 3375.232910, 2321.071777, 19.390857, 3500);
			InterpolateCameraLookAt(playerid, 3448.812988, 2283.194091, 18.074501, 3380.231689, 2321.063476, 19.279409, 3500);
		}
		case 313: {
			InterpolateCameraPos(playerid, 3444.799560, 2286.132812, 18.579978, 3375.232910, 2321.071777, 19.390857, 3500);
			InterpolateCameraLookAt(playerid, 3448.812988, 2283.194091, 18.074501, 3380.231689, 2321.063476, 19.279409, 3500);
		}
		case 314: {
			InterpolateCameraPos(playerid, 3443.762207, 2287.088867, 19.196407, 3375.232910, 2321.071777, 19.390857, 3500);
			InterpolateCameraLookAt(playerid, 3447.550537, 2283.934326, 18.361534, 3380.231689, 2321.063476, 19.279409, 3500);
		}
	}

	inv_PlayerCaseTimer[playerid] = SetPlayerTimer(playerid, "Inv_TurnPlayerCase2", 3500, false);
	return 1;
}

static UpdatePlayerInventory(playerid)
{
	switch(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems]) {
		// Предметы
		case 2: {
			n_for(t, INV_TD_MAX_ITEMS) {
				DestroyPlayerTD(playerid, TD_InvCellItem[playerid][t]);
				DestroyPlayerTD(playerid, TD_InvCellItemCount[playerid][t]);
			}
		}
		// Баннеры
		case 1: {
			n_for(t, INV_TD_MAX_BANNERS) {
				DestroyPlayerTD(playerid, TD_InvCellBanner[playerid][t]);
				DestroyPlayerTD(playerid, TD_InvCellBannerSprite[playerid][t]);
				DestroyPlayerTD(playerid, TD_InvCellBannerCount[playerid][t]);
			}
		}
	}

	switch(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems]) {
		// Предметы
		case 1: {
			PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][22], 0x007a25BB);
			PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][23], 0x666666BB);

			n_for(i, sizeof(TD_InvBase[]))
				PlayerTextDrawShow(playerid, TD_InvBase[playerid][i]);

			ShowTDCellInv(playerid);
			UpdateTDItemsInv(playerid);

			n_for(i, INV_TD_MAX_ITEMS) {
				PlayerTextDrawShow(playerid, TD_InvCellItem[playerid][i]);
				PlayerTextDrawShow(playerid, TD_InvCellItemCount[playerid][i]);
			}

			PlayerTextDrawSetString(playerid, TD_InvBase[playerid][5], "Инвентарь (предметы)");
			PlayerTextDrawSetString(playerid, TD_InvBase[playerid][29], "Баннеры");
		}
		// Баннеры
		case 2: {
			PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][22], 0x007a25BB);
			PlayerTextDrawBackgroundColour(playerid, TD_InvBase[playerid][23], 0x666666BB);

			PlayerTextDrawHide(playerid, TD_InvBase[playerid][22]);
			PlayerTextDrawHide(playerid, TD_InvBase[playerid][23]);

			ShowTDCellBannersInv(playerid);
			UpdateTDBannersInv(playerid);

			n_for(i, INV_TD_MAX_BANNERS) {
				PlayerTextDrawShow(playerid, TD_InvCellBanner[playerid][i]);
				PlayerTextDrawShow(playerid, TD_InvCellBannerSprite[playerid][i]);
				PlayerTextDrawShow(playerid, TD_InvCellBannerCount[playerid][i]);
			}

			PlayerTextDrawSetString(playerid, TD_InvBase[playerid][5], "Инвентарь (баннеры)");
			PlayerTextDrawSetString(playerid, TD_InvBase[playerid][29], "Предметы");
		}
	}
	return 1;
}

publics Inv_TurnPlayerCase(playerid)
{
	switch(GetPVarInt(playerid, "CaseType_PVar")) {
		case 312: {
			SetPlayerCameraPos(playerid, 3444.799560, 2286.132812, 18.579978);
			SetPlayerCameraLookAt(playerid, 3448.812988, 2283.194091, 18.074501);
		}
		case 313: {
			SetPlayerCameraPos(playerid, 3444.799560, 2286.132812, 18.579978);
			SetPlayerCameraLookAt(playerid, 3448.812988, 2283.194091, 18.074501);
		}
		case 314: {
			SetPlayerCameraPos(playerid, 3443.762207, 2287.088867, 19.196407);
			SetPlayerCameraLookAt(playerid, 3447.550537, 2283.934326, 18.361534);
		}
	}

	Interface_Show(playerid, Interface:Cases);
	return 1;
}

publics Inv_TurnPlayerCase2(playerid)
{
	DeletePVar(playerid, "CaseType_PVar");
	DestroyPlayerObject(playerid, inv_PlayerCaseBox[playerid]);

	n_for(i, sizeof(TD_BlackStripe))
		TextDrawHideForPlayer(playerid, TD_BlackStripe[i]);

	SetPlayerCameraPos(playerid, 3375.232910, 2321.071777, 19.390857);
	SetPlayerCameraLookAt(playerid, 3380.231689, 2321.063476, 19.279409);

	Interface_Show(playerid, Interface:Inventory);

	SetPlayerCarabSpectating(playerid, false);
	return 1;
}

/*

	* MySQL *

*/

stock Inv_SavePlayer(playerid)
{
	static
		str[200],
		query[400];

	str[0] = query[0] = EOS;

	f(str, "%d,%d,%d,%d,%d,%d,%d,%d,", 
	inv_PlayerItemInfo[playerid][IN_StandSkin], inv_PlayerItemInfo[playerid][IN_Skin], inv_PlayerItemInfo[playerid][IN_Head], inv_PlayerItemInfo[playerid][IN_Headphones],
	inv_PlayerItemInfo[playerid][IN_Glasses], inv_PlayerItemInfo[playerid][IN_Mask], inv_PlayerItemInfo[playerid][IN_Watch], inv_PlayerItemInfo[playerid][IN_Banner]);

	mysql_format(MysqlID, query, sizeof(query), "UPDATE `"T_ACCOUNTS"` SET `Inv_items` = '%s' WHERE `ID` = '%d'", str, GetPlayerpID(playerid));
	mysql_tquery(MysqlID, query);

	str[0] = query[0] = EOS;

	// Предметы
	n_for(i, INV_PLAYER_MAX_ITEMS)
		f(str, "%s%d,", str, pInfo[playerid][pInvItem][i]);

	mysql_format(MysqlID, query, sizeof(query), "UPDATE `"T_ACCOUNTS"` SET `Inv_item` = '%s' WHERE `ID` = '%d'", str, GetPlayerpID(playerid));
	mysql_tquery(MysqlID, query);

	str[0] = query[0] = EOS;

	n_for(i, INV_PLAYER_MAX_ITEMS)
		f(str, "%s%d,", str, pInfo[playerid][pInvItemCount][i]);
	
	mysql_format(MysqlID, query, sizeof(query), "UPDATE `"T_ACCOUNTS"` SET `Inv_item_count` = '%s' WHERE `ID` = '%d'", str, GetPlayerpID(playerid));
	mysql_tquery(MysqlID, query);

	str[0] = query[0] = EOS;

	// Баннеры
	n_for(i, INV_PLAYER_MAX_BANNERS)
		f(str, "%s%d,", str, pInfo[playerid][pInvBanner][i]);

	mysql_format(MysqlID, query, sizeof(query), "UPDATE `"T_ACCOUNTS"` SET `Inv_banner` = '%s' WHERE `ID` = '%d'", str, GetPlayerpID(playerid));
	mysql_tquery(MysqlID, query);

	str[0] = query[0] = EOS;

	n_for(i, INV_PLAYER_MAX_BANNERS)
		f(str, "%s%d,", str, pInfo[playerid][pInvBannerCount][i]);
	
	mysql_format(MysqlID, query, sizeof(query), "UPDATE `"T_ACCOUNTS"` SET `Inv_banner_count` = '%s' WHERE `ID` = '%d'", str, GetPlayerpID(playerid));
	mysql_tquery(MysqlID, query);
	return 1; 
}

stock Inv_UploadPlayerData(playerid)
{
	static
		str[200],
		str2[400];

	str[0] = str2[0] = EOS;

	f(str, "p<,>a<i>[%i]", INV_PLAYER_MAX_DEST_ITEMS);
	cache_get_value_name(0, "Inv_items", str2, sizeof(str2)), sscanf(str2, str, inv_PlayerItemInfo[playerid]), str[0] = str2[0] = EOS;

	f(str, "p<,>a<i>[%i]", INV_PLAYER_MAX_ITEMS);
	cache_get_value_name(0, "Inv_item", str2, sizeof(str2)), sscanf(str2, str, pInfo[playerid][pInvItem]), str2[0] = EOS;
	cache_get_value_name(0, "Inv_item_count", str2, sizeof(str2)), sscanf(str2, str, pInfo[playerid][pInvItemCount]), str[0] = str2[0] = EOS;

	f(str, "p<,>a<i>[%i]", INV_PLAYER_MAX_BANNERS);
	cache_get_value_name(0, "Inv_banner", str2, sizeof(str2)), sscanf(str2, str, pInfo[playerid][pInvBanner]), str2[0] = EOS;
	cache_get_value_name(0, "Inv_banner_count", str2, sizeof(str2)), sscanf(str2, str, pInfo[playerid][pInvBannerCount]), str[0] = str2[0] = EOS;
	return 1;
}

/*

	* Reset *

*/

static ResetPlayerCase(playerid)
{
	pInfo[playerid][pInvItem][GetPVarInt(playerid, "CaseCellID_PVar")] =
	pInfo[playerid][pInvItemCount][GetPVarInt(playerid, "CaseCellID_PVar")] = 0;

	DeletePVar(playerid, "CaseCellID_PVar");

	Inv_SavePlayer(playerid);

	inv_PlayerTDInfo[playerid][INV_ActiveTab] =
	inv_PlayerTDInfo[playerid][INV_ChooseTab] =
	inv_PlayerTDInfo[playerid][INV_ActiveCell] =
	inv_PlayerTDInfo[playerid][INV_ActiveCellCount] = 0;

	inv_PlayerTDInfo[playerid][INV_ActiveCellItem] =
	inv_PlayerTDInfo[playerid][INV_ActiveChooseTab] =
	inv_PlayerTDInfo[playerid][INV_ActiveTD] = -1;
	return 1;
}

static ResetPlayerData(playerid)
{
	inv_PlayerTDInfo[playerid][INV_ActiveTab] =
	inv_PlayerTDInfo[playerid][INV_ChooseTab] =
	inv_PlayerTDInfo[playerid][INV_ActiveCell] =
	inv_PlayerTDInfo[playerid][INV_ActiveCellCount] = 0;

	inv_PlayerTDInfo[playerid][INV_ActiveCellItem] =
	inv_PlayerTDInfo[playerid][INV_ActiveChooseTab] =
	inv_PlayerTDInfo[playerid][INV_ActiveTD] = -1;

	inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] = 0;
	inv_PlayerTDInfo[playerid][INV_ActiveSelectCell] = false;

	n_for(i, INV_PLAYER_MAX_ITEMS) {
		pInfo[playerid][pInvItem][i] =
		pInfo[playerid][pInvItemCount][i] = 0;
	}

	n_for(i, INV_PLAYER_MAX_BANNERS) {
		pInfo[playerid][pInvBanner][i] =
		pInfo[playerid][pInvBannerCount][i] = 0;
	}

	inv_PlayerItemInfo[playerid][IN_StandSkin] =
	inv_PlayerItemInfo[playerid][IN_Skin] =
	inv_PlayerItemInfo[playerid][IN_Head] =
	inv_PlayerItemInfo[playerid][IN_Headphones] =
	inv_PlayerItemInfo[playerid][IN_Glasses] =
	inv_PlayerItemInfo[playerid][IN_Mask] =
	inv_PlayerItemInfo[playerid][IN_Watch] =
	inv_PlayerItemInfo[playerid][IN_Banner] = 0;

	// Cases
	inv_PlayerCase[playerid][PC_Exp] =
	inv_PlayerCase[playerid][PC_Credits] =
	inv_PlayerCase[playerid][PC_GoldCoins] = 0;

	n_for(i, CASE_MAX_REWARDS)
		inv_PlayerCase[playerid][PC_Item][i] = 0;

	return 1;
}

static ResertPlayerTDs(playerid)
{
	n_for(i, sizeof(TD_InvBase[]))
		TD_InvBase[playerid][i] = PlayerText:INVALID_TEXT_DRAW;

	n_for(i, sizeof(TD_InvCellItem[]))
		TD_InvCellItem[playerid][i] = PlayerText:INVALID_TEXT_DRAW;

	n_for(i, sizeof(TD_InvCellItemCount[]))
		TD_InvCellItemCount[playerid][i] = PlayerText:INVALID_TEXT_DRAW;

	n_for(i, sizeof(TD_InvCellBanner[]))
		TD_InvCellBanner[playerid][i] = PlayerText:INVALID_TEXT_DRAW;

	n_for(i, sizeof(TD_InvCellBannerSprite[]))
		TD_InvCellBannerSprite[playerid][i] = PlayerText:INVALID_TEXT_DRAW;

	n_for(i, sizeof(TD_InvCellBannerCount[]))
		TD_InvCellBannerCount[playerid][i] = PlayerText:INVALID_TEXT_DRAW;

	n_for(i, sizeof(TD_InvActionCell[]))
		TD_InvActionCell[playerid][i] = PlayerText:INVALID_TEXT_DRAW;

	// Cases
	n_for(t, sizeof(TD_OpenCase[]))
		TD_OpenCase[playerid][t] = PlayerText:INVALID_TEXT_DRAW;

	n_for(t, sizeof(TD_OpeningCase[]))
		TD_OpeningCase[playerid][t] = PlayerText:INVALID_TEXT_DRAW;

	return 1;
}

/*

	* Interfaces *

*/

InterfaceCreate:Inventory(playerid)
{
	inv_PlayerTDInfo[playerid][INV_ActiveSelectCell] = true;

	if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 0)
		inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] = 1;

	inv_PlayerTDInfo[playerid][INV_ActiveTab] = 0;

	Inv_ShowTDBase(playerid);
	Inv_UpdateTDBase(playerid);

	UpdatePlayerInventory(playerid);
	return 1;
}

InterfaceClose:Inventory(playerid, bool:hide)
{
	switch(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems]) {
		// Предметы
		case 1: {
			n_for(t, INV_TD_MAX_ITEMS) {
				DestroyPlayerTD(playerid, TD_InvCellItem[playerid][t]);
				DestroyPlayerTD(playerid, TD_InvCellItemCount[playerid][t]);
			}
		}
		// Баннеры
		case 2: {
			n_for(t, INV_TD_MAX_BANNERS) {
				DestroyPlayerTD(playerid, TD_InvCellBanner[playerid][t]);
				DestroyPlayerTD(playerid, TD_InvCellBannerSprite[playerid][t]);
				DestroyPlayerTD(playerid, TD_InvCellBannerCount[playerid][t]);
			}
		}
	}

	inv_PlayerTDInfo[playerid][INV_ChooseTab] =
	inv_PlayerTDInfo[playerid][INV_ActiveCell] =
	inv_PlayerTDInfo[playerid][INV_ActiveCellCount] =
	inv_PlayerTDInfo[playerid][INV_ActiveTab] =
	inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] = 0;

	inv_PlayerTDInfo[playerid][INV_ActiveCellItem] =
	inv_PlayerTDInfo[playerid][INV_ActiveTD] = -1;

	inv_PlayerTDInfo[playerid][INV_ActiveSelectCell] = false;

	n_for(i, sizeof(TD_InvBase[]))
		DestroyPlayerTD(playerid, TD_InvBase[playerid][i]);

	n_for(i, sizeof(TD_InvActionCell[]))
		DestroyPlayerTD(playerid, TD_InvActionCell[playerid][i]);
		
	inv_PlayerTDInfo[playerid][INV_ActiveChooseTab] = -1;

	ClosePlayerDialog(playerid);
	return 1;
}

InterfacePlayerClick:Inventory(playerid, PlayerText:playertextid)
{
	if(playertextid == TD_InvBase[playerid][26]) {
		Interface_Close(playerid, Interface:Inventory);
		Interface_Show(playerid, Interface:MainMenu);
		return 1;
	}
	else if(playertextid == TD_InvBase[playerid][22]) 
		return UpdatePlayerTDSlots(playerid, 0, 22, 23);

	else if(playertextid == TD_InvBase[playerid][23]) 
		return UpdatePlayerTDSlots(playerid, 1, 23, 22);

	else if(playertextid == TD_InvBase[playerid][29]) {
		switch(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems]) {
			// Предметы
			case 1: {
				if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 1) {
					n_for(i, INV_TD_MAX_ITEMS) {
						DestroyPlayerTD(playerid, TD_InvCellItem[playerid][i]);
						DestroyPlayerTD(playerid, TD_InvCellItemCount[playerid][i]);
					}
					inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] = 2;
				}
			}
			// Баннеры
			case 2: {
				n_for(i, INV_TD_MAX_BANNERS) {
					DestroyPlayerTD(playerid, TD_InvCellBanner[playerid][i]);
					DestroyPlayerTD(playerid, TD_InvCellBannerSprite[playerid][i]);
					DestroyPlayerTD(playerid, TD_InvCellBannerCount[playerid][i]);
				}
				inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] = 1;
			}
		}
		HideSelectedCell(playerid);
		ClosePlayerDialog(playerid);

		inv_PlayerTDInfo[playerid][INV_ActiveTab] = 0;

		UpdatePlayerInventory(playerid);
		return 1;
	}
	if(inv_PlayerTDInfo[playerid][INV_ActiveSelectCell]) {
		if(inv_PlayerTDInfo[playerid][INV_ActiveCellItem] > -1) {
			// Использовать
			if(playertextid == TD_InvActionCell[playerid][1]) {
				switch(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems]) {
					// Предметы
					case 1: UsePlayerItem(playerid, inv_PlayerTDInfo[playerid][INV_ActiveCellItem]);
					// Баннеры
					case 2: UsePlayerBanner(playerid, inv_PlayerTDInfo[playerid][INV_ActiveCellItem]);
				}
				return 1;
			}
			// Передать
			else if(playertextid == TD_InvActionCell[playerid][2]) {
				new
					cellitem = inv_PlayerTDInfo[playerid][INV_ActiveCellItem];

				if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 1) {
					if(!Inv_IsItemForPlayer(playerid, pInfo[playerid][pInvItem][cellitem])) 
						return 1;
				}
				Dialog_Show(playerid, Dialog:InventoryTransfer);
				inv_PlayerTDInfo[playerid][INV_ActiveSelectCell] = false;
				return 1;
			}
			// Информация
			else if(playertextid == TD_InvActionCell[playerid][3]) {
				Dialog_Show(playerid, Dialog:InventoryInfoItem);
				return 1;
			}
			// Выкинуть
			else if(playertextid == TD_InvActionCell[playerid][4]) {
				Dialog_Show(playerid, Dialog:InventoryDropItem);
				return 1;
			}
		}
		// Предметы
		if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 1) {
			// Голова
			if(playertextid == TD_InvBase[playerid][7]) {
				new
					cellitem = inv_PlayerTDInfo[playerid][INV_ActiveCellItem],
					using_item = inv_PlayerItemInfo[playerid][IN_Head];

				if(cellitem > -1) {
					if(Inv_CheckItemDestination(pInfo[playerid][pInvItem][cellitem]) != INV_PLAYER_DEST_HEAD) 
						return 1;

					if(using_item == pInfo[playerid][pInvItem][cellitem]) 
						return 1;

					if(!Inv_IsItemForPlayer(playerid, pInfo[playerid][pInvItem][cellitem])) 
						return 1;
					
					if(pInfo[playerid][pInvItemCount][cellitem] > 1) {
						if(!Inv_CheckPlayerFullItem(playerid, using_item, 1)) {
							SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
							return 1;
						}
						inv_PlayerItemInfo[playerid][IN_Head] = pInfo[playerid][pInvItem][cellitem];

						Inv_SetPlayerItem(playerid, using_item, 1);
						using_item = pInfo[playerid][pInvItem][cellitem];
						pInfo[playerid][pInvItemCount][cellitem]--;
					}
					else {
						new
							item = pInfo[playerid][pInvItem][cellitem];

						inv_PlayerItemInfo[playerid][IN_Head] = item;
						pInfo[playerid][pInvItem][cellitem] = using_item;
						
						if(using_item == 0) 
							pInfo[playerid][pInvItemCount][cellitem] = 0;
						
						using_item = item;
					}
					new
						itemtd_id, 
						tab_list;

					CheckItemOnTDPlayerInventory(cellitem, itemtd_id, tab_list);
					UpdatePlayerTDInventory(playerid, 1, tab_list, cellitem, itemtd_id);

					HideSelectedCell(playerid);
					Inv_SavePlayer(playerid);
				}
				else {
					if(using_item > 0) {
						if(!Inv_CheckPlayerFullItem(playerid, using_item, 1)) {
							SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
							return 1;
						}
						Inv_SetPlayerItem(playerid, using_item, 1);
						inv_PlayerItemInfo[playerid][IN_Head] = 0;
						using_item = 0;

						Inv_SavePlayer(playerid);
					}
				}
				PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][7], inv_ItemInfo[using_item][IT_Model]);
				
				if(using_item > 0) 
					PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][7], inv_ItemInfo[using_item][IT_PosX], inv_ItemInfo[using_item][IT_PosY], inv_ItemInfo[using_item][IT_PosZ], 1.000000);
				else 
					PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][7], 0.0, 0.0, 0.0, 1000.000000);
				
				PlayerTextDrawShow(playerid, TD_InvBase[playerid][7]);
				return 1;
			}
			// Наушники
			else if(playertextid == TD_InvBase[playerid][9]) {
				new
					cellitem = inv_PlayerTDInfo[playerid][INV_ActiveCellItem],
					using_item = inv_PlayerItemInfo[playerid][IN_Headphones];

				if(cellitem > -1) {
					if(Inv_CheckItemDestination(pInfo[playerid][pInvItem][cellitem]) != INV_PLAYER_DEST_HEADPHONES) 
						return 1;

					if(using_item == pInfo[playerid][pInvItem][cellitem]) 
						return 1;

					if(!Inv_IsItemForPlayer(playerid, pInfo[playerid][pInvItem][cellitem])) 
						return 1;
					
					if(pInfo[playerid][pInvItemCount][cellitem] > 1) {
						if(!Inv_CheckPlayerFullItem(playerid, using_item, 1)) {
							SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
							return 1;
						}
						inv_PlayerItemInfo[playerid][IN_Headphones] = pInfo[playerid][pInvItem][cellitem];

						Inv_SetPlayerItem(playerid, using_item, 1);
						using_item = pInfo[playerid][pInvItem][cellitem];
						pInfo[playerid][pInvItemCount][cellitem]--;
					}
					else {
						new
							item = pInfo[playerid][pInvItem][cellitem];

						inv_PlayerItemInfo[playerid][IN_Headphones] = item;
						pInfo[playerid][pInvItem][cellitem] = using_item;
						
						if(using_item == 0) 
							pInfo[playerid][pInvItemCount][cellitem] = 0;
						
						using_item = item;
					}
					new
						itemtd_id, 
						tab_list;

					CheckItemOnTDPlayerInventory(cellitem, itemtd_id, tab_list);
					UpdatePlayerTDInventory(playerid, 1, tab_list, cellitem, itemtd_id);

					HideSelectedCell(playerid);
					Inv_SavePlayer(playerid);
				}
				else {
					if(using_item > 0) {
						if(!Inv_CheckPlayerFullItem(playerid, using_item, 1)) {
							SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
							return 1;
						}
						Inv_SetPlayerItem(playerid, using_item, 1);
						inv_PlayerItemInfo[playerid][IN_Headphones] = 0;
						using_item = 0;

						Inv_SavePlayer(playerid);
					}
				}
				PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][9], inv_ItemInfo[using_item][IT_Model]);
				
				if(using_item > 0) 
					PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][9], inv_ItemInfo[using_item][IT_PosX], inv_ItemInfo[using_item][IT_PosY], inv_ItemInfo[using_item][IT_PosZ], 1.000000);
				else 
					PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][9], 0.0, 0.0, 0.0, 1000.000000);
				
				PlayerTextDrawShow(playerid, TD_InvBase[playerid][9]);
				return 1;
			}
			// Очки
			else if(playertextid == TD_InvBase[playerid][11]) {
				new
					cellitem = inv_PlayerTDInfo[playerid][INV_ActiveCellItem],
					using_item = inv_PlayerItemInfo[playerid][IN_Glasses];

				if(cellitem > -1) {
					if(Inv_CheckItemDestination(pInfo[playerid][pInvItem][cellitem]) != INV_PLAYER_DEST_GLASSES) 
						return 1;

					if(using_item == pInfo[playerid][pInvItem][cellitem]) 
						return 1;

					if(!Inv_IsItemForPlayer(playerid, pInfo[playerid][pInvItem][cellitem])) 
						return 1;
					
					if(pInfo[playerid][pInvItemCount][cellitem] > 1) {
						if(!Inv_CheckPlayerFullItem(playerid, using_item, 1)) {
							SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
							return 1;
						}
						inv_PlayerItemInfo[playerid][IN_Glasses] = pInfo[playerid][pInvItem][cellitem];

						Inv_SetPlayerItem(playerid, using_item, 1);
						using_item = pInfo[playerid][pInvItem][cellitem];
						pInfo[playerid][pInvItemCount][cellitem]--;
					}
					else {
						new
							item = pInfo[playerid][pInvItem][cellitem];

						inv_PlayerItemInfo[playerid][IN_Glasses] = item;
						pInfo[playerid][pInvItem][cellitem] = using_item;
						
						if(using_item == 0) 
							pInfo[playerid][pInvItemCount][cellitem] = 0;
						
						using_item = item;
					}
					new
						itemtd_id, 
						tab_list;

					CheckItemOnTDPlayerInventory(cellitem, itemtd_id, tab_list);
					UpdatePlayerTDInventory(playerid, 1, tab_list, cellitem, itemtd_id);

					HideSelectedCell(playerid);
					Inv_SavePlayer(playerid);
				}
				else {
					if(using_item > 0) {
						if(!Inv_CheckPlayerFullItem(playerid, using_item, 1)) {
							SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
							return 1;
						}
						Inv_SetPlayerItem(playerid, using_item, 1);
						inv_PlayerItemInfo[playerid][IN_Glasses] = 0;
						using_item = 0;

						Inv_SavePlayer(playerid);
					}
				}
				PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][11], inv_ItemInfo[using_item][IT_Model]);
				
				if(using_item > 0) 
					PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][11], inv_ItemInfo[using_item][IT_PosX], inv_ItemInfo[using_item][IT_PosY], inv_ItemInfo[using_item][IT_PosZ], 1.000000);
				else 
					PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][11], 0.0, 0.0, 0.0, 1000.000000);
				
				PlayerTextDrawShow(playerid, TD_InvBase[playerid][11]);
				return 1;
			}
			// Маска
			else if(playertextid == TD_InvBase[playerid][13]) {
				new
					cellitem = inv_PlayerTDInfo[playerid][INV_ActiveCellItem],
					using_item = inv_PlayerItemInfo[playerid][IN_Mask];

				if(cellitem > -1) {
					if(Inv_CheckItemDestination(pInfo[playerid][pInvItem][cellitem]) != INV_PLAYER_DEST_MASKS) 
						return 1;

					if(using_item == pInfo[playerid][pInvItem][cellitem]) 
						return 1;

					if(!Inv_IsItemForPlayer(playerid, pInfo[playerid][pInvItem][cellitem])) 
						return 1;
					
					if(pInfo[playerid][pInvItemCount][cellitem] > 1) {
						if(!Inv_CheckPlayerFullItem(playerid, using_item, 1)) {
							SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
							return 1;
						}
						inv_PlayerItemInfo[playerid][IN_Mask] = pInfo[playerid][pInvItem][cellitem];

						Inv_SetPlayerItem(playerid, using_item, 1);
						using_item = pInfo[playerid][pInvItem][cellitem];
						pInfo[playerid][pInvItemCount][cellitem]--;
					}
					else {
						new
							item = pInfo[playerid][pInvItem][cellitem];

						inv_PlayerItemInfo[playerid][IN_Mask] = item;
						pInfo[playerid][pInvItem][cellitem] = using_item;
						
						if(using_item == 0)
							pInfo[playerid][pInvItemCount][cellitem] = 0;
						
						using_item = item;
					}
					new
						itemtd_id,
						tab_list;

					CheckItemOnTDPlayerInventory(cellitem, itemtd_id, tab_list);
					UpdatePlayerTDInventory(playerid, 1, tab_list, cellitem, itemtd_id);

					HideSelectedCell(playerid);
					Inv_SavePlayer(playerid);
				}
				else {
					if(using_item > 0) {
						if(!Inv_CheckPlayerFullItem(playerid, using_item, 1)) {
							SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
							return 1;
						}
						Inv_SetPlayerItem(playerid, using_item, 1);
						inv_PlayerItemInfo[playerid][IN_Mask] = 0;
						using_item = 0;

						Inv_SavePlayer(playerid);
					}
				}
				PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][13], inv_ItemInfo[using_item][IT_Model]);
				
				if(using_item > 0)
					PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][13], inv_ItemInfo[using_item][IT_PosX], inv_ItemInfo[using_item][IT_PosY], inv_ItemInfo[using_item][IT_PosZ], 1.000000);
				else 
					PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][13], 0.0, 0.0, 0.0, 1000.000000);
				
				PlayerTextDrawShow(playerid, TD_InvBase[playerid][13]);
				return 1;
			}
			// Часы
			else if(playertextid == TD_InvBase[playerid][15]) {
				new
					cellitem = inv_PlayerTDInfo[playerid][INV_ActiveCellItem],
					using_item = inv_PlayerItemInfo[playerid][IN_Watch];

				if(cellitem > -1) {
					if(Inv_CheckItemDestination(pInfo[playerid][pInvItem][cellitem]) != INV_PLAYER_DEST_WATCH) 
						return 1;

					if(using_item == pInfo[playerid][pInvItem][cellitem]) 
						return 1;

					if(!Inv_IsItemForPlayer(playerid, pInfo[playerid][pInvItem][cellitem])) 
						return 1;
					
					if(pInfo[playerid][pInvItemCount][cellitem] > 1) {
						if(!Inv_CheckPlayerFullItem(playerid, using_item, 1)) {
							SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
							return 1;
						}
						inv_PlayerItemInfo[playerid][IN_Watch] = pInfo[playerid][pInvItem][cellitem];

						Inv_SetPlayerItem(playerid, using_item, 1);
						using_item = pInfo[playerid][pInvItem][cellitem];
						pInfo[playerid][pInvItemCount][cellitem]--;
					}
					else {
						new
							item = pInfo[playerid][pInvItem][cellitem];

						inv_PlayerItemInfo[playerid][IN_Watch] = item;
						pInfo[playerid][pInvItem][cellitem] = using_item;
						
						if(using_item == 0) 
							pInfo[playerid][pInvItemCount][cellitem] = 0;
						
						using_item = item;
					}
					new
						itemtd_id,
						tab_list;

					CheckItemOnTDPlayerInventory(cellitem, itemtd_id, tab_list);
					UpdatePlayerTDInventory(playerid, 1, tab_list, cellitem, itemtd_id);

					HideSelectedCell(playerid);
					Inv_SavePlayer(playerid);
				}
				else {
					if(using_item > 0) {
						if(!Inv_CheckPlayerFullItem(playerid, using_item, 1)) {
							SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
							return 1;
						}
						Inv_SetPlayerItem(playerid, using_item, 1);
						inv_PlayerItemInfo[playerid][IN_Watch] = 0;
						using_item = 0;

						Inv_SavePlayer(playerid);
					}
				}
				PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][15], inv_ItemInfo[using_item][IT_Model]);
				
				if(using_item > 0) 
					PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][15], inv_ItemInfo[using_item][IT_PosX], inv_ItemInfo[using_item][IT_PosY], inv_ItemInfo[using_item][IT_PosZ], 1.000000);
				else 
					PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][15], 0.0, 0.0, 0.0, 1000.000000);
				
				PlayerTextDrawShow(playerid, TD_InvBase[playerid][15]);
				return 1;
			}
			// Скин
			else if(playertextid == TD_InvBase[playerid][17]) {
				new
					cellitem = inv_PlayerTDInfo[playerid][INV_ActiveCellItem],
					using_item = inv_PlayerItemInfo[playerid][IN_Skin];

				if(cellitem > -1) {
					if(Inv_CheckItemDestination(pInfo[playerid][pInvItem][cellitem]) != INV_PLAYER_DEST_SKINS) 
						return 1;

					if(using_item == pInfo[playerid][pInvItem][cellitem]) 
						return 1;

					if(!Inv_IsItemForPlayer(playerid, pInfo[playerid][pInvItem][cellitem])) 
						return 1;
					
					if(pInfo[playerid][pInvItemCount][cellitem] > 1) {
						if(using_item != inv_PlayerItemInfo[playerid][IN_StandSkin]) {
							if(!Inv_CheckPlayerFullItem(playerid, using_item, 1)) {
								SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
								return 1;
							}
							Inv_SetPlayerItem(playerid, using_item, 1);
						}
						inv_PlayerItemInfo[playerid][IN_Skin] = pInfo[playerid][pInvItem][cellitem];

						using_item = pInfo[playerid][pInvItem][cellitem];
						pInfo[playerid][pInvItemCount][cellitem]--;
					}
					else {
						new
							item = pInfo[playerid][pInvItem][cellitem];

						inv_PlayerItemInfo[playerid][IN_Skin] = item;

						if(using_item != inv_PlayerItemInfo[playerid][IN_StandSkin]) 
							pInfo[playerid][pInvItem][cellitem] = using_item;
						
						if(using_item == inv_PlayerItemInfo[playerid][IN_StandSkin]) {
							pInfo[playerid][pInvItem][cellitem] = 0;
							pInfo[playerid][pInvItemCount][cellitem] = 0;
						}
						using_item = item;
					}
					new
						itemtd_id, 
						tab_list;

					CheckItemOnTDPlayerInventory(cellitem, itemtd_id, tab_list);
					UpdatePlayerTDInventory(playerid, 1, tab_list, cellitem, itemtd_id);

					HideSelectedCell(playerid);
					Inv_SavePlayer(playerid);
				}
				else {
					if(using_item != inv_PlayerItemInfo[playerid][IN_StandSkin]) {
						if(!Inv_CheckPlayerFullItem(playerid, using_item, 1)) {
							SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
							return 1;
						}
						Inv_SetPlayerItem(playerid, using_item, 1);
						inv_PlayerItemInfo[playerid][IN_Skin] = inv_PlayerItemInfo[playerid][IN_StandSkin];
						using_item = inv_PlayerItemInfo[playerid][IN_StandSkin];

						Inv_SavePlayer(playerid);
					}
				}
				PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][6], inv_ItemInfo[using_item][IT_Model]);
				PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][6], inv_ItemInfo[using_item][IT_PosX], inv_ItemInfo[using_item][IT_PosY], inv_ItemInfo[using_item][IT_PosZ], 1.000000);
				PlayerTextDrawShow(playerid, TD_InvBase[playerid][6]);

				PlayerTextDrawSetPreviewModel(playerid, TD_InvBase[playerid][17], inv_ItemInfo[using_item][IT_Model]);

				if(using_item > 0)
					PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][17], inv_ItemInfo[using_item][IT_PosX], inv_ItemInfo[using_item][IT_PosY], inv_ItemInfo[using_item][IT_PosZ], 1.000000);
				else
					PlayerTextDrawSetPreviewRot(playerid, TD_InvBase[playerid][17], 0.0, 0.0, 0.0, 1000.000000);
				
				PlayerTextDrawShow(playerid, TD_InvBase[playerid][17]);

				static
					str[11 - 2 + 1 + 3];

				str[0] = EOS;

				f(str, "Скин_ID:_%i", inv_ItemInfo[using_item][IT_Model]);
				PlayerTextDrawSetString(playerid, TD_InvBase[playerid][18], str);
				return 1;
			}

			new
				c = 0;

			if(inv_PlayerTDInfo[playerid][INV_ActiveTab] > 0)
				c = INV_TD_MAX_ITEMS * inv_PlayerTDInfo[playerid][INV_ActiveTab];

			n_for(i, INV_TD_MAX_ITEMS) {
				if(playertextid == TD_InvCellItem[playerid][i]) {
					new
						cellitem = inv_PlayerTDInfo[playerid][INV_ActiveCellItem];

					if(cellitem > -1) {
						if(cellitem != c) {
							switch(Inv_CheckItemDestination(pInfo[playerid][pInvItem][cellitem])) {
								case INV_PLAYER_DEST_CASES: {
									if(pInfo[playerid][pInvItem][c] > 0) {
										pInfo[playerid][pInvItem][cellitem] = pInfo[playerid][pInvItem][c];
										pInfo[playerid][pInvItemCount][cellitem] = pInfo[playerid][pInvItemCount][c];
										pInfo[playerid][pInvItem][c] = inv_PlayerTDInfo[playerid][INV_ActiveCell];
										pInfo[playerid][pInvItemCount][c] = inv_PlayerTDInfo[playerid][INV_ActiveCellCount];
									}
									else {
										pInfo[playerid][pInvItem][c] = inv_PlayerTDInfo[playerid][INV_ActiveCell];
										pInfo[playerid][pInvItemCount][c] = inv_PlayerTDInfo[playerid][INV_ActiveCellCount];
										pInfo[playerid][pInvItem][cellitem] =
										pInfo[playerid][pInvItemCount][cellitem] = 0;
									}
								}
								default: {
									if(pInfo[playerid][pInvItem][c] == pInfo[playerid][pInvItem][cellitem] 
									&& (pInfo[playerid][pInvItemCount][c] < inv_ItemInfo[pInfo[playerid][pInvItem][c]][IT_Max])) {
										if((pInfo[playerid][pInvItemCount][c] + pInfo[playerid][pInvItemCount][cellitem]) > inv_ItemInfo[pInfo[playerid][pInvItem][c]][IT_Max]) {
											pInfo[playerid][pInvItemCount][cellitem] = (pInfo[playerid][pInvItemCount][c] + pInfo[playerid][pInvItemCount][cellitem]) - inv_ItemInfo[pInfo[playerid][pInvItem][c]][IT_Max];
											pInfo[playerid][pInvItemCount][c] = inv_ItemInfo[pInfo[playerid][pInvItem][c]][IT_Max];
										}
										else {
											pInfo[playerid][pInvItemCount][c] = pInfo[playerid][pInvItemCount][c] + pInfo[playerid][pInvItemCount][cellitem];
											pInfo[playerid][pInvItem][cellitem] =
											pInfo[playerid][pInvItemCount][cellitem] = 0;  
										}
									}
									else {
										if(pInfo[playerid][pInvItem][c] > 0) {
											pInfo[playerid][pInvItem][cellitem] = pInfo[playerid][pInvItem][c];
											pInfo[playerid][pInvItemCount][cellitem] = pInfo[playerid][pInvItemCount][c];
											pInfo[playerid][pInvItem][c] = inv_PlayerTDInfo[playerid][INV_ActiveCell];
											pInfo[playerid][pInvItemCount][c] = inv_PlayerTDInfo[playerid][INV_ActiveCellCount];
										}
										else {
											pInfo[playerid][pInvItem][c] = inv_PlayerTDInfo[playerid][INV_ActiveCell];
											pInfo[playerid][pInvItemCount][c] = inv_PlayerTDInfo[playerid][INV_ActiveCellCount];
											pInfo[playerid][pInvItem][cellitem] =
											pInfo[playerid][pInvItemCount][cellitem] = 0;
										}
									}
								}
							}
							if(inv_PlayerTDInfo[playerid][INV_ChooseTab] != inv_PlayerTDInfo[playerid][INV_ActiveTab]) 
								UpdateTDCellInv(playerid, c, i);
							else 
								UpdateTDCellInv(playerid, c, i, cellitem, inv_PlayerTDInfo[playerid][INV_ActiveTD]);

							HideSelectedCell(playerid);
							Inv_SavePlayer(playerid);
						}
						else {
							if(inv_PlayerTDInfo[playerid][INV_ActiveChooseTab] == -1) {
								inv_PlayerTDInfo[playerid][INV_ChooseTab] = inv_PlayerTDInfo[playerid][INV_ActiveTab];
								inv_PlayerTDInfo[playerid][INV_ActiveTD] = i;
								inv_PlayerTDInfo[playerid][INV_ActiveChooseTab] = i;
								ShowTDActionCell(playerid, i);

								n_for2(t, sizeof(TD_InvActionCell[]))
									PlayerTextDrawShow(playerid, TD_InvActionCell[playerid][t]);

								PlayerTextDrawBackgroundColour(playerid, TD_InvCellItem[playerid][i], 0x303030BB);
								PlayerTextDrawShow(playerid, TD_InvCellItem[playerid][i]);
							}
							else 
								HideSelectedCell(playerid);
						}
					}
					else {
						if(pInfo[playerid][pInvItem][c] > 0) {
							inv_PlayerTDInfo[playerid][INV_ChooseTab] = inv_PlayerTDInfo[playerid][INV_ActiveTab];
							inv_PlayerTDInfo[playerid][INV_ActiveCell] = pInfo[playerid][pInvItem][c];
							inv_PlayerTDInfo[playerid][INV_ActiveCellCount] = pInfo[playerid][pInvItemCount][c];
							inv_PlayerTDInfo[playerid][INV_ActiveCellItem] = c;
							inv_PlayerTDInfo[playerid][INV_ActiveChooseTab] = i;
							inv_PlayerTDInfo[playerid][INV_ActiveTD] = i;
							ShowTDActionCell(playerid, i);

							n_for2(t, sizeof(TD_InvActionCell[]))
								PlayerTextDrawShow(playerid, TD_InvActionCell[playerid][t]);

							PlayerTextDrawBackgroundColour(playerid, TD_InvCellItem[playerid][i], 0x303030BB);
							PlayerTextDrawShow(playerid, TD_InvCellItem[playerid][i]);
						}
					}
				}
				c++;
			}
		}
		// Баннеры
		else if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 2) {
			// Баннер
			if(playertextid == TD_InvBase[playerid][19]) {
				new
					cellitem = inv_PlayerTDInfo[playerid][INV_ActiveCellItem],
					using_item = inv_PlayerItemInfo[playerid][IN_Banner];

				if(cellitem > -1) {
					if(using_item == pInfo[playerid][pInvBanner][cellitem]) 
						return 1;
					
					if(pInfo[playerid][pInvBannerCount][cellitem] > 1) {
						if(using_item != INITIAL_PLAYER_BANNER) {
							if(!Inv_CheckPlayerFullBanner(playerid, using_item, 1)) {
								SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
								return 1;
							}
							Inv_SetPlayerBanner(playerid, using_item, 1);
						}
						inv_PlayerItemInfo[playerid][IN_Banner] = pInfo[playerid][pInvBanner][cellitem];

						using_item = pInfo[playerid][pInvBanner][cellitem];
						pInfo[playerid][pInvBannerCount][cellitem]--;
					}
					else {
						new
							item = pInfo[playerid][pInvBanner][cellitem];

						inv_PlayerItemInfo[playerid][IN_Banner] = item;

						if(using_item != INITIAL_PLAYER_BANNER) 
							pInfo[playerid][pInvBanner][cellitem] = using_item;
						
						if(using_item == INITIAL_PLAYER_BANNER) {
							pInfo[playerid][pInvBanner][cellitem] = 0;
							pInfo[playerid][pInvBannerCount][cellitem] = 0;
						}
						using_item = item;
					}

					new
						itemtd_id, 
						tab_list;

					CheckBannerOnTDPlayerInventory(cellitem, itemtd_id, tab_list);
					UpdatePlayerTDInventory(playerid, 2, tab_list, cellitem, itemtd_id);

					HideSelectedCell(playerid);
					Inv_SavePlayer(playerid);
				}
				else {
					if(using_item != INITIAL_PLAYER_BANNER) {
						if(!Inv_CheckPlayerFullBanner(playerid, using_item, 1)) {
							SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Недостаточно места в инвентаре!");
							return 1;
						}
						Inv_SetPlayerBanner(playerid, using_item, 1);
						inv_PlayerItemInfo[playerid][IN_Banner] = INITIAL_PLAYER_BANNER;
						using_item = INITIAL_PLAYER_BANNER;
						Inv_SavePlayer(playerid);
					}
				}
				PlayerTextDrawSetString(playerid, TD_InvBase[playerid][21], Inv_GetBannerModel(using_item));
				PlayerTextDrawShow(playerid, TD_InvBase[playerid][21]);
				return 1;
			}

			new
				c = 0;

			if(inv_PlayerTDInfo[playerid][INV_ActiveTab] > 0)
				c = INV_TD_MAX_BANNERS * inv_PlayerTDInfo[playerid][INV_ActiveTab];

			n_for(i, INV_TD_MAX_BANNERS) {
				if(playertextid == TD_InvCellBanner[playerid][i]) {
					new
						cellitem = inv_PlayerTDInfo[playerid][INV_ActiveCellItem];

					if(cellitem > -1) {
						if(cellitem != c) {
							if(pInfo[playerid][pInvBanner][c] == pInfo[playerid][pInvBanner][cellitem] && (pInfo[playerid][pInvBannerCount][c] < inv_BannerInfo[pInfo[playerid][pInvBanner][c]][BN_Max])) {
								if((pInfo[playerid][pInvBannerCount][c] + pInfo[playerid][pInvBannerCount][cellitem]) > inv_BannerInfo[pInfo[playerid][pInvBanner][c]][BN_Max]) {
									pInfo[playerid][pInvBannerCount][cellitem] = (pInfo[playerid][pInvBannerCount][c] + pInfo[playerid][pInvBannerCount][cellitem]) - inv_BannerInfo[pInfo[playerid][pInvBanner][c]][BN_Max];
									pInfo[playerid][pInvBannerCount][c] = inv_BannerInfo[pInfo[playerid][pInvBanner][c]][BN_Max];
								}
								else {
									pInfo[playerid][pInvBannerCount][c] = pInfo[playerid][pInvBannerCount][c] + pInfo[playerid][pInvBannerCount][cellitem];
									pInfo[playerid][pInvBanner][cellitem] =
									pInfo[playerid][pInvBannerCount][cellitem] = 0;
								}
							}
							else {
								if(pInfo[playerid][pInvBanner][c] > 0) {
									pInfo[playerid][pInvBanner][cellitem] = pInfo[playerid][pInvBanner][c];
									pInfo[playerid][pInvBannerCount][cellitem] = pInfo[playerid][pInvBannerCount][c];
									pInfo[playerid][pInvBanner][c] = inv_PlayerTDInfo[playerid][INV_ActiveCell];
									pInfo[playerid][pInvBannerCount][c] = inv_PlayerTDInfo[playerid][INV_ActiveCellCount];
								}
								else {
									pInfo[playerid][pInvBanner][c] = inv_PlayerTDInfo[playerid][INV_ActiveCell];
									pInfo[playerid][pInvBannerCount][c] = inv_PlayerTDInfo[playerid][INV_ActiveCellCount];
									pInfo[playerid][pInvBanner][cellitem] =
									pInfo[playerid][pInvBannerCount][cellitem] = 0;
								}
							}
							if(inv_PlayerTDInfo[playerid][INV_ChooseTab] != inv_PlayerTDInfo[playerid][INV_ActiveTab]) 
								UpdateTDCellInv(playerid, c, i);
							else 
								UpdateTDCellInv(playerid, c, i, cellitem, inv_PlayerTDInfo[playerid][INV_ActiveTD]);

							HideSelectedCell(playerid);
							Inv_SavePlayer(playerid);
						}
						else {
							if(inv_PlayerTDInfo[playerid][INV_ActiveChooseTab] == -1) {
								inv_PlayerTDInfo[playerid][INV_ChooseTab] = inv_PlayerTDInfo[playerid][INV_ActiveTab];
								inv_PlayerTDInfo[playerid][INV_ActiveTD] = i;
								inv_PlayerTDInfo[playerid][INV_ActiveChooseTab] = i;
								ShowTDActionCell(playerid, i);

								n_for2(t, sizeof(TD_InvActionCell[]))
									PlayerTextDrawShow(playerid, TD_InvActionCell[playerid][t]);

								PlayerTextDrawBackgroundColour(playerid, TD_InvCellBanner[playerid][i], 0x303030BB);
								PlayerTextDrawShow(playerid, TD_InvCellBanner[playerid][i]);
							}
							else 
								HideSelectedCell(playerid);
						}
					}
					else {
						if(pInfo[playerid][pInvBanner][c] > 0) {
							inv_PlayerTDInfo[playerid][INV_ChooseTab] = inv_PlayerTDInfo[playerid][INV_ActiveTab];
							inv_PlayerTDInfo[playerid][INV_ActiveCell] = pInfo[playerid][pInvBanner][c];
							inv_PlayerTDInfo[playerid][INV_ActiveCellCount] = pInfo[playerid][pInvBannerCount][c];
							inv_PlayerTDInfo[playerid][INV_ActiveCellItem] = c;
							inv_PlayerTDInfo[playerid][INV_ActiveChooseTab] = i;
							inv_PlayerTDInfo[playerid][INV_ActiveTD] = i;
							ShowTDActionCell(playerid, i);

							n_for2(t, sizeof(TD_InvActionCell[]))
								PlayerTextDrawShow(playerid, TD_InvActionCell[playerid][t]);

							PlayerTextDrawBackgroundColour(playerid, TD_InvCellBanner[playerid][i], 0x303030BB);
							PlayerTextDrawShow(playerid, TD_InvCellBanner[playerid][i]);
						}
					}
				}
				c++;
			}
		}
	}
	return 1;
}

InterfaceClick:Inventory(playerid, Text:clickedid)
{
	if(clickedid == INVALID_TEXT_DRAW) {
		Interface_Close(playerid, Interface:Inventory);
		Interface_Show(playerid, Interface:MainMenu);
		SelectTextDraw(playerid, TD_CLICK_COLOR_GREY);
	}
	return 1;
}

InterfaceCreate:Cases(playerid)
{
	ShowTDOpenPlayerCase(playerid);

	n_for(i, sizeof(TD_OpenCase[]))
		PlayerTextDrawShow(playerid, TD_OpenCase[playerid][i]);

	return 1;
}

InterfaceClose:Cases(playerid)
{
	n_for(i, sizeof(TD_OpeningCase[]))
		DestroyPlayerTD(playerid, TD_OpeningCase[playerid][i]);

	n_for(i, sizeof(TD_OpenCase[]))
		DestroyPlayerTD(playerid, TD_OpenCase[playerid][i]);

	return 1;
}

InterfacePlayerClick:Cases(playerid, PlayerText:playertextid)
{
	if(playertextid == TD_OpenCase[playerid][0]) {
		n_for(i, sizeof(TD_OpenCase[]))
			DestroyPlayerTD(playerid, TD_OpenCase[playerid][i]);
		
		ResetPlayerCase(playerid);
		
		SetRewardItemPlayerCase(playerid, GetPVarInt(playerid, "CaseType_PVar"));
		ShowTDOpeningPlayerCase(playerid);
		ShowTDRewardItemPlayerCase(playerid, 0);

		n_for(i, sizeof(TD_OpeningCase[]))
			PlayerTextDrawShow(playerid, TD_OpeningCase[playerid][i]);
		
		PlayerPlaySoundEx(playerid, 32201, 0.0, 0.0, 0.0);
		return 1;
	}
	if(playertextid == TD_OpeningCase[playerid][2]) {
		ShowTDRewardItemPlayerCase(playerid, 1);
		return 1;
	}
	else if(playertextid == TD_OpeningCase[playerid][3]) {
		Interface_Close(playerid, Interface:Cases);

		StartPlayerBackCameraCase(playerid);
	}
	return 1;
}

InterfaceClick:Cases(playerid, Text:clickedid)
{
	if(clickedid == INVALID_TEXT_DRAW) {
		n_for(i, sizeof(TD_OpenCase[]))
			PlayerTextDrawShow(playerid, TD_OpenCase[playerid][i]);

		SelectTextDraw(playerid, TD_CLICK_COLOR_GREY);
	}
	return 1;
}

/*

	* Dialogs *

*/

DialogCreate:InventoryTransfer(playerid)
{
	if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 1)
		Dialog_Open(playerid, Dialog:InventoryTransfer, DSI, "Передача предмета", "{FFFFFF}Введите ID игрока, которому передадите предмет.", "Ввод", "Выйти");
	else if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 2)
		Dialog_Open(playerid, Dialog:InventoryTransfer, DSI, "Передача баннера", "{FFFFFF}Введите ID игрока, которому передадите баннер.", "Ввод", "Выйти");

	return 1;
}

DialogResponse:InventoryTransfer(playerid, response, listitem, inputtext[])
{
	if(response) {
		if(!strlen(inputtext)) 
			return Dialog_Show(playerid, Dialog:InventoryTransfer);
		
		for(new i = strlen(inputtext)-1; i != -1; i--) {
			switch(inputtext[i]) {
				case '0'..'9': continue;
				default: {
					Dialog_Show(playerid, Dialog:InventoryTransfer);

					SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Доступны только цифры!");
					return 1;
				}
			}
		}
		if(!IsPlayerOnServer(strval(inputtext))) {
			Dialog_Show(playerid, Dialog:InventoryTransfer);

			SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Данного игрока нет на сервере!");
			return 1;
		}
		if(strval(inputtext) == playerid) 
			return Dialog_Show(playerid, Dialog:InventoryTransfer);

		new
			cellitem = inv_PlayerTDInfo[playerid][INV_ActiveCellItem];

		if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 1) { // Предметы
			if(pInfo[playerid][pInvItemCount][cellitem] > 1 
			&& pInfo[playerid][pInvItem][cellitem] != 312
			&& pInfo[playerid][pInvItem][cellitem] != 313
			&& pInfo[playerid][pInvItem][cellitem] != 314) {
				SetPVarInt(playerid, "Item_PlayerID_PVar", strval(inputtext));
				Dialog_Show(playerid, Dialog:InventoryTransferCount);
			}
			else {
				if(!Inv_CheckPlayerFullItem(strval(inputtext), pInfo[playerid][pInvItem][cellitem], 1)) {
					Dialog_Message(playerid, "Передача предмета", "{CC0033}Ошибка: у данного игрока недостаточно места в инвентаре.", "Хорошо");
					inv_PlayerTDInfo[playerid][INV_ActiveSelectCell] = true;
					return 1;
				}
				Inv_SetPlayerItem(strval(inputtext), pInfo[playerid][pInvItem][cellitem], pInfo[playerid][pInvItemCount][cellitem]);

				static 
					str[65 - 4 + 1 + MAX_PLAYER_NAME + INV_MAX_ITEM_NAME_LENGTH];

				str[0] = EOS;

				f(str, "{b6c71c}Игрок %s передал Вам предмет %s в кол-ве 1", NameEx(playerid), inv_ItemInfo[pInfo[playerid][pInvItem][cellitem]][IT_Name]);
				SCM(strval(inputtext), -1, str);
				str[0] = EOS;

				f(str, "{b6c71c}Игроку %s успешно передан предмет %s в кол-ве 1", NameEx(strval(inputtext)), inv_ItemInfo[pInfo[playerid][pInvItem][cellitem]][IT_Name]);
				SCM(playerid, -1, str);

				pInfo[playerid][pInvItem][cellitem] = 0;
				pInfo[playerid][pInvItemCount][cellitem] = 0;

				new
					itemtd_id, 
					tab_list;

				CheckItemOnTDPlayerInventory(cellitem, itemtd_id, tab_list);
				UpdatePlayerTDInventory(playerid, 1, tab_list, cellitem, inv_PlayerTDInfo[playerid][INV_ActiveTD]);
				
				Inv_SavePlayer(playerid), Inv_SavePlayer(strval(inputtext));
				inv_PlayerTDInfo[playerid][INV_ActiveSelectCell] = true;
				HideSelectedCell(playerid);
			}
		}
		else if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 2) { // Баннеры
			if(pInfo[playerid][pInvBannerCount][cellitem] > 1) {
				SetPVarInt(playerid, "Item_PlayerID_PVar", strval(inputtext));
				Dialog_Show(playerid, Dialog:InventoryTransferCount);
			}
			else {
				if(!Inv_CheckPlayerFullBanner(strval(inputtext), pInfo[playerid][pInvBanner][cellitem], 1)) {
					Dialog_Message(playerid, "Передача баннера", "{CC0033}Ошибка: у данного игрока недостаточно места в инвентаре.", "Хорошо");
					inv_PlayerTDInfo[playerid][INV_ActiveSelectCell] = true;
					return 1;
				}
				Inv_SetPlayerBanner(strval(inputtext), pInfo[playerid][pInvBanner][cellitem], 1);

				static 
					str[68 - 4 + 1 + 3 + MAX_PLAYER_NAME + INV_MAX_ITEM_NAME_LENGTH];

				str[0] = EOS;

				f(str, "{b6c71c}Игрок %s передал Вам баннер %s в кол-ве 1", NameEx(playerid), inv_BannerInfo[pInfo[playerid][pInvBanner][cellitem]][BN_Name]);
				SCM(strval(inputtext), -1, str);
				str[0] = EOS;

				f(str, "{b6c71c}Игроку %s успешно передан баннер %s в кол-ве 1", NameEx(strval(inputtext)), inv_BannerInfo[pInfo[playerid][pInvBanner][cellitem]][BN_Name]);
				SCM(playerid, -1, str);

				pInfo[playerid][pInvBanner][cellitem] = 0;
				pInfo[playerid][pInvBannerCount][cellitem] = 0;

				new
					itemtd_id, 
					tab_list;

				CheckBannerOnTDPlayerInventory(cellitem, itemtd_id, tab_list);
				UpdatePlayerTDInventory(playerid, 2, tab_list, cellitem, inv_PlayerTDInfo[playerid][INV_ActiveTD]);
				
				Inv_SavePlayer(playerid), Inv_SavePlayer(strval(inputtext));
				inv_PlayerTDInfo[playerid][INV_ActiveSelectCell] = true;
				HideSelectedCell(playerid);
			}
		}
	}
	else
		inv_PlayerTDInfo[playerid][INV_ActiveSelectCell] = true;
	
	return 1;
}

DialogCreate:InventoryTransferCount(playerid)
{
	if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 1)
		Dialog_Open(playerid, Dialog:InventoryTransferCount, DSI, "Передача предмета", "{FFFFFF}Введите количество передаваемого предмета.", "Ввод", "Выйти");
	else if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 2)
		Dialog_Open(playerid, Dialog:InventoryTransferCount, DSI, "Передача баннера", "{FFFFFF}Введите количество передаваемого баннера.", "Ввод", "Выйти");

	return 1;
}

DialogResponse:InventoryTransferCount(playerid, response, listitem, inputtext[])
{
	if(response) {
		if(!strlen(inputtext)) 
			return Dialog_Show(playerid, Dialog:InventoryTransferCount);
		
		for(new i = strlen(inputtext)-1; i != -1; i--) {
			switch(inputtext[i]) {
				case '0'..'9': continue;
				default: {
					Dialog_Show(playerid, Dialog:InventoryTransferCount);
					SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Доступны только цифры!");
					return 1;
				}
			}
		}
		new
			cellitem = inv_PlayerTDInfo[playerid][INV_ActiveCellItem];

		if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 1) { // Предметы
			if(strval(inputtext) > pInfo[playerid][pInvItemCount][cellitem] || strval(inputtext) < 1) {
				Dialog_Show(playerid, Dialog:InventoryTransferCount);
				SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Количество должно быть от 1 и не больше имеющего количества!");
				return 1;
			}

			new
				item_playerid = GetPVarInt(playerid, "Item_PlayerID_PVar"),
				amount = strval(inputtext);

			if(!Inv_CheckPlayerFullItem(item_playerid, pInfo[playerid][pInvItem][cellitem], amount)) {
				Dialog_Message(playerid, "Передача предмета", "{CC0033}Ошибка: у данного игрока недостаточно места в инвентаре.", "Хорошо");
				inv_PlayerTDInfo[playerid][INV_ActiveSelectCell] = true;
				return 1;
			}
			Inv_SetPlayerItem(item_playerid, pInfo[playerid][pInvItem][cellitem], amount);
			pInfo[playerid][pInvItemCount][cellitem] -= amount;

			static
				str[68 - 4 + 1 + 3 + MAX_PLAYER_NAME + INV_MAX_ITEM_NAME_LENGTH];

			str[0] = EOS;

			f(str, "{b6c71c}Игрок %s передал Вам предмет %s в кол-ве %i", NameEx(playerid), inv_ItemInfo[pInfo[playerid][pInvItem][cellitem]][IT_Name], amount);
			SCM(item_playerid, -1, str);
			str[0] = EOS;

			f(str, "{b6c71c}Игроку %s успешно передан предмет %s в кол-ве %i", NameEx(item_playerid), inv_ItemInfo[pInfo[playerid][pInvItem][cellitem]][IT_Name], amount);
			SCM(playerid, -1, str);

			if(pInfo[playerid][pInvItemCount][cellitem] == 0) {
				pInfo[playerid][pInvItem][cellitem] = 0;
				HideSelectedCell(playerid);
			}

			new
				itemtd_id,
				tab_list;

			CheckItemOnTDPlayerInventory(cellitem, itemtd_id, tab_list);
			UpdatePlayerTDInventory(playerid, 1, tab_list, cellitem, inv_PlayerTDInfo[playerid][INV_ActiveTD]);

			Inv_SavePlayer(playerid), Inv_SavePlayer(item_playerid);
			inv_PlayerTDInfo[playerid][INV_ActiveSelectCell] = true;
		}
		else if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 2) { // Баннеры
			if(strval(inputtext) > pInfo[playerid][pInvBannerCount][cellitem] || strval(inputtext) < 1) {
				Dialog_Show(playerid, Dialog:InventoryTransferCount);
				SCM(playerid, COLOR_ERROR, "(Ошибка) {FFFFFF}Количество должно быть от 1 и не больше имеющего количества!");
				return 1;
			}

			new
				item_playerid = GetPVarInt(playerid, "Item_PlayerID_PVar"),
				amount = strval(inputtext);

			if(!Inv_CheckPlayerFullBanner(item_playerid, pInfo[playerid][pInvBanner][cellitem], amount)) {
				Dialog_Message(playerid, "Передача баннера", "{CC0033}Ошибка: у данного игрока недостаточно места в инвентаре.", "Хорошо");
				inv_PlayerTDInfo[playerid][INV_ActiveSelectCell] = true;
				return 1;
			}
			Inv_SetPlayerBanner(item_playerid, pInfo[playerid][pInvBanner][cellitem], amount);
			pInfo[playerid][pInvBannerCount][cellitem] -= amount;

			static 
				str[68 - 4 + 1 + 3 + MAX_PLAYER_NAME + INV_MAX_ITEM_NAME_LENGTH];

			str[0] = EOS;

			f(str, "{b6c71c}Игрок %s передал Вам баннера %s в кол-ве %i", NameEx(playerid), inv_BannerInfo[pInfo[playerid][pInvBanner][cellitem]][BN_Name], amount);
			SCM(item_playerid, -1, str);
			str[0] = EOS;

			f(str, "{b6c71c}Игроку %s успешно передан баннер %s в кол-ве %i", NameEx(item_playerid), inv_BannerInfo[pInfo[playerid][pInvBanner][cellitem]][BN_Name], amount);
			SCM(playerid, -1, str);

			if(pInfo[playerid][pInvBannerCount][cellitem] == 0) {
				pInfo[playerid][pInvBanner][cellitem] = 0;
				HideSelectedCell(playerid);
			}

			new
				itemtd_id,
				tab_list;

			CheckBannerOnTDPlayerInventory(cellitem, itemtd_id, tab_list);
			UpdatePlayerTDInventory(playerid, 2, tab_list, cellitem, inv_PlayerTDInfo[playerid][INV_ActiveTD]);

			Inv_SavePlayer(playerid), Inv_SavePlayer(item_playerid);
			inv_PlayerTDInfo[playerid][INV_ActiveSelectCell] = true;
		}
	}
	else
		inv_PlayerTDInfo[playerid][INV_ActiveSelectCell] = true;
	
	return 1;
}

DialogCreate:InventoryInfoItem(playerid)
{
	static
		str[62 - 4 + 1 + INV_MAX_ITEM_NAME_LENGTH + INV_MAX_ITEM_INFO_LENGTH];

	str[0] = EOS;

	new
		cellitem = inv_PlayerTDInfo[playerid][INV_ActiveCellItem];

	switch(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems]) {
		// Предметы
		case 1: {
			f(str, "{FFFFFF}Предмет: {d9b918}%s\n\n{CCCCCC}Информация:\n{FFFFFF}%s", inv_ItemInfo[pInfo[playerid][pInvItem][cellitem]][IT_Name], inv_ItemInfo[pInfo[playerid][pInvItem][cellitem]][IT_Info]);
			Dialog_Open(playerid, Dialog:InventoryInfoItem, DSM, "Информация о предмете", str, "Хорошо", "");
		}
		// Баннеры
		case 2: {
			f(str, "{FFFFFF}Баннер: {d9b918}%s\n\n{CCCCCC}Информация:\n{FFFFFF}%s", inv_BannerInfo[pInfo[playerid][pInvBanner][cellitem]][BN_Name], inv_BannerInfo[pInfo[playerid][pInvBanner][cellitem]][BN_Info]);
			Dialog_Open(playerid, Dialog:InventoryInfoItem, DSM, "Информация о баннере", str, "Хорошо", "");
		}
	}
	inv_PlayerTDInfo[playerid][INV_ActiveSelectCell] = false;
	return 1;
}

DialogResponse:InventoryInfoItem(playerid, response, listitem, inputtext[])
{
	inv_PlayerTDInfo[playerid][INV_ActiveSelectCell] = true;
	return 1;
}

DialogCreate:InventoryDropItem(playerid)
{
	static
		str[74 - 2 + 1 + INV_MAX_ITEM_NAME_LENGTH];

	str[0] = EOS;

	new
		cellitem = inv_PlayerTDInfo[playerid][INV_ActiveCellItem];

	switch(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems]) {
		// Предметы
		case 1: {
			f(str, "{FFFFFF}Вы точно хотите выкинуть предмет {d9b918}%s{FFFFFF}?", inv_ItemInfo[pInfo[playerid][pInvItem][cellitem]][IT_Name]);
			Dialog_Open(playerid, Dialog:InventoryDropItem, DSM, "Выкинуть предмет", str, "Да", "Нет");
		}
		// Баннеры
		case 2: {
			f(str, "{FFFFFF}Вы точно хотите выкинуть баннер {d9b918}%s{FFFFFF}?", inv_BannerInfo[pInfo[playerid][pInvBanner][cellitem]][BN_Name]);
			Dialog_Open(playerid, Dialog:InventoryDropItem, DSM, "Выкинуть баннер", str, "Да", "Нет");
		}
	}
	inv_PlayerTDInfo[playerid][INV_ActiveSelectCell] = false;
	return 1;
}

DialogResponse:InventoryDropItem(playerid, response, listitem, inputtext[])
{
	if(response) {
		new
			cellitem = inv_PlayerTDInfo[playerid][INV_ActiveCellItem];

		if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 1) { // Предметы
			pInfo[playerid][pInvItem][cellitem] = 0;
			pInfo[playerid][pInvItemCount][cellitem] = 0;
			Inv_SavePlayer(playerid);

			new
				itemtd_id, 
				tab_list;

			CheckItemOnTDPlayerInventory(cellitem, itemtd_id, tab_list);
			UpdatePlayerTDInventory(playerid, 1, tab_list, cellitem, inv_PlayerTDInfo[playerid][INV_ActiveTD]);
		}
		else if(inv_PlayerTDInfo[playerid][INV_ActiveTypeItems] == 2) { // Баннеры
			pInfo[playerid][pInvBanner][cellitem] = 0;
			pInfo[playerid][pInvBannerCount][cellitem] = 0;
			Inv_SavePlayer(playerid);

			new
				itemtd_id, 
				tab_list;

			CheckBannerOnTDPlayerInventory(cellitem, itemtd_id, tab_list);
			UpdatePlayerTDInventory(playerid, 2, tab_list, cellitem, inv_PlayerTDInfo[playerid][INV_ActiveTD]);
		}

		HideSelectedCell(playerid);
	}

	inv_PlayerTDInfo[playerid][INV_ActiveSelectCell] = true;
	return 1;
}

/*

	* Attach items *

*/

static SetAttachToPlayerSkin(playerid, item_id, type)
{
	new
		skin = GetPlayerSkinEx(playerid),
		object_id = inv_ItemInfo[item_id][IT_Model];

	switch(Inv_CheckItemDestination(item_id)) {
		case INV_PLAYER_DEST_HEAD: {
			switch(type) {
				case 1: {
					switch(skin) {
						case 0: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.111999, 0.000000, 0.000000, 0.000000, 0.000000, 0.000000, 1.000000, 1.000000, 1.000000);
						case 1: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.111999, 0.000000, 0.000000, 0.000000, 0.000000, 0.000000, 1.000000, 1.000000, 1.000000);
						case 2: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123999, 0.004000, 0.000000, 0.000000, 0.000000, 0.000000, 1.062999, 1.066000, 1.179999);
						case 3: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123999, 0.004000, 0.000000, 0.000000, 0.000000, 0.000000, 1.062999, 1.066000, 1.179999);
						case 4: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130999, 0.001000, 0.000000, 0.799999, -2.399996, -15.599999, 1.100999, 1.064999, 1.187000);
						case 5: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130999, 0.001000, 0.000000, 0.799999, -2.399996, -15.599999, 1.100999, 1.064999, 1.187000);
						case 6: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122999, 0.001000, 0.000000, 1.100000, -2.599996, -4.699995, 1.048999, 1.035000, 1.120000);
						case 7: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122999, 0.001000, 0.000000, 1.100000, -2.599996, -4.699995, 1.048999, 1.035000, 1.120000);
						case 8: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122999, 0.001000, 0.000000, 1.100000, -2.599996, -4.699995, 1.048999, 1.035000, 1.120000);
						case 9: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122999, 0.001000, 0.000000, 1.100000, -2.599996, -4.699995, 1.048999, 1.035000, 1.120000);
						case 10: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122999, 0.001000, 0.000000, 1.100000, -2.599996, -4.699995, 1.048999, 1.035000, 1.120000);
						case 11: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122999, 0.001000, 0.000000, 1.100000, -2.599996, -4.699995, 1.048999, 1.035000, 1.120000);
						case 12: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122999, 0.001000, 0.000000, 1.100000, -2.599996, -4.699995, 1.048999, 1.035000, 1.120000);
						case 13: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112999, 0.001000, -0.001999, 1.100000, -3.699995, -4.299999, 1.048999, 1.036000, 1.158000);
						case 14: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112999, 0.011000, 0.005000, 1.100000, -3.699995, -9.500000, 1.048999, 1.036000, 1.158000);
						case 15: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.086999, -0.020999, 0.005000, 1.100000, -3.699995, -9.500000, 1.048999, 1.036000, 1.158000);
						case 16: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117999, 0.000000, 0.005000, 1.100000, -3.699995, -9.500000, 1.085000, 1.036000, 1.243000);
						case 17: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117999, 0.000000, 0.005000, 1.100000, -3.699995, -9.500000, 1.082000, 1.003999, 1.209000);
						case 18: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.083999, 0.008000, 0.005000, 1.100000, -3.699995, -9.500000, 1.036000, 0.982000, 1.102000);
						case 19: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.120999, -0.010999, 0.005000, 1.100000, -3.699995, -9.500000, 1.067000, 1.002000, 1.224000);
						case 20: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.120999, -0.010999, 0.005000, 1.100000, -3.699995, -9.500000, 1.067000, 1.002000, 1.224000);
						case 21: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.120999, -0.010999, 0.004000, 1.100000, -3.699995, -9.500000, 1.067000, 1.002000, 1.224000);
						case 22: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131999, 0.016000, 0.004000, 1.100000, -3.699995, -9.500000, 1.067000, 1.050000, 1.224000);
						case 23: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123999, 0.000000, -0.001999, 1.100000, -3.699995, -9.500000, 1.067000, 1.021000, 1.164000);
						case 24: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.099999, 0.000000, 0.006000, 1.100000, -3.699995, -9.500000, 1.067000, 1.021000, 1.164000);
						case 25: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.099999, 0.000000, 0.006000, 1.100000, -3.699995, -9.500000, 1.067000, 1.021000, 1.164000);
						case 26: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.107000, 0.006000, 0.005000, 1.100000, -3.699995, -9.500000, 1.067000, 1.102000, 1.164000);
						case 27: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130000, 0.006000, 0.005000, 1.100000, -3.699995, -9.500000, 1.275999, 1.204000, 1.164000);
						case 28: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130000, 0.006000, 0.005000, 1.100000, -3.699995, -9.500000, 1.275999, 1.204000, 1.164000);
						case 29: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130000, -0.051999, 0.005000, 1.100000, -2.799995, -18.600000, 1.308999, 1.204000, 1.331000);
						case 30: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.095000, 0.011000, 0.001000, 1.100000, -2.799995, -18.600000, 1.171999, 1.204000, 1.207000);
						case 32: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.089999, -0.016000, 0.000000, 0.000000, 0.000000, -9.800001, 0.939000, 0.990000, 1.000000);
						case 33: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.089999, -0.016000, 0.000000, 0.000000, 0.000000, -9.800001, 0.939000, 0.990000, 1.000000);
						case 34: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141999, 0.005999, 0.000000, 0.000000, 0.000000, -9.800001, 0.939000, 0.990000, 1.000000);
						case 35: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140999, 0.005999, 0.000000, 0.000000, 0.000000, 1.099997, 0.939000, 0.990000, 1.000000);
						case 36: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140999, 0.005999, 0.000000, 0.000000, 0.000000, 1.099997, 0.939000, 0.990000, 1.000000);
						case 37: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140999, 0.005999, 0.000000, 0.000000, 0.000000, 1.099997, 0.939000, 0.990000, 1.000000);
						case 38: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140999, 0.005999, 0.000000, 0.000000, 0.000000, 1.099997, 0.939000, 0.990000, 1.000000);
						case 39: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.098999, 0.005999, 0.000000, 0.000000, 0.000000, 1.099997, 0.939000, 0.990000, 1.000000);
						case 40: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.098999, -0.005000, 0.000000, 0.000000, 0.000000, 1.099997, 0.939000, 1.109000, 1.000000);
						case 41: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127999, -0.005000, 0.000000, 0.000000, 0.000000, -11.600003, 0.939000, 1.109000, 1.000000);
						case 42: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127999, -0.005000, 0.000000, 0.000000, 0.000000, -11.600003, 0.939000, 1.109000, 1.000000);
						case 43: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.066999, -0.005000, 0.004000, 0.000000, 0.000000, -11.600003, 0.963000, 1.109000, 1.039999);
						case 44: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.081999, -0.005000, 0.004000, 0.000000, 0.000000, -11.600003, 0.963000, 1.109000, 1.039999);
						case 45: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.081999, -0.005000, 0.004000, 0.000000, 0.000000, -11.600003, 0.963000, 1.109000, 1.039999);
						case 46: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122999, 0.012000, 0.004000, 0.000000, 0.000000, -11.600003, 0.963000, 1.109000, 1.039999);
						case 47: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118999, 0.002000, 0.004000, 0.000000, 0.000000, -11.600003, 0.963000, 1.109000, 1.039999);
						case 48: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115999, -0.008999, -0.001999, 0.000000, 0.000000, -11.600003, 0.963000, 1.109000, 1.164000);
						case 49..170: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116999, -0.008999, -0.002999, 0.000000, 0.000000, -11.600003, 0.963000, 1.082000, 1.201000);
						case 171..299: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115999, -0.008999, -0.001999, 0.000000, 0.000000, -11.600003, 0.963000, 1.109000, 1.164000);
						case 300..311: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115999, -0.008999, -0.001999, 0.000000, 0.000000, -11.600003, 0.963000, 1.029000, 1.040000);
						default: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115999, -0.008999, -0.001999, 0.000000, 0.000000, -11.600003, 0.963000, 1.029000, 1.040000);
					}
				}
				case 2: {
					switch(skin) {
						case 0..311: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.186000, 0.000000, 0.000000, 0.000000, 0.000000, 0.000000, 1.173000, 1.061000, 1.189999);
						default: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.186000, 0.000000, 0.000000, 0.000000, 0.000000, 0.000000, 1.173000, 1.061000, 1.189999);
					}
				}
				case 3: {
					switch(skin) {
						case 0..20: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149999, 0.040999, 0.001000, 0.499999, 84.999992, 84.400001, 1.120000, 1.135000, 1.096000);
						case 21..48: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149999, 0.049999, 0.007000, 0.499999, 84.999992, 84.400001, 1.120000, 1.168000, 1.096000);
						case 49..170: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146999, 0.036999, 0.003000, 0.499999, 84.999992, 84.400001, 1.120000, 1.168000, 1.096000);
						case 171..299: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144999, 0.039999, -0.002999, 0.499999, 84.999992, 84.400001, 1.172000, 1.269000, 1.096000);
						case 300..311: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144999, 0.039999, 0.001000, 0.499999, 84.999992, 84.400001, 1.052000, 1.099000, 1.000000);
						default: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144999, 0.039999, 0.001000, 0.499999, 84.999992, 84.400001, 1.052000, 1.099000, 1.000000);
					}
				}
				case 4: {
					switch(skin) {
						case 1..20: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.105999, 0.000000, 0.000000, 0.000000, 0.100000, -5.300001, 0.956000, 1.066999, 1.134999);
						case 21..48: SetPlayerAttachedObject(playerid, 0, object_id, 2,  0.304999, -0.142000, 0.000000,  0.000000, 87.700035, 89.600059,  0.477000, 0.501999, 0.440999);
						case 49..170: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.089999, -0.003999, 0.000000, 0.000000, 0.100000, -13.900003, 0.956000, 1.066999, 1.261999);
						case 171..299: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.089999, -0.003999, 0.000000, 0.000000, 0.100000, -13.900003, 0.956000, 1.066999, 1.261999);
						case 300..311: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.083999, 0.008000, 0.000000, 0.000000, 0.100000, -13.900003, 0.868000, 0.957999, 1.130999);
						default: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.083999, 0.008000, 0.000000, 0.000000, 0.100000, -13.900003, 0.868000, 0.957999, 1.130999);
					}
				}
				case 5: {
					switch(skin) {
						case 1: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.016000,-0.002001, 0.000000,90.000000,89.900016, 1.000000,1.000000,1.000000);
						case 3: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.016000,-0.002001, 0.000000,90.000000,89.900016, 1.217999,1.187000,1.000000);
						case 4: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,0.016000,-0.002001, 0.000000,90.000000,89.900016, 1.217999,1.187000,1.000000);
						case 5: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,0.016000,-0.002001, 0.000000,90.000000,89.900016, 1.217999,1.187000,1.000000);
						case 7: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.138998,0.016000,-0.002001, 0.000000,90.000000,89.900016, 1.217999,1.033000,1.000000);
						case 9: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112998,0.004999,0.000998, 0.000000,90.000000,95.899993, 1.000000,1.000000,1.000000);
						case 10: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.098997,0.000999,0.000998, 0.000000,90.000000,95.899993, 1.175000,1.000000,1.000000);
						case 11: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115997,0.006999,0.000998, 0.000000,90.000000,95.899993, 1.092000,1.000000,1.000000);
						case 12: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115997,-0.006000,0.000998, 0.000000,90.000000,95.899993, 1.137000,1.050999,1.000000);
						case 14: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127997,0.021999,0.001998, 0.000000,90.000000,95.899993, 1.137000,1.091999,1.000000);
						case 15: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.104998,-0.013999,0.001998, 0.000000,90.000000,95.899993, 1.137000,1.091999,1.000000);
						case 17: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123998,0.017000,0.001998, 0.000000,90.000000,95.899993, 1.137000,1.091999,1.000000);
						case 18: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123997,-0.000999,0.001998, 0.000000,90.000000,95.899993, 1.137000,1.091999,1.000000);
						case 20: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.138998,-0.000999,0.001998, 0.000000,90.000000,95.899993, 1.137000,1.091999,1.000000);
						case 21: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126997,-0.000999,0.001998, 0.000000,90.000000,95.899993, 1.137000,1.091999,1.000000);
						case 25: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126997,0.017000,0.001998, 0.000000,90.000000,95.899993, 0.987000,1.091999,0.866999);
						case 26: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126997,0.017000,0.001998, 0.000000,90.000000,95.899993, 1.122000,1.091999,0.866999);
						case 28: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136997,0.021000,0.001998, 0.000000,90.000000,95.899993, 1.181999,1.091999,0.866999);
						case 30: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130997,0.017000,-0.003001, 0.000000,90.000000,95.899993, 1.181999,1.091999,0.866999);
						case 39: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.104997,0.006000,-0.003001, 0.000000,90.000000,95.899993, 0.981000,1.091999,0.866999);
						case 40: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118997,0.006000,-0.003001, 0.000000,90.000000,95.899993, 0.981000,1.091999,0.866999);
						case 43: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.074997,0.006000,-0.003001, 0.000000,90.000000,95.899993, 0.981000,1.091999,0.866999);
						case 44: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.103997,0.027000,-0.003001, 0.000000,90.000000,95.899993, 0.981000,1.091999,0.866999);
						case 45: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.103997,0.009000,-0.003001, 0.000000,90.000000,95.899993, 1.071000,1.091999,0.866999);
						case 46: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129997,0.022000,-0.003001, 0.000000,90.000000,95.899993, 1.071000,1.091999,0.866999);
						case 47: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129997,0.022000,-0.003001, 0.000000,90.000000,95.899993, 1.125999,1.091999,0.866999);
						case 48: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147997,-0.002999,-0.003001, 0.000000,90.000000,95.899993, 1.125999,1.091999,0.866999);
						case 49: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.110997,0.024000,-0.003001, 0.000000,90.000000,95.899993, 0.964999,1.091999,0.866999);
						case 54: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127997,0.035999,-0.003001, 0.000000,90.000000,95.899993, 0.964999,1.091999,0.866999);
						case 55: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123998,-0.014000,-0.003001, 0.000000,90.000000,95.899993, 0.964999,1.091999,0.866999);
						case 56: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123998,-0.014000,-0.003001, 0.000000,90.000000,95.899993, 0.964999,1.091999,0.866999);
						case 57: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.158998,0.014999,-0.003001, 0.000000,90.000000,95.899993, 0.964999,1.091999,0.866999);
						case 58: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.106998,0.005999,-0.002001, 0.000000,90.000000,95.899993, 0.964999,1.091999,0.866999);
						case 59: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.145998,0.007999,-0.002001, 0.000000,90.000000,95.899993, 0.964999,1.091999,0.866999);
						case 60: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132998,0.002999,-0.002001, 0.000000,90.000000,95.899993, 0.964999,1.091999,0.866999);
						case 62: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132998,0.012999,0.008999, 0.000000,90.000000,95.899993, 0.964999,1.091999,0.866999);
						case 63: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,0.000999,0.004999, 0.000000,90.000000,95.899993, 1.104999,1.091999,0.866999);
						case 64: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.007999,0.004999, 0.000000,90.000000,95.899993, 1.104999,1.091999,0.866999);
						case 66: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126998,0.025999,0.004999, 0.000000,90.000000,95.899993, 1.104999,1.091999,0.866999);
						case 68: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126998,0.024999,0.004999, 0.000000,90.000000,95.899993, 0.958999,1.091999,0.866999);
						case 69: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126998,-0.004000,0.004999, 0.000000,90.000000,95.899993, 0.958999,1.091999,0.866999);
						case 70: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126998,0.019999,0.004999, 0.000000,90.000000,95.899993, 0.958999,1.091999,0.866999);
						case 72: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126998,0.005999,0.004999, 0.000000,90.000000,95.899993, 0.958999,1.091999,0.866999);
						case 75: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115997,0.015000,-0.000001, 0.000000,90.000000,95.400001, 1.151999,1.069000,1.000000);
						case 76: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115997,0.003000,-0.000001, 0.000000,90.000000,95.400001, 1.151999,1.069000,1.000000);
						case 82: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151998,0.034000,-0.000001, 0.000000,90.000000,95.400001, 1.151999,1.069000,1.000000);
						case 83: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151998,0.016000,-0.000001, 0.000000,90.000000,95.400001, 1.151999,1.069000,1.000000);
						case 84: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157998,0.016000,-0.000001, 0.000000,90.000000,95.400001, 1.151999,1.069000,1.000000);
						case 85: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157998,0.016000,-0.010001, 0.000000,90.000000,95.400001, 1.151999,1.240999,1.000000);
						case 86: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.101998,0.016000,-0.004000, 0.000000,90.000000,95.400001, 1.151999,1.048999,1.000000);
						case 88: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.101998,0.027000,-0.004000, 0.000000,90.000000,95.400001, 1.151999,1.048999,1.000000);
						case 89: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117998,0.007000,0.005999, 0.000000,90.000000,95.400001, 1.151999,1.048999,1.000000);
						case 90: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117998,0.007000,0.005999, 0.000000,90.000000,95.400001, 1.151999,1.048999,1.000000);
						case 91: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126998,-0.001999,0.005999, 0.000000,90.000000,95.400001, 1.151999,1.048999,1.000000);
						case 95: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.100998,-0.003999,0.005999, 0.000000,90.000000,95.400001, 0.967999,1.048999,1.000000);
						case 96: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128998,0.005000,0.005999, 0.000000,90.000000,95.400001, 0.967999,1.048999,1.000000);
						case 97: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.107998,-0.011999,0.005999, 0.000000,90.000000,95.400001, 0.967999,1.048999,1.000000);
						case 98: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122997,0.032000,0.005999, 0.000000,90.000000,95.400001, 1.117999,1.048999,1.000000);
						case 100: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131998,0.009000,0.005999, 0.000000,90.000000,95.400001, 1.117999,1.048999,1.000000);
						case 101: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.143998,0.009000,0.005999, 0.000000,90.000000,95.400001, 1.117999,1.048999,1.000000);
						case 102: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,0.002000,0.003999, 0.000000,90.000000,95.400001, 1.117999,1.048999,1.000000);
						case 103: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,0.002000,0.003999, 0.000000,90.000000,95.400001, 1.117999,1.048999,1.000000);
						case 105: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,0.002000,0.003999, 0.000000,90.000000,95.400001, 1.117999,1.048999,1.000000);
						case 106: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,0.002000,0.003999, 0.000000,90.000000,95.400001, 1.117999,1.048999,1.000000);
						case 111: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,0.002000,-0.002000, 0.000000,90.000000,95.400001, 0.980999,1.048999,1.000000);
						case 112: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.101997,0.002000,-0.002000, 0.000000,90.000000,95.400001, 0.980999,1.048999,1.000000);
						case 113: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.137997,0.002000,0.002999, 0.000000,90.000000,95.400001, 0.980999,1.048999,1.000000);
						case 117: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.114997,0.012000,0.003999, 0.000000,90.000000,95.400001, 0.980999,1.048999,1.000000);
						case 119: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117997,0.019000,-0.000001, 0.000000,90.000000,95.400001, 0.980999,1.048999,1.000000);
						case 120: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124997,0.004000,-0.000001, 0.000000,90.000000,95.400001, 0.980999,1.048999,1.000000);
						case 121: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124997,0.004000,-0.000001, 0.000000,90.000000,95.400001, 0.980999,1.147000,1.000000);
						case 122: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118997,0.010000,-0.000001, 0.000000,90.000000,95.400001, 0.980999,1.147000,1.000000);
						case 123: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136997,0.007000,-0.000001, 0.000000,90.000000,95.400001, 0.980999,1.147000,1.000000);
						case 124: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136997,0.007000,-0.000001, 0.000000,90.000000,95.400001, 0.980999,1.147000,1.000000);
						case 125: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129997,0.000000,-0.000001, 0.000000,90.000000,95.400001, 0.980999,1.147000,1.000000);
						case 126: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,-0.003999,0.000999, 0.000000,90.000000,95.400001, 1.009999,1.147000,1.000000);
						case 127: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,-0.003999,0.000999, 0.000000,90.000000,95.400001, 1.009999,1.147000,1.000000);
						case 128: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,0.026000,-0.010001, 0.000000,90.000000,95.400001, 1.009999,1.147000,1.000000);
						case 129: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.100998,0.016000,-0.004000, 0.000000,90.000000,95.400001, 1.009999,0.949999,1.000000);
						case 130: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.065998,0.019000,-0.001000, 0.000000,90.000000,95.400001, 1.009999,0.949999,1.000000);
						case 132: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.035998,0.005000,-0.001000, 0.000000,90.000000,95.400001, 1.009999,0.949999,1.000000);
						case 138: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128998,0.005000,-0.001000, 0.000000,90.000000,95.400001, 1.009999,0.949999,1.000000);
						case 144: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.173998,-0.007999,-0.001000, 0.000000,90.000000,95.400001, 1.009999,1.087000,1.000000);
						case 147: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118998,-0.001999,-0.001000, 0.000000,90.000000,95.400001, 1.009999,1.087000,1.000000);
						case 148: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118998,-0.001999,-0.001000, 0.000000,90.000000,95.400001, 1.009999,1.087000,1.000000);
						case 151: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131998,-0.004999,0.010999, 0.000000,90.000000,95.400001, 1.176999,1.087000,1.000000);
						case 154: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.109998,0.009000,0.000999, 0.000000,90.000000,95.400001, 1.028999,1.087000,1.000000);
						case 156: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151998,-0.002999,0.005999, 0.000000,90.000000,95.400001, 1.028999,1.087000,1.000000);
						case 157: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.012000,0.005999, 0.000000,90.000000,95.400001, 1.028999,1.087000,1.000000);
						case 160: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.012000,0.005999, 0.000000,90.000000,95.400001, 1.028999,1.087000,1.000000);
						case 163: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.012000,-0.000000, 0.000000,90.000000,95.400001, 1.028999,1.087000,1.000000);
						case 164: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.012000,-0.000000, 0.000000,90.000000,95.400001, 1.028999,1.087000,1.000000);
						case 165: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.012000,-0.000000, 0.000000,90.000000,95.400001, 1.028999,1.087000,1.000000);
						case 166: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.012000,-0.000000, 0.000000,90.000000,95.400001, 1.028999,1.087000,1.000000);
						case 169: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,-0.007999,-0.000000, 0.000000,90.000000,95.400001, 1.028999,1.087000,1.000000);
						case 170: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126998,0.011000,-0.000000, 0.000000,90.000000,95.400001, 1.028999,1.087000,1.000000);
						case 171: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.133998,0.008000,-0.000000, 0.000000,90.000000,95.400001, 1.028999,1.087000,1.000000);
						case 176: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.133998,0.004000,-0.000000, 0.000000,90.000000,95.400001, 1.062999,1.087000,1.000000);
						case 177: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.182998,-0.009999,-0.000000, 0.000000,90.000000,95.400001, 1.062999,1.087000,1.000000);
						case 179: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,0.000000,-0.000000, 0.000000,90.000000,95.400001, 1.062999,1.087000,1.000000);
						case 180: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154998,-0.003999,-0.000000, 0.000000,90.000000,95.400001, 1.062999,1.087000,1.000000);
						case 182: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.111998,0.026000,-0.000000, 0.000000,90.000000,95.400001, 1.062999,1.087000,1.000000);
						case 184: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.120998,0.014000,-0.000000, 0.000000,90.000000,95.400001, 1.062999,1.087000,1.000000);
						case 185: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136998,0.004000,-0.000000, 0.000000,90.000000,95.400001, 1.062999,1.087000,1.000000);
						case 186: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136998,0.004000,-0.000000, 0.000000,90.000000,95.400001, 1.062999,1.087000,1.000000);
						case 187: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.110998,-0.006999,-0.000000, 0.000000,90.000000,95.400001, 1.062999,1.087000,1.000000);
						case 188: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.110998,0.006000,-0.000000, 0.000000,90.000000,95.400001, 1.062999,1.087000,1.000000);
						case 189: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136998,0.006000,-0.000000, 0.000000,90.000000,95.400001, 1.062999,1.087000,1.000000);
						case 190: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142998,-0.001999,-0.000000, 0.000000,90.000000,95.400001, 1.062999,1.087000,1.000000);
						case 191: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142998,-0.001999,-0.000000, 0.000000,90.000000,95.400001, 1.062999,1.087000,1.000000);
						case 192: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,0.004999,0.002998, 0.000000,90.000000,96.400009, 1.207000,1.000000,1.000000);
						case 193: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,0.004999,0.002998, 0.000000,90.000000,96.400009, 1.207000,1.000000,1.000000);
						case 194: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,0.004999,0.002998, 0.000000,90.000000,96.400009, 1.207000,1.000000,1.000000);
						case 200: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.137998,0.004999,0.002998, 0.000000,90.000000,96.400009, 1.207000,1.000000,1.000000);
						case 210: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.101998,0.001000,0.002998, 0.000000,90.000000,96.400009, 0.946999,1.000000,1.000000);
						case 213: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,0.001000,-0.001001, 0.000000,90.000000,96.400009, 0.946999,1.000000,1.000000);
						case 217: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.145998,0.004000,-0.009001, 0.000000,90.000000,96.400009, 0.946999,1.000000,1.000000);
						case 221: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154998,-0.021999,0.001999, 0.000000,90.000000,96.400009, 0.946999,1.000000,1.000000);
						case 222: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154998,-0.021999,0.001999, 0.000000,90.000000,96.400009, 0.946999,1.000000,1.000000);
						case 223: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.158998,0.011000,-0.004000, 0.000000,90.000000,96.400009, 0.946999,1.000000,1.000000);
						case 227: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142997,0.015000,0.000999, 0.000000,90.000000,96.400009, 0.946999,1.000000,1.000000);
						case 228: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.150997,0.015000,0.000999, 0.000000,90.000000,96.400009, 1.231999,1.000000,1.000000);
						case 229: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.101998,0.005000,0.000999, 0.000000,90.000000,96.400009, 0.948999,1.000000,1.000000);
						case 234: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.107998,-0.001999,0.001999, 0.000000,90.000000,96.400009, 0.948999,1.000000,1.000000);
						case 235: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.076998,-0.001999,0.001999, 0.000000,90.000000,96.400009, 0.948999,1.000000,1.000000);
						case 236: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.095998,0.010000,0.001999, 0.000000,90.000000,96.400009, 0.948999,1.000000,1.000000);
						case 240: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,0.010000,0.001999, 0.000000,90.000000,96.400009, 1.099999,1.000000,1.000000);
						case 250: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119998,0.010000,0.001999, 0.000000,90.000000,96.400009, 1.099999,1.000000,1.000000);
						case 252: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131998,0.010000,0.005999, 0.000000,90.000000,96.400009, 1.099999,1.000000,1.000000);
						case 258: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131998,0.003000,0.005999, 0.000000,90.000000,96.400009, 1.099999,1.000000,1.000000);
						case 259: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131998,0.003000,0.005999, 0.000000,90.000000,96.400009, 1.099999,1.000000,1.000000);
						case 262: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.095998,0.022000,-0.003000, 0.000000,90.000000,96.400009, 0.964999,1.000000,1.000000);
						case 265: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118998,0.010000,-0.001000, 0.000000,90.000000,96.400009, 0.987999,1.079000,1.000000);
						case 266: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118998,0.010000,-0.001000, 0.000000,90.000000,96.400009, 0.987999,1.079000,1.000000);
						case 267: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118998,-0.009999,-0.001000, 0.000000,90.000000,96.400009, 0.987999,1.079000,1.000000);
						case 268: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118998,0.004000,-0.001000, 0.000000,90.000000,96.400009, 0.987999,1.159999,1.000000);
						case 272: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.138998,0.004000,-0.005000, 0.000000,90.000000,96.400009, 0.987999,1.159999,1.000000);
						case 273: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.100998,0.004000,-0.003000, 0.000000,90.000000,96.400009, 0.987999,1.159999,1.000000);
						case 274: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.025000,-0.003000, 0.000000,90.000000,96.400009, 0.987999,1.159999,1.000000);
						case 275: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.025000,-0.003000, 0.000000,90.000000,96.400009, 0.987999,1.159999,1.000000);
						case 276: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.025000,-0.003000, 0.000000,90.000000,96.400009, 0.987999,1.159999,1.000000);
						case 280: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.025000,-0.003000, 0.000000,90.000000,96.400009, 0.987999,1.159999,1.000000);
						case 281: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.025000,-0.003000, 0.000000,90.000000,96.400009, 0.987999,1.159999,1.000000);
						case 282: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.025000,-0.003000, 0.000000,90.000000,96.400009, 0.987999,1.159999,1.000000);
						case 286: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.019000,-0.003000, 0.000000,90.000000,96.400009, 1.058999,1.159999,1.000000);
						case 290: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.013000,0.001999, 0.000000,90.000000,96.400009, 1.058999,1.159999,1.000000);
						case 291: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141998,0.015000,0.001999, 0.000000,90.000000,96.400009, 1.058999,1.159999,1.000000);
						case 292: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124998,0.009000,0.001999, 0.000000,90.000000,96.400009, 1.058999,1.159999,1.000000);
						case 293: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.162998,0.009000,0.001999, 0.000000,90.000000,96.400009, 1.058999,1.159999,1.000000);
						case 294: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151998,0.009000,0.001999, 0.000000,90.000000,96.400009, 1.058999,1.159999,1.000000);
						case 295: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119997,0.009000,0.001999, 0.000000,90.000000,96.400009, 1.058999,1.159999,1.000000);
						case 296: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.137998,-0.005999,0.001999, 0.000000,90.000000,96.400009, 1.058999,1.159999,1.000000);
						case 297: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.145998,0.007000,0.001999, 0.000000,90.000000,96.400009, 1.058999,1.159999,1.000000);
						case 298: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.145998,0.007000,0.001999, 0.000000,90.000000,96.400009, 1.058999,1.159999,1.000000);
						case 299: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.150998,0.007000,0.001999, 0.000000,90.000000,96.400009, 1.058999,1.159999,1.000000);
						case 300: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124998,0.007000,0.007999, 0.000000,90.000000,96.400009, 1.058999,1.159999,1.000000);
						case 301: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124998,0.007000,0.007999, 0.000000,90.000000,96.400009, 1.058999,1.159999,1.000000);
						case 302: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124998,0.014000,-0.004000, 0.000000,90.000000,96.400009, 1.058999,1.159999,1.000000);
						case 303: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124998,0.014000,-0.004000, 0.000000,90.000000,96.400009, 1.058999,1.159999,1.000000);
						case 304: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124998,0.014000,-0.004000, 0.000000,90.000000,96.400009, 1.058999,1.159999,1.000000);
						case 305: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124998,0.014000,-0.004000, 0.000000,90.000000,96.400009, 1.058999,1.159999,1.000000);
						case 310: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117998,0.003000,-0.004000, 0.000000,90.000000,96.400009, 1.058999,1.159999,1.000000);
						case 311: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118998,0.003000,-0.004000, 0.000000,90.000000,96.400009, 1.058999,1.159999,1.000000);
						default: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134999, 0.008999, 0.000000, 0.600000, 87.699943, 88.100021, 1.078999, 1.059000, 1.000000);
					}
				}
				case 6: {
					switch(skin) {
						case 1: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142998,0.016000,-0.002001, 0.000000,-0.799996,-8.600006, 1.000000,1.000000,1.050999);
						case 3: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.022000,0.008999, 2.000010,-5.999990,5.400008, 1.000000,1.042000,1.079000);
						case 4: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.169998,0.018000,-0.000001, 2.000010,2.000011,1.000008, 1.000000,1.042000,1.079000);
						case 5: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.169998,0.018000,-0.000001, 2.000010,2.000011,1.000008, 1.000000,1.042000,1.079000);
						case 7: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141997,0.032000,-0.004001, 2.000010,2.000011,1.000008, 1.000000,1.042000,1.079000);
						case 9: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113997,0.017000,-0.004001, 2.000010,2.000011,1.000008, 1.000000,1.042000,1.079000);
						case 10: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.106997,0.017000,-0.004001, 2.000010,2.000011,1.000008, 1.000000,1.042000,1.079000);
						case 11: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.106997,0.017000,-0.004001, 2.000010,2.000011,1.000008, 1.000000,1.042000,1.079000);
						case 12: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.106997,0.007000,-0.002001, 2.000010,2.000011,1.000008, 1.000000,1.042000,1.079000);
						case 14: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117997,0.032000,0.003998, 2.000010,2.000011,1.000008, 1.000000,1.042000,1.146000);
						case 15: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.098997,0.008000,0.003998, 2.000010,2.000011,1.000008, 1.000000,1.042000,1.146000);
						case 17: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.120997,0.020000,0.003998, 2.000010,2.000011,1.000008, 1.000000,1.042000,1.146000);
						case 18: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.097998,0.016000,0.003998, 2.000010,2.000011,-17.799989, 1.000000,1.042000,1.146000);
						case 20: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131998,0.004000,0.000998, 2.000010,2.000011,-17.799989, 1.000000,1.042000,1.146000);
						case 21: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116998,0.014000,-0.000001, 2.000010,2.000011,-17.799989, 1.000000,1.042000,1.146000);
						case 25: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.023000,-0.000001, 2.000010,2.000011,-17.799989, 1.000000,1.042000,1.146000);
						case 26: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.026000,-0.000001, 2.000010,2.000011,-17.799989, 1.000000,1.131000,1.206000);
						case 30: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.026000,-0.000001, 2.000010,2.000011,-17.799989, 1.000000,1.131000,1.206000);
						case 40: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.106998,0.005000,-0.000001, 2.000010,2.000011,-17.799989, 1.000000,1.052000,1.206000);
						case 43: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.063998,0.015000,-0.000001, 2.000010,2.000011,-17.799989, 1.000000,1.052000,1.206000);
						case 44: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.100998,0.027000,0.002999, 2.000010,2.000011,-17.799989, 1.000000,0.909000,1.206000);
						case 45: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.100998,0.005000,0.002999, 2.000010,2.000011,-17.799989, 1.000000,0.974000,1.206000);
						case 46: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.111998,0.040000,0.002999, 2.000010,2.000011,-17.799989, 1.000000,1.070000,1.206000);
						case 47: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117998,0.017000,-0.003000, 2.000010,2.000011,-17.799989, 1.000000,1.070000,1.206000);
						case 48: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125998,0.004000,-0.003000, 2.000010,2.000011,-17.799989, 1.000000,1.070000,1.206000);
						case 49: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.097998,0.020000,-0.003000, 2.000010,2.000011,-17.799989, 1.000000,1.070000,1.206000);
						case 55: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.104998,-0.000999,0.000999, 2.000010,2.000011,-17.799989, 1.000000,1.070000,1.206000);
						case 56: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.104998,-0.000999,0.000999, 2.000010,2.000011,-17.799989, 1.000000,1.070000,1.206000);
						case 57: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147998,0.025000,0.000999, 2.000010,2.000011,-17.799989, 1.000000,1.070000,1.206000);
						case 58: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.101998,0.014000,0.000999, 2.000010,2.000011,-17.799989, 1.000000,0.953000,0.969000);
						case 59: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.152998,0.006000,0.000999, 2.000010,2.000011,-17.799989, 1.000000,0.953000,0.969000);
						case 60: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123998,0.006000,-0.004000, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 62: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123998,0.025000,0.005999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 66: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123998,0.023000,0.005999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 67: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123998,0.023000,0.005999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 68: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123998,0.030000,-0.000000, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 70: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123998,0.024000,0.006999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 72: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123998,0.024000,0.006999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 82: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.173998,0.024000,0.006999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 83: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.173998,0.024000,0.006999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 84: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.173998,0.024000,0.006999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 86: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.106998,0.001000,0.006999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 95: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.106998,0.001000,0.003999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 96: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.114998,0.020000,0.003999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 97: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.114998,0.010000,0.000999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 98: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128998,0.029000,0.000999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 100: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.133998,0.009000,0.000999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 101: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.133998,0.009000,0.000999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 106: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,0.009000,0.000999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 108: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,0.009000,0.000999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 109: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,0.009000,0.000999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 110: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,0.009000,0.000999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 111: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.121998,0.018000,0.000999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 112: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.109998,0.013000,0.000999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 113: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130998,0.013000,0.000999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 114: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146998,0.005000,0.000999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 117: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.114998,0.020000,0.000999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 118: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.114998,0.020000,0.000999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 119: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.121998,0.020000,0.000999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 120: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127998,0.000000,0.000999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 121: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127998,0.000000,0.000999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.084000);
						case 123: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134998,0.005000,-0.003000, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.166000);
						case 124: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134998,0.013000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.166000);
						case 125: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125998,0.021000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.166000);
						case 126: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,0.001000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.166000);
						case 127: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,0.014000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.166000);
						case 128: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142998,0.025000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.166000);
						case 147: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118998,-0.000999,0.001999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.166000);
						case 156: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154998,-0.009999,0.001999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.166000);
						case 160: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.111998,0.024000,0.002999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.166000);
						case 162: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132998,0.017000,0.002999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.166000);
						case 163: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117998,0.011000,0.002999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.166000);
						case 164: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117998,0.011000,0.002999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.166000);
						case 165: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117998,0.018000,0.002999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.166000);
						case 166: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117998,0.018000,0.002999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.166000);
						case 169: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112998,-0.003999,0.002999, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.166000);
						case 170: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112998,0.017000,-0.001000, 2.000010,2.000011,-17.799989, 1.000000,0.967000,1.166000);
						case 171: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,0.009000,-0.001000, 2.000010,2.000011,-17.799989, 1.000000,1.043000,1.166000);
						case 176: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,0.005000,-0.001000, 2.000010,2.000011,-17.799989, 1.000000,1.043000,1.166000);
						case 179: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,0.009000,-0.001000, 2.000010,2.000011,-17.799989, 1.000000,1.043000,1.166000);
						case 180: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,0.005000,-0.001000, 2.000010,2.000011,-17.799989, 1.000000,1.043000,1.166000);
						case 182: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.104998,0.018000,-0.001000, 2.000010,2.000011,-17.799989, 1.000000,1.043000,1.166000);
						case 183: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.104998,0.018000,-0.001000, 2.000010,2.000011,-17.799989, 1.000000,1.043000,1.166000);
						case 184: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.104998,0.018000,-0.003000, 2.000010,2.000011,-17.799989, 1.000000,1.043000,1.166000);
						case 185: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127998,0.018000,-0.002000, 2.000010,2.000011,-17.799989, 1.000000,1.043000,1.166000);
						case 186: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127998,0.000000,-0.002000, 2.000010,2.000011,-17.799989, 1.000000,1.043000,1.166000);
						case 187: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.103998,0.005000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,1.043000,1.166000);
						case 188: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.103998,0.011000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,1.043000,1.166000);
						case 189: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131998,0.003000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,1.043000,1.166000);
						case 190: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.001000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,1.043000,1.166000);
						case 191: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.001000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,1.043000,1.166000);
						case 192: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.007000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,1.043000,1.166000);
						case 193: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.007000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,1.043000,1.166000);
						case 194: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.008000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,1.043000,1.166000);
						case 199: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116998,0.008000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,1.043000,1.166000);
						case 200: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131998,0.008000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,1.043000,1.166000);
						case 206: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131998,0.020000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,0.970000,1.166000);
						case 208: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.114998,0.012000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,0.970000,1.166000);
						case 210: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.114998,0.004000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,0.970000,1.166000);
						case 213: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123998,0.010000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,0.970000,1.166000);
						case 217: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123998,0.021000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,0.970000,1.166000);
						case 218: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123998,0.015000,0.001999, 2.000010,2.000011,-17.799989, 1.000000,0.970000,1.166000);
						case 221: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154998,-0.012999,0.001999, 2.000010,2.000011,-17.799989, 1.000000,0.970000,1.166000);
						case 222: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.150998,-0.017999,0.001999, 2.000010,2.000011,-17.799989, 1.000000,0.970000,1.166000);
						case 223: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.150998,0.014000,0.001999, 2.000010,2.000011,-26.199983, 1.000000,0.970000,1.166000);
						case 226: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122998,0.003000,0.001999, 2.000010,2.000011,-10.499980, 1.000000,0.970000,1.166000);
						case 227: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.143998,0.029000,0.001999, 2.000010,2.000011,-10.499980, 1.000000,0.970000,1.166000);
						case 228: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.143998,0.023000,0.001999, 2.000010,2.000011,-10.499980, 1.000000,1.132000,1.166000);
						case 229: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.105998,0.011000,0.001999, 2.000010,2.000011,-10.499980, 1.000000,1.013000,1.166000);
						case 234: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.105998,-0.002999,0.001999, 2.000010,2.000011,-10.499980, 1.000000,1.013000,1.166000);
						case 235: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.073998,0.010000,0.001999, 2.000010,2.000011,-10.499980, 1.000000,1.013000,1.166000);
						case 236: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.098998,0.010000,0.001999, 2.000010,2.000011,-10.499980, 1.000000,1.013000,1.166000);
						case 240: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.133998,0.015000,0.001999, 2.000010,2.000011,-10.499980, 1.000000,1.013000,1.166000);
						case 243: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.091998,0.023000,0.001998, 2.000010,2.000011,-10.499980, 1.000000,1.013000,1.166000);
						case 250: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123998,0.023000,-0.004001, 2.000010,2.000011,-10.499980, 1.000000,1.013000,1.166000);
						case 252: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123998,0.005000,0.003998, 2.000010,2.000011,-10.499980, 1.000000,1.013000,1.166000);
						case 258: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,0.019000,0.003998, 2.000010,2.000011,-10.499980, 1.000000,1.013000,1.166000);
						case 259: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,0.010000,0.003998, 2.000010,2.000011,-10.499980, 1.000000,1.013000,1.166000);
						case 262: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.107998,0.027000,-0.002001, 0.000000,0.899997,-5.699998, 1.000000,1.000000,1.000000);
						case 265: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.107998,0.015000,-0.002001, 0.000000,0.899997,-5.699998, 1.000000,1.000000,1.000000);
						case 266: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.107998,0.013000,-0.002001, 0.000000,0.899997,-5.699998, 1.000000,1.000000,1.000000);
						case 267: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.107998,0.007999,0.002998, 0.000000,0.899997,-5.699998, 1.000000,1.000000,1.000000);
						case 268: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.107998,0.007999,-0.001001, 0.000000,0.899997,-5.699998, 1.000000,1.000000,1.085999);
						case 272: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,0.019000,-0.001001, 0.000000,0.899997,-5.699998, 1.000000,1.000000,1.085999);
						case 273: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.097998,0.019000,-0.001001, 0.000000,0.899997,-5.699998, 1.000000,1.000000,1.085999);
						case 274: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.019000,-0.001001, 0.000000,0.899997,-5.699998, 1.000000,1.000000,1.085999);
						case 275: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.019000,-0.001001, 0.000000,0.899997,-5.699998, 1.000000,1.000000,1.085999);
						case 276: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.019000,-0.001001, 0.000000,0.899997,-5.699998, 1.000000,1.000000,1.085999);
						case 280: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.019000,-0.001001, 0.000000,0.899997,-5.699998, 1.000000,1.000000,1.085999);
						case 281: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.019000,-0.001001, 0.000000,0.899997,-5.699998, 1.000000,1.000000,1.085999);
						case 282: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.019000,-0.001001, 0.000000,0.899997,-5.699998, 1.000000,1.000000,1.085999);
						case 286: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.019000,-0.001001, 0.000000,0.899997,-5.699998, 1.000000,1.000000,1.085999);
						case 291: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154998,0.019000,-0.001001, 0.000000,0.899997,-5.699998, 1.000000,1.000000,1.085999);
						case 292: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.098998,0.019000,-0.001001, 0.000000,0.899997,-5.699998, 1.000000,1.000000,1.085999);
						case 294: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136998,0.020000,-0.001001, 0.000000,0.899997,-5.699998, 1.000000,1.075999,1.085999);
						case 295: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125998,0.020000,-0.001001, 0.000000,0.899997,-5.699998, 1.000000,1.075999,1.085999);
						case 296: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125998,0.003999,-0.001001, 0.000000,0.899997,-5.699998, 1.000000,1.075999,1.085999);
						case 297: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141998,0.003999,-0.001001, 0.000000,0.899997,-5.699998, 1.000000,1.075999,1.131999);
						case 298: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122998,0.021000,-0.003001, 0.000000,0.899997,-5.699998, 1.000000,1.075999,1.131999);
						case 299: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.143998,0.030000,-0.003001, 0.000000,0.899997,-23.200000, 1.000000,1.075999,1.131999);
						case 300: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124997,0.013000,-0.003001, 0.000000,0.899997,-7.599999, 1.000000,0.885999,1.131999);
						case 301: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124997,0.013000,-0.003001, 0.000000,0.899997,-7.599999, 1.000000,0.885999,1.131999);
						case 302: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124997,0.021000,-0.003001, 0.000000,0.899997,-7.599999, 1.000000,0.909999,1.131999);
						case 303: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124997,0.021000,-0.000001, 0.000000,0.899997,-7.599999, 1.000000,0.909999,1.034999);
						case 304: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124997,0.021000,-0.000001, 0.000000,0.899997,-7.599999, 1.000000,0.909999,1.034999);
						case 305: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124997,0.021000,-0.000001, 0.000000,0.899997,-7.599999, 1.000000,0.909999,1.034999);
						case 310: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124997,0.021000,-0.000001, 0.000000,0.899997,-7.599999, 1.000000,0.909999,1.034999);
						case 311: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124997,0.021000,-0.000001, 0.000000,0.899997,-7.599999, 1.000000,0.909999,1.034999);
						default: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136000, 0.005999, 0.000000, 0.000000, -0.699999, -14.800000, 1.083999, 1.000000, 1.224999);
					}
				}
				case 7: {
					switch(skin) {
						case 1: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.009999,0.001998, 0.400000,-3.699999,12.699994, 1.114999,1.000000,1.238999);
						case 3: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.013000,0.004998, 0.400000,-3.699999,12.699994, 1.114999,1.245000,1.238999);
						case 4: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.181997,0.000999,0.004998, 0.400000,-3.699999,12.699994, 1.114999,1.245000,1.238999);
						case 5: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.181997,0.000999,0.004998, 0.400000,-3.699999,12.699994, 1.114999,1.245000,1.238999);
						case 7: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154997,0.025000,0.004998, 0.400000,-3.699999,12.699994, 1.114999,1.245000,1.238999);
						case 9: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144997,0.007999,0.004998, 0.400000,-3.699999,12.699994, 1.114999,1.245000,1.238999);
						case 10: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144997,-0.000000,0.004998, 0.400000,-3.699999,12.699994, 1.114999,1.245000,1.238999);
						case 11: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141997,-0.006000,0.004998, 0.400000,-3.699999,-0.400006, 1.114999,1.245000,1.238999);
						case 12: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141997,-0.025000,0.004998, 0.400000,-3.699999,-0.400006, 1.114999,1.245000,1.238999);
						case 14: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141997,0.011999,0.004999, 0.400000,-3.699999,-0.400006, 1.114999,1.245000,1.297000);
						case 15: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.114997,-0.025000,0.004999, 0.400000,-3.699999,-0.400006, 1.114999,1.245000,1.297000);
						case 17: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.153997,0.005000,0.004999, 0.400000,-3.699999,-0.400006, 1.114999,1.245000,1.297000);
						case 18: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.114997,-0.003999,0.004999, 0.400000,-3.699999,-0.400006, 1.114999,1.245000,1.297000);
						case 20: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.165997,-0.014999,0.004999, 0.400000,-3.699999,-0.400006, 1.114999,1.245000,1.297000);
						case 21: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.150997,-0.003999,0.000998, 0.400000,-3.699999,-0.400006, 1.114999,1.245000,1.297000);
						case 25: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135997,0.010000,0.006999, 0.400000,-3.699999,-0.400006, 1.114999,1.245000,1.297000);
						case 26: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.150997,0.004000,0.006999, 0.400000,-3.699999,-0.400006, 1.114999,1.344000,1.297000);
						case 28: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134997,0.011000,-0.004001, 0.400000,-3.699999,-0.400006, 1.114999,1.344000,1.297000);
						case 30: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134997,0.005000,-0.004001, 0.400000,-3.699999,-0.400006, 1.114999,1.344000,1.297000);
						case 40: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134997,-0.018999,0.007999, 0.400000,-3.699999,-0.400006, 1.114999,1.344000,1.297000);
						case 43: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.108997,-0.009000,0.007999, 0.400000,-3.699999,-0.400006, 1.114999,1.132000,1.297000);
						case 44: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.108997,0.011999,0.007999, 0.400000,-3.699999,-0.400006, 1.114999,1.132000,1.297000);
						case 45: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.120997,-0.008000,0.007999, 0.400000,-3.699999,-0.400006, 1.114999,1.132000,1.297000);
						case 46: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.152997,0.006999,0.007999, 0.400000,-3.699999,-0.400006, 1.114999,1.214000,1.367000);
						case 47: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.152997,0.000999,0.001998, 0.400000,-3.699999,-0.400006, 1.114999,1.214000,1.367000);
						case 48: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.152997,-0.014000,0.001998, 0.400000,-3.699999,-0.400006, 1.114999,1.214000,1.367000);
						case 49: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.109997,0.007999,0.001998, 0.400000,-3.699999,-0.400006, 1.114999,1.214000,1.367000);
						case 55: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125997,-0.010000,0.001998, 0.400000,-3.699999,-0.400006, 1.114999,1.214000,1.367000);
						case 56: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125997,-0.020000,0.001998, 0.400000,-3.699999,-0.400006, 1.114999,1.214000,1.367000);
						case 57: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157997,0.013999,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.214000,1.367000);
						case 58: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.110997,0.000999,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.214000,1.367000);
						case 59: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.164997,-0.002000,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.311000,1.367000);
						case 60: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144997,-0.002000,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.164000,1.367000);
						case 66: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144997,0.004999,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.164000,1.367000);
						case 67: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.138997,0.003999,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.164000,1.367000);
						case 68: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.138997,0.017999,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.164000,1.367000);
						case 69: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.138997,-0.010000,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.164000,1.367000);
						case 70: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.138997,0.013999,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.164000,1.367000);
						case 72: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.138997,0.007999,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.164000,1.367000);
						case 76: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.138997,-0.016000,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.164000,1.367000);
						case 82: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.195997,0.004999,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.164000,1.145000);
						case 83: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.195997,-0.006000,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.164000,1.145000);
						case 84: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.195997,-0.006000,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.164000,1.145000);
						case 86: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126997,-0.012000,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.164000,1.145000);
						case 90: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126997,-0.001000,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.356000,1.264000);
						case 91: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.138997,-0.015000,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.356000,1.264000);
						case 95: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.138997,-0.023000,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.137000,1.264000);
						case 96: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.138997,0.001999,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.137000,1.264000);
						case 97: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.138997,-0.005000,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.137000,1.264000);
						case 98: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.138997,0.012999,-0.002001, 0.400000,-3.699999,-0.400006, 1.114999,1.247000,1.264000);
						case 100: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151997,-0.008000,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.247000,1.264000);
						case 101: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151997,-0.008000,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.247000,1.264000);
						case 106: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.163997,-0.008000,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.247000,1.264000);
						case 108: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148997,-0.003000,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.247000,1.264000);
						case 109: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148997,-0.003000,-0.000001, 0.400000,-3.699999,-0.400006, 1.114999,1.356000,1.314000);
						case 110: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148997,-0.003000,-0.000001, 0.400000,-3.699999,-0.400006, 1.114999,1.356000,1.314000);
						case 111: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148997,-0.003000,-0.000001, 0.400000,-3.699999,-0.400006, 1.114999,1.108000,1.314000);
						case 112: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.133997,-0.003000,-0.000001, 0.400000,-3.699999,-0.400006, 1.114999,0.987000,1.314000);
						case 113: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.166997,-0.005000,-0.000001, 0.400000,-3.699999,-0.400006, 1.114999,1.204000,1.314000);
						case 114: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.166997,-0.005000,-0.000001, 0.400000,-3.699999,-0.400006, 1.114999,1.204000,1.314000);
						case 116: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.166997,-0.005000,-0.000001, 0.400000,-3.699999,-0.400006, 1.114999,1.204000,1.314000);
						case 117: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.121997,0.010999,-0.000001, 0.400000,-3.699999,-0.400006, 1.114999,1.204000,1.314000);
						case 118: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.121997,0.010999,-0.000001, 0.400000,-3.699999,-0.400006, 1.114999,1.204000,1.314000);
						case 119: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126997,0.007999,-0.000001, 0.400000,-3.699999,-0.400006, 1.114999,1.204000,1.314000);
						case 120: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126997,0.003999,0.004999, 0.400000,-3.699999,-0.400006, 1.114999,1.204000,1.314000);
						case 121: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126997,0.003999,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.204000,1.374000);
						case 122: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126997,-0.000000,0.003998, 0.400000,-3.699999,-0.400006, 1.114999,1.204000,1.374000);
						case 123: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.143997,-0.002000,-0.000001, 0.400000,-3.699999,-0.400006, 1.114999,1.278000,1.374000);
						case 124: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.143997,-0.002000,0.001998, 0.400000,-3.699999,-0.400006, 1.114999,1.278000,1.374000);
						case 125: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122997,0.008999,0.001998, 0.400000,-3.699999,-0.400006, 1.114999,1.278000,1.374000);
						case 126: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131997,0.000999,0.001998, 0.400000,-3.699999,-0.400006, 1.114999,1.278000,1.374000);
						case 127: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131997,0.000999,0.001998, 0.400000,-3.699999,-0.400006, 1.114999,1.278000,1.374000);
						case 128: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142997,0.007999,0.001998, 0.400000,-3.699999,-0.400006, 1.114999,1.278000,1.374000);
						case 147: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123997,-0.011000,0.005998, 0.400000,-3.699999,-0.400006, 1.114999,1.278000,1.374000);
						case 148: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123997,-0.010000,0.005998, 0.400000,-3.699999,-0.400006, 1.114999,1.278000,1.374000);
						case 151: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147997,-0.019000,0.005998, 0.400000,-3.699999,-0.400006, 1.114999,1.371001,1.374000);
						case 154: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.110997,-0.001000,0.005998, 0.400000,-3.699999,-0.400006, 1.114999,1.207000,1.374000);
						case 156: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.170997,-0.023000,0.005998, 0.400000,-3.699999,-0.400006, 1.114999,1.207000,1.374000);
						case 157: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117997,0.009999,0.005998, 0.400000,-3.699999,-0.400006, 1.114999,1.207000,1.374000);
						case 160: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117997,0.000999,0.005998, 0.400000,-3.699999,-0.400006, 1.114999,1.018000,1.294000);
						case 162: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136997,0.003999,0.005998, 0.400000,-3.699999,-0.400006, 1.188999,1.114001,1.294000);
						case 163: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124997,0.008999,0.005998, 0.400000,-3.699999,-0.400006, 1.188999,1.114001,1.294000);
						case 164: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124997,0.005999,0.005998, 0.400000,-3.699999,-0.400006, 1.188999,1.114001,1.294000);
						case 165: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136997,0.003999,0.002998, 0.400000,-3.699999,-0.400006, 1.188999,1.114001,1.352999);
						case 166: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136997,0.003999,0.002998, 0.400000,-3.699999,-0.400006, 1.188999,1.114001,1.352999);
						case 169: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136997,-0.014000,0.002998, 0.400000,-3.699999,-0.400006, 1.188999,1.114001,1.352999);
						case 170: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136997,0.000999,0.002998, 0.400000,-3.699999,-0.400006, 1.188999,1.114001,1.352999);
						case 171: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141997,-0.005000,0.002998, 0.400000,-3.699999,-0.400006, 1.188999,1.230001,1.352999);
						case 172: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151997,-0.009000,0.002998, 0.400000,-3.699999,-0.400006, 1.188999,1.230001,1.352999);
						case 176: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151997,-0.009000,0.002998, 0.400000,-3.699999,-0.400006, 1.188999,1.230001,1.352999);
						case 179: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151997,-0.004000,0.002998, 0.400000,-3.699999,-0.400006, 1.188999,1.230001,1.352999);
						case 180: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151997,-0.010000,0.002998, 0.400000,-3.699999,-0.400006, 1.188999,1.230001,1.352999);
						case 182: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.121997,0.006999,0.002998, 0.400000,-3.699999,-0.400006, 1.188999,1.230001,1.352999);
						case 183: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.121997,0.001999,0.002998, 0.400000,-3.699999,-0.400006, 1.188999,1.230001,1.352999);
						case 184: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.121997,0.010999,-0.002001, 0.400000,-3.699999,-0.400006, 1.188999,1.230001,1.352999);
						case 185: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154997,-0.006000,0.000998, 0.400000,-3.699999,-0.400006, 1.188999,1.230001,1.352999);
						case 186: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139997,-0.006000,0.004998, 0.400000,-3.699999,-0.400006, 1.188999,1.230001,1.352999);
						case 187: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117997,-0.001000,0.004998, 0.400000,-3.699999,-0.400006, 1.188999,1.230001,1.352999);
						case 188: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117997,-0.001000,0.004998, 0.400000,-3.699999,-0.400006, 1.188999,1.230001,1.352999);
						case 189: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.138997,-0.001000,0.004998, 0.400000,-3.699999,-0.400006, 1.188999,1.230001,1.352999);
						case 191: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.158997,-0.007000,0.002998, 0.400000,-3.699999,-0.400006, 1.268999,1.383001,1.428999);
						case 192: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.158997,-0.012000,0.002998, 0.400000,-3.699999,-0.400006, 1.268999,1.383001,1.428999);
						case 193: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.158997,-0.012000,0.002998, 0.400000,-3.699999,-0.400006, 1.268999,1.383001,1.428999);
						case 194: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.158997,-0.012000,0.002998, 0.400000,-3.699999,-0.400006, 1.268999,1.383001,1.428999);
						case 200: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140997,-0.012000,0.003998, 0.400000,-3.699999,-0.400006, 1.268999,1.383001,1.428999);
						case 206: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140997,0.019999,0.003998, 0.400000,-3.699999,-0.400006, 1.268999,1.071001,1.250999);
						case 207: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124997,-0.002000,0.003998, 0.400000,-3.699999,-0.400006, 1.268999,1.071001,1.250999);
						case 210: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124997,0.003999,0.003998, 0.400000,-3.699999,-0.400006, 1.268999,1.071001,1.250999);
						case 213: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124997,0.003999,0.000998, 0.400000,-3.699999,-0.400006, 1.268999,1.177001,1.327999);
						case 217: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142997,-0.003000,0.003998, 0.400000,-3.699999,-0.400006, 1.268999,1.177001,1.327999);
						case 221: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.161997,-0.015000,0.006998, 0.400000,-3.699999,-0.400006, 1.268999,1.257001,1.429999);
						case 222: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148997,-0.015000,0.006998, 0.400000,-3.699999,-0.400006, 1.268999,1.257001,1.429999);
						case 223: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.153997,0.012999,0.006998, 0.400000,-3.699999,-0.400006, 1.268999,1.386001,1.429999);
						case 226: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117997,-0.020000,0.006998, 0.400000,-3.699999,-0.400006, 1.268999,1.386001,1.429999);
						case 227: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147997,0.018999,0.004998, 0.400000,-3.699999,-0.400006, 1.268999,1.128001,1.429999);
						case 228: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147997,0.004999,0.004998, 0.400000,-3.699999,-0.400006, 1.268999,1.288001,1.429999);
						case 229: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118997,-0.005000,0.004998, 0.400000,-3.699999,-0.400006, 1.268999,1.091001,1.429999);
						case 234: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118997,-0.015000,0.004998, 0.400000,-3.699999,-0.400006, 1.268999,1.091001,1.429999);
						case 235: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.096997,-0.007000,0.004998, 0.400000,-3.699999,-0.400006, 1.268999,1.091001,1.283999);
						case 236: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.120997,-0.002000,0.004998, 0.400000,-3.699999,-0.400006, 1.268999,1.091001,1.283999);
						case 240: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148997,-0.001000,0.004998, 0.400000,-3.699999,-0.400006, 1.268999,1.264001,1.283999);
						case 247: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148997,-0.001000,0.004998, 0.400000,-3.699999,-0.400006, 1.268999,1.264001,1.283999);
						case 248: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.182997,-0.004000,0.002998, 0.400000,-3.699999,-0.400006, 1.268999,1.323001,1.283999);
						case 250: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146997,0.004999,0.002998, 0.400000,-3.699999,-0.400006, 1.268999,1.323001,1.283999);
						case 252: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146997,-0.008999,0.002998, 0.400000,-3.699999,-0.400006, 1.268999,1.323001,1.283999);
						case 254: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146997,-0.008999,0.007998, 0.400000,-3.699999,-0.400006, 1.268999,1.323001,1.283999);
						case 258: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146997,-0.004999,0.007998, 0.400000,-3.699999,-0.400006, 1.268999,1.323001,1.411999);
						case 259: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146997,-0.008999,0.007998, 0.400000,-3.699999,-0.400006, 1.268999,1.323001,1.411999);
						case 262: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112997,0.007000,0.003998, 0.400000,-3.699999,-0.400006, 1.268999,1.146001,1.411999);
						case 265: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112997,0.007000,0.003998, 0.400000,-3.699999,-0.400006, 1.268999,1.146001,1.411999);
						case 266: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132997,0.000000,-0.004001, 0.400000,-3.699999,-0.400006, 1.268999,1.146001,1.411999);
						case 267: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132997,-0.008999,0.000998, 0.400000,-3.699999,-0.400006, 1.268999,1.146001,1.411999);
						case 268: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132997,-0.008999,0.000998, 0.400000,-3.699999,-0.400006, 1.268999,1.146001,1.411999);
						case 272: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149997,-0.001999,0.000998, 0.400000,-3.699999,-0.400006, 1.268999,1.146001,1.411999);
						case 273: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127997,-0.004999,0.000998, 0.400000,-3.699999,-0.400006, 1.268999,1.146001,1.411999);
						case 274: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117997,0.002000,0.000998, 0.400000,-3.699999,-0.400006, 1.268999,1.146001,1.411999);
						case 275: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117997,0.002000,0.000998, 0.400000,-3.699999,-0.400006, 1.268999,1.146001,1.411999);
						case 276: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144997,0.002000,0.000998, 0.400000,-3.699999,-0.400006, 1.268999,1.146001,1.411999);
						case 280: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132997,0.001000,0.004998, 0.400000,-3.699999,-0.400006, 1.268999,1.146001,1.411999);
						case 281: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132997,0.006000,0.004998, 0.400000,-3.699999,-0.400006, 1.268999,1.057001,1.208999);
						case 282: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144997,0.011000,0.004998, 0.400000,-3.699999,-0.400006, 1.268999,1.057001,1.208999);
						case 286: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144997,0.006000,0.004998, 0.400000,-3.699999,-0.400006, 1.268999,1.057001,1.208999);
						case 291: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159997,0.010000,0.004998, 0.400000,-3.699999,-0.400006, 1.268999,1.278001,1.319999);
						case 292: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128997,0.001000,-0.001001, 0.400000,-3.699999,-0.400006, 1.268999,1.014001,1.137000);
						case 293: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128997,0.001000,-0.001001, 0.400000,-3.699999,-0.400006, 1.268999,1.014001,1.216000);
						case 294: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.156997,0.008000,0.000998, 0.400000,-3.699999,-0.400006, 1.268999,1.231001,1.216000);
						case 295: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135997,0.001000,0.005998, 0.400000,-3.699999,-0.400006, 1.268999,1.231001,1.295000);
						case 296: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135997,-0.006999,0.005998, 0.400000,-3.699999,-0.400006, 1.268999,1.363001,1.295000);
						case 297: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.156997,-0.000999,0.005998, 0.400000,-3.699999,-0.400006, 1.268999,1.363001,1.295000);
						case 299: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.178997,0.011000,0.005998, 0.400000,-3.699999,-0.400006, 1.268999,1.363001,1.295000);
						case 300: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135997,0.007000,-0.000001, 0.400000,-3.699999,-0.400006, 1.134999,1.101001,1.295000);
						case 301: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135997,0.007000,-0.000001, 0.400000,-3.699999,-0.400006, 1.134999,1.101001,1.295000);
						case 302: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135997,0.007000,-0.000001, 0.400000,-3.699999,-0.400006, 1.134999,1.179001,1.295000);
						case 303: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.137997,0.012000,-0.000001, 0.400000,-3.699999,-0.400006, 1.134999,1.179001,1.295000);
						case 304: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.137997,0.006000,-0.000001, 0.400000,-3.699999,-0.400006, 1.134999,1.179001,1.295000);
						case 305: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.137997,0.006000,-0.000001, 0.400000,-3.699999,-0.400006, 1.134999,1.179001,1.295000);
						case 310: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.137997,0.001000,-0.000001, 0.400000,-3.699999,-0.400006, 1.134999,1.179001,1.295000);
						case 311: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.137997,0.000000,-0.000001, 0.400000,-3.699999,-0.400006, 1.134999,1.179001,1.295000);
						default: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.150999, -0.008999, 0.000000, 0.000000, -0.799999, -7.599998, 1.000000, 1.181999, 1.246999);
					}
				}
				case 8: {
					switch(skin) {
						case 1: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.016000,-0.005001, 0.000000,90.000000,93.500007, 1.000000,1.000000,1.000000);
						case 3: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.007999,0.001998, 0.000000,90.000000,93.500007, 1.000000,1.000000,1.000000);
						case 4: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,0.015000,0.001998, 0.000000,90.000000,93.500007, 1.043999,1.123999,1.000000);
						case 5: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.161998,0.004999,0.001998, 0.000000,90.000000,93.500007, 1.043999,1.123999,1.000000);
						case 7: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.161998,0.018000,-0.000001, 0.000000,90.000000,93.500007, 1.043999,1.123999,1.000000);
						case 9: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127997,0.006999,0.001998, 0.000000,90.000000,93.500007, 1.043999,1.123999,1.000000);
						case 10: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127997,0.006999,0.001998, 0.000000,90.000000,93.500007, 1.043999,1.123999,1.000000);
						case 11: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127997,0.012000,0.001998, 0.000000,90.000000,93.500007, 1.043999,1.123999,1.000000);
						case 12: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127997,-0.000000,0.001998, 0.000000,90.000000,93.500007, 1.043999,1.123999,1.000000);
						case 14: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134998,0.027000,0.001998, 0.000000,90.000000,93.500007, 1.043999,1.123999,1.000000);
						case 15: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123998,-0.013000,0.001998, 0.000000,90.000000,93.500007, 1.043999,1.123999,1.000000);
						case 17: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.016000,0.002998, 0.000000,90.000000,93.699989, 1.000000,1.000000,1.000000);
						case 18: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112998,0.013000,0.000998, 0.000000,90.000000,93.699989, 1.000000,1.000000,1.000000);
						case 20: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131998,0.013000,0.000998, 0.000000,90.000000,93.699989, 1.000000,1.000000,1.000000);
						case 21: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131998,0.009999,0.000998, 0.000000,90.000000,93.699989, 1.000000,1.000000,1.000000);
						case 25: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.138998,0.014000,0.000998, 0.000000,90.000000,93.699989, 1.000000,1.000000,1.000000);
						case 26: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,0.014000,0.000998, 0.000000,90.000000,93.699989, 1.000000,1.000000,1.000000);
						case 30: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,0.014000,-0.002001, 0.000000,90.000000,93.699989, 1.000000,1.074000,1.000000);
						case 40: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124998,-0.003000,-0.002001, 0.000000,90.000000,93.699989, 1.000000,1.074000,1.000000);
						case 43: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.081998,0.017999,-0.002001, 0.000000,90.000000,93.699989, 1.000000,1.074000,1.000000);
						case 44: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.029000,-0.002001, 0.000000,90.000000,93.699989, 1.000000,1.074000,1.000000);
						case 45: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.098998,0.008999,-0.002001, 0.000000,90.000000,93.699989, 1.000000,1.074000,1.000000);
						case 46: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.037999,-0.001001, 0.000000,90.000000,93.699989, 1.078999,1.074000,1.000000);
						case 47: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.023000,-0.001001, 0.000000,90.000000,93.699989, 1.078999,1.074000,1.000000);
						case 48: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,0.004999,-0.005000, 0.000000,90.000000,93.699989, 1.078999,1.138000,1.000000);
						case 49: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112998,0.020999,-0.005000, 0.199999,91.999984,97.199958, 1.078999,1.138000,1.000000);
						case 54: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112998,0.043999,-0.005000, 0.199999,91.999984,97.199958, 1.078999,1.138000,1.000000);
						case 55: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112998,0.004999,-0.005000, 0.199999,91.999984,97.199958, 1.078999,1.138000,1.000000);
						case 56: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112998,0.004999,-0.005000, 0.199999,91.999984,97.199958, 1.078999,1.138000,1.000000);
						case 57: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,0.031999,-0.004000, 0.199999,91.999984,97.199958, 1.078999,1.138000,1.000000);
						case 58: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.017999,0.000999, 0.199999,91.999984,97.199958, 1.078999,1.138000,1.000000);
						case 59: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157998,0.024999,0.000999, 0.199999,91.999984,97.199958, 1.078999,1.138000,1.000000);
						case 60: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157998,0.024999,0.000999, 0.199999,91.999984,97.199958, 1.078999,1.138000,1.000000);
						case 62: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128998,0.026999,0.000999, 0.199999,91.999984,97.199958, 1.078999,1.138000,1.000000);
						case 66: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128998,0.019999,0.000999, 0.199999,91.999984,97.199958, 1.078999,1.138000,1.000000);
						case 67: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128998,0.019999,0.000999, 0.199999,91.999984,97.199958, 1.078999,1.138000,1.000000);
						case 68: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117998,0.032999,0.000999, 0.199999,91.999984,97.199958, 1.078999,1.138000,1.000000);
						case 69: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117998,0.014999,0.000999, 0.199999,91.999984,97.199958, 1.078999,1.138000,1.000000);
						case 70: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117998,0.032999,0.008999, 0.199999,91.999984,97.199958, 1.078999,1.138000,1.000000);
						case 72: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117998,0.032999,0.001999, 0.199999,91.999984,90.599967, 0.977999,0.991000,1.000000);
						case 73: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117998,0.032999,0.001999, 0.199999,91.999984,90.599967, 0.977999,0.991000,1.000000);
						case 76: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.133998,0.002999,0.001999, 0.199999,91.999984,90.599967, 0.977999,0.991000,1.000000);
						case 78: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,0.006999,0.001999, 0.199999,91.999984,90.599967, 0.977999,0.991000,1.000000);
						case 79: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.121998,0.006999,0.006999, 0.199999,91.999984,90.599967, 0.977999,0.991000,1.000000);
						case 82: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.182998,0.025999,0.003999, 0.199999,91.999984,90.599967, 0.977999,0.991000,1.000000);
						case 83: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.163998,0.020999,0.003999, 0.199999,91.999984,90.599967, 1.071999,0.991000,1.000000);
						case 84: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.163998,0.020999,0.003999, 0.199999,91.999984,90.599967, 1.071999,0.991000,1.000000);
						case 86: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119998,0.011999,0.003999, 0.199999,91.999984,90.599967, 1.071999,0.991000,1.000000);
						case 88: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126998,0.032999,0.003999, 0.199999,91.999984,90.599967, 1.071999,0.991000,1.000000);
						case 90: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126998,0.010999,0.003999, 0.199999,91.999984,90.599967, 1.071999,0.991000,1.000000);
						case 91: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126998,0.005999,0.003999, 0.199999,91.999984,90.599967, 1.071999,0.991000,1.000000);
						case 94: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.079998,0.022999,0.001999, 0.199999,91.999984,90.599967, 1.071999,0.991000,1.000000);
						case 95: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.102998,0.001999,0.001999, 0.199999,91.999984,90.599967, 0.934999,0.991000,1.000000);
						case 96: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124998,0.015999,-0.000000, 0.199999,91.999984,90.599967, 0.986999,1.020000,1.000000);
						case 97: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124998,0.010999,-0.000000, 0.199999,91.999984,90.599967, 0.986999,1.020000,1.000000);
						case 98: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124998,0.035999,-0.003000, 0.199999,91.999984,90.599967, 1.025999,1.020000,1.000000);
						case 100: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130998,0.015999,0.000999, 0.199999,91.999984,90.599967, 1.025999,1.020000,1.000000);
						case 101: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144998,0.015999,0.000999, 0.199999,91.999984,90.599967, 1.025999,1.020000,1.000000);
						case 102: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144998,0.015999,-0.005000, 0.199999,91.999984,90.599967, 1.025999,1.020000,1.000000);
						case 106: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144998,0.016999,-0.006001, 0.199999,91.999984,90.599967, 1.025999,1.020000,1.000000);
						case 108: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144998,0.016999,-0.001000, 0.199999,91.999984,90.599967, 1.025999,1.020000,1.000000);
						case 109: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144998,0.016999,-0.005001, 0.199999,91.999984,90.599967, 1.025999,1.020000,1.000000);
						case 110: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144998,0.016999,-0.005001, 0.199999,91.999984,90.599967, 1.025999,1.020000,1.000000);
						case 111: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132998,0.017999,0.000999, 0.199999,91.999984,90.599967, 1.025999,1.020000,1.000000);
						case 112: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118998,0.014999,0.000999, 0.199999,91.999984,90.599967, 1.025999,1.020000,1.000000);
						case 113: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130998,0.014999,0.000999, 0.199999,91.999984,90.599967, 1.025999,1.020000,1.000000);
						case 114: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148998,0.014999,-0.004000, 0.199999,91.999984,90.599967, 1.025999,1.020000,1.000000);
						case 116: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148998,0.014999,-0.004000, 0.199999,91.999984,90.599967, 1.025999,1.041000,1.000000);
						case 117: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.106998,0.020999,-0.004000, 0.199999,91.999984,90.599967, 1.025999,1.041000,1.000000);
						case 118: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.106998,0.020999,-0.004000, 0.199999,91.999984,90.599967, 1.025999,1.041000,1.000000);
						case 119: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.020999,-0.002000, 0.199999,91.999984,90.599967, 1.025999,1.041000,1.000000);
						case 120: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.006999,0.003999, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 121: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.006999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 122: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.006999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 123: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142998,0.006999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 124: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142998,0.011999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 125: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119998,0.012999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 126: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119998,0.012999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 127: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124998,0.012999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 128: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154998,0.033999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 129: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.089998,0.030999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 130: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.069998,0.030999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 131: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.103998,0.030999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 146: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112998,0.014999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 147: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112998,0.002999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 148: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112998,0.002999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 151: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.150998,0.002999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 154: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.107998,0.002999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 156: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.171998,-0.002000,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 157: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.020999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 160: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122998,0.020999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 162: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122998,0.020999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 163: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112998,0.020999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 164: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112998,0.020999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 165: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112998,0.020999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 166: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112998,0.020999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 169: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112998,-0.001000,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 170: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127998,0.017999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 171: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127998,0.014999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 172: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124998,0.007999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 176: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124998,0.007999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 177: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.174998,0.020999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 179: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132998,0.020999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 180: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.137998,0.008999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 182: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,0.008999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 183: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,0.008999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 184: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,0.008999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 185: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134998,0.017999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 186: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134998,0.009999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 187: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.002999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 188: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.011999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 189: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128998,0.014999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 191: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151998,0.008999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 192: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151998,0.008999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 193: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151998,0.008999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 194: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151998,0.008999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 195: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151998,0.008999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 196: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.096998,0.008999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 199: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.108998,0.008999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 200: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142998,0.016999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 202: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.143998,0.016999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 206: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.143998,0.016999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 207: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.094998,0.016999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 208: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.016999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 210: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.008999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 211: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.010999,-0.000000, 0.199999,91.999984,90.599967, 1.025999,1.094000,1.000000);
						case 212: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.021999,-0.000000, 0.199999,91.999984,90.599967, 0.855999,1.005000,1.000000);
						case 213: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,0.018999,-0.001001, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 214: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,0.001999,-0.001001, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 216: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,0.001999,-0.001001, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 217: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,0.015999,-0.001001, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 218: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,0.015999,-0.001001, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 219: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,0.008999,-0.001001, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 221: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.173998,0.001999,-0.001001, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 222: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.156998,-0.007000,0.000999, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 223: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.179998,0.021999,0.000999, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 224: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134998,-0.004000,0.000999, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 225: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134998,-0.002000,0.000999, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 226: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134998,-0.009000,0.000999, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 227: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,0.022999,0.000999, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 228: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.166998,0.012999,0.000999, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 229: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116998,0.000999,0.000999, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 230: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.102998,0.015999,0.000999, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 233: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132998,0.007999,0.000999, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 234: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.100998,0.007999,0.000999, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 235: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.080998,0.007999,0.000999, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 236: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.103998,0.007999,0.000999, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 237: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130998,-0.002000,0.000999, 0.199999,91.999984,90.599967, 0.947999,1.044000,1.000000);
						case 240: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,0.017999,0.000999, 0.199999,91.999984,90.599967, 1.002999,1.090000,1.000000);
						case 247: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.016000,0.001998, 0.000000,90.000000,82.699989, 1.000000,1.057000,1.000000);
						case 248: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.155998,0.027000,-0.004001, 0.000000,90.000000,82.699989, 1.153000,1.136999,1.000000);
						case 250: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.110998,0.027000,-0.004001, 0.000000,90.000000,82.699989, 1.153000,1.136999,1.000000);
						case 251: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.110998,0.027000,-0.004001, 0.000000,90.000000,82.699989, 1.153000,1.136999,1.000000);
						case 252: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122998,0.020999,-0.004001, 0.000000,90.000000,82.699989, 1.153000,1.136999,1.000000);
						case 258: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126998,0.020999,-0.004001, 0.000000,90.000000,82.699989, 1.153000,1.136999,1.000000);
						case 259: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126998,0.020999,-0.004001, 0.000000,90.000000,82.699989, 1.153000,1.136999,1.000000);
						case 262: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.088998,0.030000,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 263: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128998,0.004999,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 265: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.111998,0.008999,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 266: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.111998,0.005999,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 267: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.111998,0.005999,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 272: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157998,0.016999,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 273: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.007999,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 274: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.014999,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 275: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.021999,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 276: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.021999,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 280: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.021999,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 281: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.021999,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 282: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.021999,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 286: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.021999,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 290: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.011999,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 291: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.166998,0.013999,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 292: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.111998,0.013999,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 294: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.167998,0.016999,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 295: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123998,0.016999,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 296: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.145998,-0.003000,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 297: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.160998,0.009999,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 298: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,0.009999,0.001998, 0.000000,90.000000,82.699989, 0.936000,1.136999,1.000000);
						case 299: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.172998,0.026999,0.001998, 0.000000,90.000000,82.699989, 1.037000,1.136999,1.000000);
						case 300: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125998,0.026999,0.001998, 0.000000,90.000000,82.699989, 1.037000,1.136999,1.000000);
						case 301: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125998,0.026999,0.001998, 0.000000,90.000000,82.699989, 1.037000,1.136999,1.000000);
						case 302: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.016000,0.000998, 0.000000,90.000000,85.500000, 1.000000,1.000000,1.000000);
						case 303: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131998,0.016000,0.000998, 0.000000,90.000000,85.500000, 1.000000,1.000000,1.000000);
						case 304: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131998,0.016000,0.000998, 0.000000,90.000000,85.500000, 1.000000,1.000000,1.000000);
						case 305: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131998,0.016000,0.000998, 0.000000,90.000000,85.500000, 1.000000,1.000000,1.000000);
						case 306: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130998,0.007999,0.000998, 0.000000,90.000000,85.500000, 1.000000,1.000000,1.000000);
						case 308: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130998,0.007999,0.000998, 0.000000,90.000000,85.500000, 1.000000,1.000000,1.000000);
						case 309: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130998,0.007999,0.000998, 0.000000,90.000000,85.500000, 1.000000,1.000000,1.000000);
						case 310: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115997,0.007999,0.000998, 0.000000,90.000000,85.500000, 1.000000,1.000000,1.000000);
						case 311: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115997,0.015000,0.000998, 0.000000,90.000000,85.500000, 1.000000,1.000000,1.000000);
						default: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.137999, 0.010999, 0.002999, 0.199999, 84.099975, 93.500015, 1.059000, 1.072999, 1.000000);
					}
				}
				case 9: {
					switch(skin) {
						case 1: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.016000,-0.014001, -175.400024,173.999984,-178.299957, 1.000000,1.000000,1.072000);
						case 3: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.016000,-0.014001, -175.400024,173.999984,-178.299957, 1.000000,1.167999,1.139000);
						case 4: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.173998,0.009999,-0.011001, -175.400024,173.999984,-178.299957, 1.000000,1.167999,1.139000);
						case 5: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.173998,0.009999,-0.011001, -175.400024,173.999984,-178.299957, 1.000000,1.167999,1.139000);
						case 7: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157998,0.020000,-0.011001, -175.400024,173.999984,-178.299957, 1.000000,1.099000,1.064999);
						case 9: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,0.002000,-0.011001, -175.400024,173.999984,-178.299957, 1.000000,1.099000,1.064999);
						case 11: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,0.002000,-0.015001, -175.400024,173.999984,-178.299957, 1.000000,1.099000,1.064999);
						case 12: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,0.002000,-0.019001, -175.400024,173.999984,-178.299957, 1.000000,1.163000,1.153999);
						case 14: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.022000,-0.007000, -175.400024,173.999984,-178.299957, 1.000000,1.163000,1.153999);
						case 15: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123997,-0.004999,-0.011001, -175.400024,173.999984,-178.299957, 1.000000,1.163000,1.153999);
						case 17: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144998,0.014000,-0.011001, -175.400024,173.999984,-178.299957, 1.000000,1.163000,1.153999);
						case 18: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.109998,0.004999,-0.011001, -175.400024,173.999984,-178.299957, 1.000000,1.163000,1.153999);
						case 20: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144998,0.004999,-0.011001, -175.400024,173.999984,-178.299957, 1.000000,1.163000,1.153999);
						case 21: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,0.012000,-0.016001, -175.400024,173.999984,-178.299957, 1.000000,1.163000,1.153999);
						case 24: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,0.012000,-0.010001, -175.400024,173.999984,-178.299957, 1.000000,0.968000,1.044999);
						case 25: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,0.012000,-0.010001, -175.400024,173.999984,-178.299957, 1.000000,0.968000,1.044999);
						case 26: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157998,0.012999,-0.010001, -175.400024,173.999984,-178.299957, 1.000000,1.120000,1.075000);
						case 28: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,0.000999,-0.018001, -175.400024,173.999984,164.000030, 1.000000,1.120000,1.218999);
						case 30: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,-0.011000,-0.018001, -175.400024,173.999984,164.000030, 1.000000,1.120000,1.218999);
						case 40: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,-0.024000,-0.018001, -175.400024,173.999984,164.000030, 1.000000,1.120000,1.218999);
						case 43: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.093998,-0.004000,-0.009000, -175.400024,173.999984,164.000030, 0.954999,0.989000,1.042999);
						case 44: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,0.016999,-0.010001, -175.400024,173.999984,164.000030, 0.954999,0.989000,1.042999);
						case 45: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113998,-0.010000,-0.016001, -175.400024,173.999984,164.000030, 0.954999,1.049000,1.042999);
						case 46: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.156997,-0.006000,-0.016001, -175.400024,173.999984,164.000030, 0.954999,1.049000,1.042999);
						case 47: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.156997,-0.006000,-0.016001, -175.400024,173.999984,164.000030, 0.954999,1.049000,1.042999);
						case 48: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.156997,-0.031000,-0.022001, -175.400024,173.999984,164.000030, 0.954999,1.049000,1.146000);
						case 49: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132997,0.003999,-0.016001, -175.400024,173.999984,164.000030, 0.954999,1.049000,1.146000);
						case 54: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136997,0.014999,-0.016001, -175.400024,173.999984,164.000030, 0.954999,1.049000,1.146000);
						case 55: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141997,-0.033000,-0.016001, -175.400024,173.999984,164.000030, 0.954999,1.049000,1.146000);
						case 56: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134997,-0.033000,-0.018001, -175.400024,173.999984,164.000030, 0.954999,1.049000,1.146000);
						case 57: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.177997,0.000999,-0.018001, -175.400024,173.999984,164.000030, 0.954999,1.049000,1.146000);
						case 58: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123997,-0.013000,-0.018001, -175.400024,173.999984,164.000030, 0.954999,0.982000,1.019999);
						case 59: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.167997,-0.013000,-0.016001, -175.400024,173.999984,164.000030, 0.954999,1.126000,1.019999);
						case 60: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140997,-0.001000,-0.015001, -175.400024,173.999984,164.000030, 0.954999,1.126000,1.019999);
						case 66: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.133997,0.005999,-0.011001, -175.400024,173.999984,164.000030, 0.954999,1.005999,1.019999);
						case 67: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142997,0.003999,-0.011001, -175.400024,173.999984,164.000030, 0.954999,0.952999,1.019999);
						case 68: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134997,0.007999,-0.014001, -175.400024,173.999984,164.000030, 0.954999,0.952999,1.019999);
						case 69: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136997,-0.023000,-0.014001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.019999);
						case 70: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136997,0.012999,-0.004000, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.019999);
						case 72: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127997,0.021999,-0.012001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.019999);
						case 76: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.137997,-0.026000,-0.014001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 82: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.186997,0.000999,-0.014001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 83: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.187997,-0.014000,-0.014001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 84: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.187997,-0.014000,-0.014001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 86: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.121997,-0.014000,-0.014001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 90: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147997,-0.014000,-0.014001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 91: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147997,-0.027000,-0.014001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 93: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.143997,-0.024000,-0.014001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 95: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127997,-0.024000,-0.014001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 96: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140997,-0.004000,-0.012001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 97: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134997,-0.014000,-0.016001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 98: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.152997,0.003999,-0.012001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 100: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.166997,-0.022000,-0.012001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 101: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157997,-0.022000,-0.013001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 103: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.156997,-0.028000,-0.013001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 105: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154997,-0.028000,-0.015001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 106: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154997,-0.021000,-0.015001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 108: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151997,-0.002000,-0.015001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 109: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151997,-0.002000,-0.018001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 110: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151997,-0.009000,-0.018001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 111: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142997,-0.005000,-0.018001, -175.400024,173.999984,164.000030, 0.954999,1.061000,1.054000);
						case 112: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119997,-0.005000,-0.013001, -175.400024,173.999984,164.000030, 0.954999,0.959000,0.932000);
						case 113: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.167997,-0.016000,-0.013001, -175.400024,173.999984,164.000030, 0.954999,0.959000,0.932000);
						case 114: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.167997,-0.016000,-0.019001, -175.400024,173.999984,164.000030, 0.954999,1.028000,0.971000);
						case 116: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.167997,-0.016000,-0.020001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.028000);
						case 117: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125997,0.005999,-0.020001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.028000);
						case 118: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125997,0.005999,-0.015001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.028000);
						case 119: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125997,0.005999,-0.012001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 120: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.150997,-0.024000,-0.012001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 121: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.150997,-0.022000,-0.016001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 122: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.133997,-0.018000,-0.012001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 123: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.156997,-0.018000,-0.019001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 124: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.167997,-0.018000,-0.014001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 125: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141997,0.000999,-0.014001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 126: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151997,-0.024000,-0.009000, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 127: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151997,-0.010000,-0.009000, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 128: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.163997,0.019999,-0.017001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 138: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132997,-0.024000,-0.012001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 139: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132997,-0.024000,-0.012001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 141: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132997,-0.024000,-0.012001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 145: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144997,-0.014000,-0.012001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 146: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144997,-0.014000,-0.012001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 147: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124997,-0.022000,-0.012001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 148: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148997,-0.033000,-0.012001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 150: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148997,-0.022000,-0.012001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 151: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.178997,-0.028000,-0.012001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 154: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123997,-0.014000,-0.016001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 156: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.179997,-0.042000,-0.016001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 157: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135997,-0.014000,-0.016001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 160: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.114997,0.002999,-0.016001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 162: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.152997,-0.001000,-0.019001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 163: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129997,-0.001000,-0.017001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 164: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123997,0.000999,-0.017001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 165: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132997,-0.005000,-0.008000, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 166: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132997,-0.005000,-0.008000, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 169: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132997,-0.022000,-0.013001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 170: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.145997,-0.009000,-0.017001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 171: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.163997,-0.025000,-0.017001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 172: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142998,-0.016000,-0.016001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 176: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.167998,-0.029000,-0.016001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 179: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159998,-0.016000,-0.018001, -175.400024,173.999984,164.000030, 0.954999,1.028000,1.059000);
						case 180: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159998,-0.021000,-0.018001, -175.400024,173.999984,164.000030, 0.954999,1.128000,1.059000);
						case 182: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125998,-0.003000,-0.014001, -175.400024,173.999984,164.000030, 0.954999,1.015999,1.009000);
						case 183: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125998,-0.003000,-0.014001, -175.400024,173.999984,164.000030, 0.954999,1.015999,1.009000);
						case 184: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125998,-0.006000,-0.014001, -175.400024,173.999984,164.000030, 0.954999,1.068999,1.009000);
						case 185: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157998,-0.012000,-0.014001, -175.400024,173.999984,164.000030, 0.954999,1.109999,1.009000);
						case 186: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.150998,-0.016000,-0.014001, -175.400024,173.999984,164.000030, 0.954999,1.109999,1.009000);
						case 187: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128998,-0.022000,-0.004000, -175.400024,173.999984,164.000030, 0.954999,1.109999,1.009000);
						case 188: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128998,-0.001000,-0.012001, -175.400024,173.999984,164.000030, 0.954999,1.109999,1.009000);
						case 189: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.155998,-0.016000,-0.012001, -175.400024,173.999984,164.000030, 0.954999,1.109999,1.009000);
						case 191: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.155998,-0.028000,-0.016001, -175.400024,173.999984,153.500061, 0.954999,1.109999,1.070000);
						case 192: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.155998,-0.037000,-0.020000, -175.400024,173.999984,153.500061, 0.954999,1.109999,1.070000);
						case 193: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.155998,-0.023000,-0.017000, -175.400024,173.999984,153.500061, 0.954999,1.109999,1.070000);
						case 194: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.155998,-0.033000,-0.019000, -175.400024,173.999984,153.500061, 0.954999,1.109999,1.070000);
						case 195: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.162998,-0.041000,-0.019000, -175.400024,173.999984,153.500061, 1.074999,1.109999,1.146000);
						case 200: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,-0.023000,-0.019000, -175.400024,173.999984,153.500061, 1.074999,1.109999,1.146000);
						case 206: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,-0.002000,-0.013000, -175.400024,173.999984,153.500061, 1.074999,1.014999,1.043999);
						case 207: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.101998,-0.004000,-0.013000, -175.400024,173.999984,153.500061, 1.074999,1.014999,1.043999);
						case 208: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123998,0.002999,-0.013000, -175.400024,173.999984,153.500061, 1.074999,1.014999,1.043999);
						case 210: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123998,-0.018000,-0.013000, -175.400024,173.999984,153.500061, 1.074999,1.014999,1.043999);
						case 211: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148998,-0.033000,-0.013000, -175.400024,173.999984,153.500061, 1.074999,1.014999,1.043999);
						case 213: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142998,-0.025000,-0.013000, -175.400024,173.999984,153.500061, 1.074999,1.014999,1.043999);
						case 217: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142998,-0.019000,-0.013000, -175.400024,173.999984,153.500061, 1.074999,1.014999,1.043999);
						case 219: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142998,-0.045000,-0.013000, -175.400024,173.999984,153.500061, 1.074999,1.014999,1.043999);
						case 221: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.175998,-0.039000,-0.006000, -175.400024,173.999984,153.500061, 1.074999,1.139999,1.159999);
						case 222: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146998,-0.041000,-0.013000, -175.400024,173.999984,153.500061, 1.074999,1.139999,1.159999);
						case 223: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.165998,0.010999,-0.013000, -175.400024,173.999984,169.400070, 1.074999,1.178999,1.187999);
						case 226: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.114998,-0.015000,-0.013000, -175.400024,173.999984,169.400070, 1.074999,1.178999,1.187999);
						case 227: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.158998,0.012999,-0.013000, -175.400024,173.999984,169.400070, 1.074999,1.178999,1.187999);
						case 228: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.158998,-0.003000,-0.013000, -175.400024,173.999984,169.400070, 1.074999,1.178999,1.187999);
						case 229: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,-0.006000,-0.013000, -175.400024,173.999984,169.400070, 1.074999,1.178999,1.187999);
						case 233: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128998,-0.009000,-0.013000, -175.400024,173.999984,169.400070, 1.074999,1.178999,1.187999);
						case 234: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128998,-0.018000,-0.013000, -175.400024,173.999984,169.400070, 1.074999,1.056999,1.038999);
						case 235: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.102998,-0.011000,-0.013000, -175.400024,173.999984,169.400070, 1.074999,1.056999,1.038999);
						case 236: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.102998,-0.004000,-0.013000, -175.400024,173.999984,169.400070, 1.074999,1.056999,1.038999);
						case 237: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,-0.018000,-0.013000, -175.400024,173.999984,169.400070, 1.074999,1.056999,1.038999);
						case 240: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.155998,-0.009000,-0.015000, -175.400024,173.999984,169.400070, 1.074999,1.056999,1.068999);
						case 247: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154998,-0.011000,-0.015000, -175.400024,173.999984,169.400070, 1.074999,1.101999,1.106000);
						case 248: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.187998,-0.023000,-0.011000, -175.400024,173.999984,158.000030, 1.074999,1.101999,1.183000);
						case 250: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.137998,-0.010000,-0.020000, -175.400024,173.999984,158.000030, 1.074999,1.101999,1.075000);
						case 251: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130998,-0.013000,-0.013000, -175.400024,173.999984,158.000030, 1.074999,1.101999,1.075000);
						case 252: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.153998,-0.029000,-0.011000, -175.400024,173.999984,158.000030, 1.074999,1.101999,1.075000);
						case 258: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.143998,-0.019000,-0.013000, -175.400024,173.999984,158.000030, 1.074999,1.101999,1.137000);
						case 259: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.143998,-0.030000,-0.013000, -175.400024,173.999984,158.000030, 1.074999,1.101999,1.137000);
						case 262: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,-0.004000,-0.013000, -175.400024,173.999984,158.000030, 1.074999,0.955999,0.924000);
						case 265: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136998,-0.016000,-0.014000, -175.400024,173.999984,158.000030, 1.074999,0.955999,0.924000);
						case 266: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136998,-0.021000,-0.014000, -175.400024,173.999984,158.000030, 1.074999,1.033999,1.004000);
						case 267: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136998,-0.027000,-0.012000, -175.400024,173.999984,158.000030, 1.074999,1.087999,1.044000);
						case 272: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141998,-0.008000,-0.012000, -175.400024,173.999984,158.000030, 1.074999,1.087999,1.044000);
						case 273: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118998,-0.012000,-0.016000, -175.400024,173.999984,158.000030, 1.074999,1.087999,1.044000);
						case 274: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118998,-0.006000,-0.016000, -175.400024,173.999984,158.000030, 1.074999,1.087999,1.044000);
						case 275: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130998,-0.011000,-0.016000, -175.400024,173.999984,158.000030, 1.074999,0.970999,1.044000);
						case 280: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148998,-0.013000,-0.016000, -175.400024,173.999984,158.000030, 1.074999,0.970999,1.044000);
						case 281: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148998,-0.021000,-0.016000, -175.400024,173.999984,158.000030, 1.074999,0.970999,1.044000);
						case 282: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148998,-0.018000,-0.016000, -175.400024,173.999984,158.000030, 1.074999,0.970999,1.044000);
						case 286: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148998,-0.018000,-0.016000, -175.400024,173.999984,158.000030, 1.074999,0.970999,1.044000);
						case 290: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141998,-0.019000,-0.016000, -175.400024,173.999984,158.000030, 1.074999,0.970999,1.044000);
						case 291: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.176998,-0.031000,-0.016000, -175.400024,173.999984,158.000030, 1.074999,0.970999,1.044000);
						case 292: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127998,-0.015000,-0.016000, -175.400024,173.999984,158.000030, 1.074999,0.970999,1.044000);
						case 294: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.160998,-0.028000,-0.013000, -175.400024,173.999984,158.000030, 1.074999,0.970999,1.044000);
						case 295: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.032000,-0.016000, -175.400024,173.999984,158.000030, 1.074999,0.970999,1.044000);
						case 296: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134998,-0.072000,-0.016000, -175.400024,173.999984,139.900024, 1.074999,0.970999,1.044000);
						case 297: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.163998,-0.020000,-0.016000, -175.400024,173.999984,160.200042, 1.074999,1.187999,1.098000);
						case 298: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.137998,-0.005000,-0.016000, -175.400024,173.999984,160.200042, 1.074999,1.187999,1.098000);
						case 299: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.166998,0.001999,-0.016000, -175.400024,173.999984,160.200042, 1.074999,1.187999,1.098000);
						case 300: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.145998,-0.010000,-0.016000, -175.400024,173.999984,160.200042, 1.074999,0.985999,1.020999);
						case 301: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.145998,-0.010000,-0.016000, -175.400024,173.999984,160.200042, 1.074999,0.985999,1.020999);
						case 302: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.145998,-0.010000,-0.012000, -175.400024,173.999984,160.200042, 1.074999,0.985999,1.020999);
						case 303: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.145998,-0.010000,-0.012000, -175.400024,173.999984,160.200042, 1.074999,0.985999,1.020999);
						case 304: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.145998,-0.010000,-0.012000, -175.400024,173.999984,160.200042, 1.074999,0.985999,1.020999);
						case 305: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.145998,-0.010000,-0.012000, -175.400024,173.999984,160.200042, 1.074999,0.985999,1.020999);
						case 306: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154998,-0.036000,-0.017000, -175.400024,173.999984,160.200042, 1.074999,0.985999,1.020999);
						case 307: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146998,-0.028000,-0.017000, -175.400024,173.999984,160.200042, 1.074999,0.985999,1.020999);
						case 308: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154998,-0.036000,-0.014000, -175.400024,173.999984,160.200042, 1.074999,0.985999,1.020999);
						case 309: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154998,-0.036000,-0.014000, -175.400024,173.999984,160.200042, 1.074999,0.985999,1.020999);
						case 310: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141998,-0.011000,-0.014000, -175.400024,173.999984,160.200042, 1.074999,0.985999,1.020999);
						case 311: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141998,-0.011000,-0.014000, -175.400024,173.999984,160.200042, 1.074999,0.985999,1.020999);
						default: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144000, 0.008000, -0.012000, 0.000000, 0.000000, 0.000000, 1.113000, 1.064000, 1.197000);
					}
				}
				case 10: {
					switch(skin) {
						case 1: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148998,-0.014000,-0.001001, 0.000000,179.400024,-154.400009, 1.000000,1.000000,1.070000);
						case 3: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148998,-0.014000,-0.001001, 0.000000,179.400024,-154.400009, 1.000000,1.000000,1.070000);
						case 4: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159998,-0.014000,-0.008000, 0.000000,179.400024,-154.400009, 1.000000,1.000000,1.126000);
						case 5: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157998,0.014000,-0.002001, 0.000000,0.600003,13.600016, 1.000000,1.000000,1.000000);
						case 7: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157998,0.014000,-0.002001, 0.000000,0.600003,-0.099983, 1.000000,1.000000,1.000000);
						case 9: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157998,-0.001000,-0.002001, 0.000000,0.600003,-0.099983, 1.000000,1.000000,1.000000);
						case 10: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146998,0.000999,-0.002001, 0.000000,0.600003,-0.099983, 1.000000,1.000000,1.000000);
						case 11: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146998,0.000999,-0.002001, 0.000000,0.600003,-0.099983, 1.000000,1.000000,1.000000);
						case 12: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146998,-0.008000,-0.002001, 0.000000,0.600003,-0.099983, 1.000000,1.000000,1.000000);
						case 14: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146998,0.007000,0.003998, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.000000);
						case 15: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119997,-0.027000,-0.000001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.000000);
						case 17: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.137998,0.001000,-0.000001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.000000);
						case 18: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130998,-0.007999,-0.000001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.000000);
						case 20: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.152998,-0.007999,-0.000001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.000000);
						case 21: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.152998,-0.004999,-0.000001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.000000);
						case 25: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.133998,0.005000,-0.000001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.000000);
						case 26: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157998,0.000000,-0.000001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.000000);
						case 28: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.015000,-0.000001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.000000);
						case 30: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144998,0.011000,-0.000001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.000000);
						case 40: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144998,-0.006999,-0.000001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.000000);
						case 43: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.099998,0.000000,-0.000001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.000000);
						case 44: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.024000,-0.000001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.000000);
						case 45: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,-0.004999,-0.000001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.000000);
						case 46: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142998,0.016000,-0.000001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.000000);
						case 47: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142998,0.007000,-0.003001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.037000);
						case 48: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.161998,-0.008999,-0.002001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 49: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128998,0.013000,-0.002001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 54: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128998,0.028000,0.000998, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 55: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128998,-0.009999,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 56: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128998,-0.012000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 57: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.161998,0.010000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 58: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122998,0.000999,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 59: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.180998,0.000999,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 60: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151998,0.000999,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 66: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151998,0.008000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 67: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151998,0.008000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 68: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151998,0.017000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 69: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136998,-0.004000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 70: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147998,0.012000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 72: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,0.017000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 73: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,0.006999,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 76: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,-0.013000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 82: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.196998,0.012000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 83: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.180998,0.002999,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 84: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.180998,-0.005000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 86: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124998,-0.005000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 90: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146998,-0.005000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 91: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146998,-0.010000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 95: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124998,-0.012000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 96: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148998,0.000999,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 97: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148998,0.000999,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 98: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.153998,0.011000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 100: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.153998,-0.000000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 101: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.163998,-0.004000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 102: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.152998,-0.004000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 103: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.173998,-0.008000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 105: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.173998,-0.013000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 106: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.173998,-0.013000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 108: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.173998,0.003999,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 109: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.173998,-0.003000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 110: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.173998,-0.003000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 111: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157998,0.000999,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 112: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.000999,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 113: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,0.000999,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 114: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.169998,0.000999,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 116: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.169998,0.000999,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 117: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122998,0.016000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 118: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122998,0.023000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 119: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134998,0.006999,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 120: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134998,-0.003000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 121: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134998,-0.004000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 122: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134998,-0.004000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 123: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144998,0.000999,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 125: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144998,0.010999,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 126: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144998,-0.005000,-0.001001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 127: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144998,-0.005000,0.001998, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 128: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.174998,0.007999,0.001998, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 147: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125998,-0.011000,0.001998, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 148: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125998,-0.011000,0.001998, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 151: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.167998,-0.012000,0.001998, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 154: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127998,-0.012000,0.001998, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 156: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.174998,-0.022000,0.002999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 160: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122998,0.010999,0.002999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 162: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154998,0.010999,0.002999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 163: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132998,0.000999,0.002999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 164: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132998,0.000999,0.002999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 165: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132998,0.000999,0.002999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 166: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132998,0.000999,0.002999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 169: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147998,-0.016000,0.002999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 170: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136998,0.007000,-0.005001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 171: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.158998,-0.008999,-0.003001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 172: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,-0.001999,-0.003001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 176: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,-0.001999,-0.003001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 179: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,-0.001999,-0.003001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 180: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148998,-0.001999,-0.003001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 182: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131998,-0.001999,-0.003001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 183: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131998,0.007000,-0.003001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 184: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131998,0.007000,-0.003001, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 185: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144998,0.003000,0.002999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 186: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144998,-0.011000,0.002999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 187: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,-0.011000,0.002999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 188: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,0.005000,0.002999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 189: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147998,-0.004999,0.002999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 191: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.164998,-0.010999,0.002999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 192: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.164998,-0.010999,0.002999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 193: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.164998,-0.010999,0.002999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 194: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.164998,-0.010999,0.002999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 200: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.143998,0.003000,0.002999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 206: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.143998,0.007000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 207: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118998,0.006000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 208: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132998,0.009000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 210: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.111998,0.001000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 212: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115998,0.007000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 213: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129998,0.000000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 214: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131998,-0.010999,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 217: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.152998,-0.005999,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 221: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.169998,-0.010999,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 222: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.169998,-0.020000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 223: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.176998,0.017000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 226: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124998,-0.012999,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 227: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.155998,0.012000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 228: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.166998,0.003000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 229: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119998,-0.011000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 234: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119998,-0.011000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 235: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.095998,-0.011000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 236: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.109998,-0.000000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 240: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.150998,-0.000000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 247: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.160998,-0.006000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.000000,1.069000);
						case 248: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.188998,0.001999,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.031999,1.069000);
						case 250: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130998,0.001999,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.031999,1.069000);
						case 252: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.143998,-0.010000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.031999,1.069000);
						case 254: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159998,-0.010000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.031999,1.069000);
						case 258: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.156998,-0.002000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.031999,1.069000);
						case 259: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.156998,-0.002000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.031999,1.146000);
						case 262: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.121998,0.012000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.031999,1.146000);
						case 265: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117998,0.011000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,1.031999,1.146000);
						case 266: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117998,-0.002999,0.001999, 0.000000,0.600003,-6.399982, 1.000000,0.956999,1.049000);
						case 267: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117998,-0.002999,0.001999, 0.000000,0.600003,-6.399982, 1.000000,0.956999,1.049000);
						case 272: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159998,-0.003999,0.001999, 0.000000,0.600003,-6.399982, 1.000000,0.956999,1.049000);
						case 273: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.121998,-0.003999,0.001999, 0.000000,0.600003,-6.399982, 1.000000,0.956999,1.049000);
						case 274: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.121998,0.011000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,0.956999,1.049000);
						case 275: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.121998,0.004000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,0.956999,1.049000);
						case 276: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,0.004000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,0.956999,1.049000);
						case 280: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126998,0.007000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,0.956999,1.049000);
						case 281: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126998,0.007000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,0.956999,1.049000);
						case 282: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126998,0.007000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,0.956999,1.049000);
						case 286: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130998,0.007000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,0.956999,1.049000);
						case 290: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,-0.004999,0.001999, 0.000000,0.600003,-6.399982, 1.000000,0.956999,1.049000);
						case 291: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.168998,0.004000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,0.990999,1.049000);
						case 292: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.133998,0.004000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,0.990999,1.049000);
						case 294: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151998,0.012000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,0.990999,1.049000);
						case 295: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131998,0.000000,0.001999, 0.000000,0.600003,-6.399982, 1.000000,0.990999,1.049000);
						case 296: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141998,-0.008999,0.001999, 0.000000,0.600003,-6.399982, 1.000000,0.990999,1.049000);
						case 297: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.003999,0.001999, 0.000000,0.600003,-6.399982, 1.075999,1.065999,1.049000);
						case 298: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.152998,-0.007999,0.001999, 0.000000,0.600003,-6.399982, 1.075999,1.065999,1.049000);
						case 299: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159998,0.020000,0.001999, 0.000000,0.600003,-6.399982, 1.075999,1.065999,1.049000);
						case 300: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146999,0.002000,0.001999, 0.000000,0.600003,-6.399982, 1.051999,0.800999,0.970000);
						case 301: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146999,0.002000,0.001999, 0.000000,0.600003,-6.399982, 1.051999,0.849999,0.970000);
						case 302: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154999,0.006000,0.001999, 0.000000,0.600003,-6.399982, 1.051999,0.849999,0.970000);
						case 303: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154999,0.006000,0.001999, 0.000000,0.600003,-6.399982, 1.051999,0.849999,0.970000);
						case 304: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154999,0.006000,0.001999, 0.000000,0.600003,-6.399982, 1.051999,0.849999,0.970000);
						case 305: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154999,0.006000,0.001999, 0.000000,0.600003,-6.399982, 1.051999,0.849999,0.970000);
						case 310: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.150999,-0.004999,0.001999, 0.000000,0.600003,-6.399982, 1.051999,0.849999,0.970000);
						case 311: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.150999,-0.004999,0.001999, 0.000000,0.600003,-6.399982, 1.051999,0.849999,0.970000);
						default: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.131999, 0.013000, 0.000000, 0.000000, 0.000000, 0.000000, 1.102000, 1.000000, 1.102999);
					}
				}
				case 11: {
					switch(skin) {
						case 1: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.156998,-0.007000,0.012999, 0.000000,173.499969,-154.900054, 1.151999,1.000000,1.145000);
						case 3: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.156998,-0.015000,0.012999, 0.000000,173.499969,-149.600036, 1.205000,1.089999,1.200000);
						case 4: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.183998,-0.015000,0.012999, 0.000000,173.499969,-149.600036, 1.205000,1.089999,1.200000);
						case 5: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.166998,-0.026000,0.008998, 0.000000,173.499969,-149.600036, 1.123000,1.089999,1.200000);
						case 7: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157998,-0.013000,0.008998, 0.000000,173.499969,-149.600036, 1.123000,1.089999,1.200000);
						case 9: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157998,-0.023000,0.009998, 0.000000,173.499969,-149.600036, 1.123000,1.089999,1.200000);
						case 10: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.145998,-0.023000,0.009998, 0.000000,173.499969,-149.600036, 1.123000,1.089999,1.200000);
						case 11: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,-0.023000,0.006998, 0.000000,177.799987,-149.600036, 1.123000,1.089999,1.200000);
						case 12: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,-0.023000,0.006998, 0.000000,177.799987,-149.600036, 1.123000,1.089999,1.200000);
						case 14: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154998,-0.003000,-0.003001, -177.599960,177.799987,169.899948, 1.123000,1.089999,1.200000);
						case 15: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119998,-0.026000,-0.003001, -177.599960,177.799987,169.899948, 1.123000,1.089999,1.200000);
						case 17: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151998,0.002999,-0.003001, -177.599960,177.799987,169.899948, 1.123000,1.089999,1.200000);
						case 18: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.121998,-0.002000,-0.003001, -177.599960,177.799987,169.899948, 1.123000,1.089999,1.200000);
						case 20: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.156998,-0.002000,-0.003001, -177.599960,177.799987,169.899948, 1.123000,1.089999,1.200000);
						case 21: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.156998,-0.002000,-0.005001, -177.599960,179.399978,169.899948, 1.123000,1.089999,1.200000);
						case 25: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141998,-0.002000,-0.005001, -177.599960,179.399978,169.899948, 1.123000,1.089999,1.200000);
						case 26: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141998,-0.002000,-0.005001, -177.599960,179.399978,169.899948, 1.123000,1.089999,1.200000);
						case 28: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141998,0.004999,-0.005001, -177.599960,179.399978,169.899948, 1.123000,1.089999,1.200000);
						case 30: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,-0.000000,-0.005001, -177.599960,179.399978,169.899948, 1.123000,1.089999,1.200000);
						case 39: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,-0.000000,-0.005001, -177.599960,179.399978,169.899948, 1.123000,1.089999,1.200000);
						case 40: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.133998,-0.012999,0.000998, -177.599960,179.399978,169.899948, 1.123000,1.089999,1.200000);
						case 43: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.095998,-0.012999,0.000998, -177.599960,179.399978,169.899948, 1.123000,1.089999,1.200000);
						case 44: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.121998,0.008000,0.000998, -177.599960,179.399978,169.899948, 1.123000,1.089999,1.200000);
						case 45: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123998,0.008000,0.000998, -177.599960,179.399978,169.899948, 1.123000,1.089999,1.200000);
						case 46: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.143998,0.008000,0.000998, -177.599960,179.399978,169.899948, 1.123000,1.089999,1.200000);
						case 47: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.143998,0.008000,0.000998, -177.599960,179.399978,169.899948, 1.123000,1.089999,1.200000);
						case 48: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.169998,-0.019999,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 49: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.143998,-0.007999,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 50: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.155998,-0.020000,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 55: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128998,-0.020000,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 56: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128998,-0.020000,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 57: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.173998,-0.001000,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 58: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.137998,-0.001000,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 59: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147998,0.007999,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 60: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147998,0.003999,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 66: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147998,0.003999,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 67: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159998,0.003999,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 68: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159998,0.003999,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 69: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141998,-0.010000,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 70: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141998,0.000999,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 72: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148998,0.000999,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 73: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148998,0.000999,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 76: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148998,-0.018000,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 78: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148998,-0.018000,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 79: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.137998,-0.018000,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 86: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.018000,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 90: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134998,-0.018000,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 91: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134998,-0.018000,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 95: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.018000,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 96: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.018000,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 97: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132998,-0.012000,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 98: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.155998,0.001999,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 100: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147998,-0.003000,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 101: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147998,-0.003000,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 102: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147998,-0.003000,-0.004001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 106: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147998,-0.003000,-0.009001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 111: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159998,-0.003000,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 112: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.003000,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 113: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.003000,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 117: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.003000,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 118: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.003000,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 119: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.003000,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 120: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.003000,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 121: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.003000,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 122: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.003000,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 123: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.003000,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 124: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.003000,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 125: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.003000,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 126: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.003000,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 127: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.003000,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 128: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.175998,0.002999,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 147: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146998,-0.002000,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 148: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146998,-0.002000,-0.006001, -177.599960,179.399978,169.899948, 1.204000,1.089999,1.200000);
						case 154: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124998,-0.011000,-0.005001, -177.599960,179.399978,169.899948, 1.196000,1.089999,1.130000);
						case 156: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.162998,-0.011000,-0.005001, -177.599960,179.399978,169.899948, 1.325999,1.204999,1.345000);
						case 160: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147998,-0.016000,-0.005001, -177.599960,179.399978,169.899948, 1.325999,1.204999,1.345000);
						case 162: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.163998,-0.016000,-0.005001, -177.599960,179.399978,169.899948, 1.325999,1.204999,1.345000);
						case 163: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147998,-0.016000,-0.005001, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 164: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147998,-0.016000,-0.005001, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 165: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147998,-0.016000,-0.005001, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 166: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147998,-0.007000,-0.005001, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 169: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147998,-0.024000,0.001998, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 170: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.152998,-0.002000,0.001998, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 171: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.152998,-0.007000,0.001998, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 176: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157998,-0.007000,-0.008001, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 179: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157998,-0.007000,-0.008001, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 180: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157998,-0.007000,-0.008001, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 182: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151998,-0.007000,-0.008001, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 183: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159998,-0.007000,-0.008001, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 184: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159998,-0.007000,-0.008001, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 185: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159998,-0.007000,-0.008001, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 186: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159998,-0.007000,-0.008001, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 187: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141998,-0.007000,0.002998, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 188: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.150998,-0.007000,-0.003001, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 189: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.150998,-0.007000,-0.003001, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 191: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.166998,-0.007000,-0.003001, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 192: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.174998,-0.025000,-0.003001, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 193: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.174998,-0.025000,-0.003001, -177.599960,179.399978,169.899948, 1.247000,1.058999,1.216000);
						case 200: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159998,-0.012000,-0.003001, -177.599960,179.399978,169.899948, 1.228000,1.058999,1.356000);
						case 206: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159998,-0.002000,-0.003001, -177.599960,179.399978,169.899948, 1.228000,1.058999,1.356000);
						case 208: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159998,-0.002000,-0.003001, -177.599960,179.399978,169.899948, 1.228000,1.058999,1.356000);
						case 210: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141998,-0.008000,-0.003001, -177.599960,179.399978,169.899948, 1.228000,1.058999,1.356000);
						case 213: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141998,-0.008000,-0.003001, -177.599960,179.399978,169.899948, 1.228000,1.058999,1.356000);
						case 217: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.008000,-0.003001, -177.599960,179.399978,169.899948, 1.228000,1.058999,1.356000);
						case 221: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.008000,-0.003001, -177.599960,179.399978,169.899948, 1.228000,1.058999,1.356000);
						case 222: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151998,-0.019999,-0.003001, -177.599960,179.399978,169.899948, 1.228000,1.058999,1.356000);
						case 223: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.165998,0.013000,-0.003001, -177.599960,179.399978,169.899948, 1.281000,1.058999,1.356000);
						case 227: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.165998,-0.001999,-0.003001, -177.599960,179.399978,169.899948, 1.281000,1.058999,1.356000);
						case 228: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.165998,-0.001999,-0.003001, -177.599960,179.399978,169.899948, 1.281000,1.058999,1.356000);
						case 229: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.145998,-0.012999,-0.003001, -177.599960,179.399978,169.899948, 1.281000,1.058999,1.356000);
						case 234: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139998,-0.017999,-0.003001, -177.599960,179.399978,169.899948, 1.231000,1.058999,1.273000);
						case 235: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117998,-0.017999,-0.003001, -177.599960,179.399978,169.899948, 1.231000,1.058999,1.273000);
						case 236: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132998,-0.007999,-0.003001, -177.599960,179.399978,169.899948, 1.231000,1.058999,1.273000);
						case 240: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.155998,-0.002999,-0.003001, -177.599960,179.399978,169.899948, 1.231000,1.058999,1.273000);
						case 247: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.152998,-0.002999,-0.003001, -177.599960,179.399978,169.899948, 1.305000,1.058999,1.273000);
						case 250: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.161998,-0.002999,-0.003001, -177.599960,179.399978,169.899948, 1.305000,1.058999,1.273000);
						case 252: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.161998,-0.012999,-0.003001, -177.599960,179.399978,169.899948, 1.305000,1.058999,1.273000);
						case 254: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.161998,-0.012999,-0.003001, -177.599960,179.399978,169.899948, 1.305000,1.058999,1.273000);
						case 258: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.169998,-0.012999,-0.003001, -177.599960,179.399978,169.899948, 1.305000,1.058999,1.273000);
						case 259: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.157998,-0.012999,-0.003001, -177.599960,179.399978,169.899948, 1.305000,1.058999,1.273000);
						case 262: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.012999,-0.003001, -177.599960,179.399978,169.899948, 1.305000,1.058999,1.273000);
						case 265: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.012999,-0.003001, -177.599960,179.399978,169.899948, 1.305000,1.058999,1.273000);
						case 266: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.166998,-0.021999,-0.003001, -177.599960,179.399978,169.899948, 1.305000,1.058999,1.273000);
						case 267: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.166998,-0.021999,-0.003001, -177.599960,179.399978,169.899948, 1.305000,1.058999,1.273000);
						case 272: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.166998,-0.007999,-0.005001, -177.599960,179.399978,169.899948, 1.305000,1.058999,1.273000);
						case 273: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149998,-0.007999,-0.005001, -177.599960,179.399978,169.899948, 1.305000,1.058999,1.273000);
						case 274: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159998,-0.007999,-0.005001, -177.599960,179.399978,169.899948, 1.197000,1.058999,1.191000);
						case 275: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159998,-0.007999,-0.005001, -177.599960,179.399978,169.899948, 1.197000,1.058999,1.191000);
						case 276: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159998,-0.007999,-0.005001, -177.599960,179.399978,169.899948, 1.197000,1.058999,1.191000);
						case 280: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148998,-0.007999,-0.005001, -177.599960,179.399978,169.899948, 1.197000,1.058999,1.191000);
						case 281: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148998,-0.007999,-0.005001, -177.599960,179.399978,169.899948, 1.197000,1.058999,1.191000);
						case 282: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.158998,-0.007999,-0.005001, -177.599960,179.399978,169.899948, 1.197000,1.058999,1.191000);
						case 286: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.158998,-0.007999,-0.005001, -177.599960,179.399978,169.899948, 1.197000,1.058999,1.191000);
						case 290: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.158998,-0.019999,-0.005001, -177.599960,179.399978,169.899948, 1.197000,1.058999,1.191000);
						case 291: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.164998,0.001000,-0.005001, -177.599960,179.399978,169.899948, 1.197000,1.058999,1.191000);
						case 292: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140998,-0.002999,-0.005001, -177.599960,179.399978,169.899948, 1.197000,1.058999,1.191000);
						case 294: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.168998,-0.002999,-0.005001, -177.599960,179.399978,169.899948, 1.197000,1.058999,1.191000);
						case 295: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134998,-0.002999,-0.005001, -177.599960,179.399978,169.899948, 1.197000,1.058999,1.191000);
						case 296: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154998,-0.008999,-0.005001, -177.599960,179.399978,169.899948, 1.197000,1.058999,1.191000);
						case 297: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154998,-0.009999,-0.005001, -177.599960,179.399978,169.899948, 1.197000,1.058999,1.191000);
						case 298: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.161998,-0.009999,-0.005001, -177.599960,179.399978,169.899948, 1.197000,1.058999,1.191000);
						case 299: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.197998,0.000000,-0.005001, -177.599960,179.399978,169.899948, 1.332000,1.058999,1.191000);
						case 300: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.133998,0.000000,-0.005001, -177.599960,179.399978,169.899948, 1.054000,1.029999,1.130000);
						case 301: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,0.000000,-0.005001, -177.599960,179.399978,169.899948, 1.054000,1.029999,1.130000);
						case 302: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,0.000000,-0.005001, -177.599960,179.399978,169.899948, 1.054000,1.029999,1.130000);
						case 303: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,0.000000,-0.005001, -177.599960,179.399978,169.899948, 1.054000,1.029999,1.130000);
						case 304: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,0.000000,-0.005001, -177.599960,179.399978,169.899948, 1.054000,1.029999,1.130000);
						case 305: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,0.000000,-0.00001, -177.599960,179.399978,169.899948, 1.054000,1.029999,1.130000);
						case 310: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,0.000000,-0.005001, -177.599960,179.399978,169.899948, 1.054000,1.029999,1.130000);
						case 311: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135998,0.000000,-0.005001, -177.599960,179.399978,169.899948, 1.054000,1.029999,1.130000);
						default: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.166000, 0.000000, 0.000000, 0.000000, 0.000000, -2.499999, 1.000000, 1.000000, 1.134999);
					}
				}
				case 12: {
					switch(skin) {
						case 1: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.120000,-0.001000,0.000000, -92.499984,-7.199993,-98.099990, 1.114999,1.000000,0.901000);
						case 3: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.120000,0.006999,0.007000, -92.499984,-7.199993,-98.099990, 1.188999,1.256000,1.157000);
						case 4: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141999,-0.000000,0.001999, -92.499984,-7.199993,-98.099990, 1.175999,1.256000,1.083999);
						case 5: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141999,-0.000000,0.001999, -92.499984,-7.199993,-98.099990, 1.175999,1.256000,1.083999);
						case 7: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.123000,0.017000,0.001999, -84.299972,-5.799993,-98.099990, 1.216999,1.256000,1.011999);
						case 9: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.091000,0.003000,0.001999, -84.299972,-5.799993,-98.099990, 1.237999,1.256000,1.057999);
						case 14: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.104000,0.013000,0.006000, -91.399986,-5.799993,-92.200004, 1.262999,1.256000,1.122999);
						case 15: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.071000,-0.015999,-0.000000, -91.399986,-5.799993,-92.200004, 1.181999,1.256000,0.974999);
						case 17: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.100000,0.009000,-0.000000, -91.399986,-5.799993,-92.200004, 1.262999,1.256000,0.974999);
						case 18: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.085999,0.003000,-0.000000, -91.399986,-5.799993,-92.200004, 0.994999,1.256000,1.021000);
						case 20: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116999,0.003000,-0.000000, -91.399986,-5.799993,-92.200004, 1.037999,1.256000,1.094000);
						case 21: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116999,0.003000,-0.000000, -91.399986,-5.799993,-92.200004, 1.132999,1.256000,1.094000);
						case 25: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116999,0.003000,0.004000, -91.399986,-5.799993,-92.200004, 1.157999,1.056999,0.877000);
						case 26: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116999,0.003000,0.004000, -91.399986,-5.799993,-92.200004, 1.005999,1.056999,1.086000);
						case 30: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116999,0.003000,-0.002000, -91.399986,-5.799993,-92.200004, 1.277999,1.056999,1.107000);
						case 44: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.097999,0.016000,-0.000000, -91.399986,-5.799993,-92.200004, 1.022999,1.056999,0.863000);
						case 45: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.097999,-0.002999,-0.000000, -91.399986,-5.799993,-92.200004, 1.022999,1.056999,1.034000);
						case 46: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.120999,0.020000,-0.000000, -91.399986,-5.799993,-92.200004, 1.135999,1.056999,1.154000);
						case 47: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.120999,0.011000,-0.000000, -91.399986,-5.799993,-92.200004, 1.135999,1.056999,1.154000);
						case 48: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130999,-0.004999,-0.000000, -91.399986,-5.799993,-92.200004, 1.189999,1.056999,1.195000);
						case 57: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130999,0.024000,-0.000000, -91.399986,-5.799993,-92.200004, 1.189999,1.056999,1.195000);
						case 58: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.092000,0.002000,-0.000000, -91.399986,-5.799993,-92.200004, 1.002999,1.056999,0.939000);
						case 59: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126999,0.006000,-0.000000, -91.399986,-5.799993,-92.200004, 1.115999,1.301999,1.119000);
						case 60: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.107999,0.001000,-0.000000, -91.399986,-5.799993,-92.200004, 1.115999,1.301999,0.950000);
						case 66: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.107999,0.001000,0.000999, -91.399986,-5.799993,-92.200004, 1.115999,1.301999,0.950000);
						case 68: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.107999,0.027000,0.000999, -91.399986,-5.799993,-92.200004, 1.115999,1.301999,0.950000);
						case 69: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.107999,-0.017999,0.003999, -91.399986,-5.799993,-92.200004, 1.160999,1.301999,0.950000);
						case 70: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.107999,0.012000,0.004999, -91.399986,-5.799993,-92.200004, 1.160999,1.301999,0.950000);
						case 76: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.107999,-0.019999,0.004999, -91.399986,-5.799993,-92.200004, 1.160999,1.301999,1.005000);
						case 86: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.096000,-0.010999,0.000999, -91.399986,-5.799993,-92.200004, 1.084999,1.358999,0.969000);
						case 91: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.096000,-0.010999,0.007000, -91.399986,-5.799993,-92.200004, 1.206999,1.358999,1.074000);
						case 95: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.096000,-0.010999,-0.000000, -91.399986,-5.799993,-92.200004, 1.095999,1.358999,0.977000);
						case 96: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.114000,0.004000,0.001999, -91.399986,-5.799993,-92.200004, 1.095999,1.358999,0.977000);
						case 97: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.092000,-0.004999,0.001999, -91.399986,-5.799993,-92.200004, 1.095999,1.358999,0.977000);
						case 98: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.099000,0.021000,0.001999, -91.399986,-5.799993,-92.200004, 1.095999,1.358999,1.086000);
						case 100: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115000,0.007000,0.001999, -91.399986,-5.799993,-92.200004, 1.133999,1.358999,1.158000);
						case 101: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115000,0.003000,0.001999, -91.399986,-5.799993,-92.200004, 1.133999,1.358999,1.158000);
						case 106: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115000,-0.001999,-0.004000, -91.399986,-5.799993,-92.200004, 1.318998,1.358999,1.158000);
						case 111: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118000,0.010000,0.001999, -91.399986,-5.799993,-92.200004, 1.197998,1.126999,0.946000);
						case 112: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.086000,0.010000,0.001999, -91.399986,-5.799993,-92.200004, 1.055998,1.126999,0.946000);
						case 113: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.105000,0.010000,0.001999, -91.399986,-5.799993,-92.200004, 1.179998,1.126999,1.101000);
						case 117: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.105000,0.010000,0.001999, -91.399986,-5.799993,-92.200004, 1.080998,1.126999,0.975000);
						case 118: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.105000,0.010000,0.001999, -91.399986,-5.799993,-92.200004, 1.080998,1.126999,0.975000);
						case 119: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.105000,0.010000,0.001999, -91.399986,-5.799993,-92.200004, 1.167998,1.126999,0.975000);
						case 120: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.120000,-0.005999,0.001999, -91.399986,-5.799993,-92.200004, 1.167998,1.126999,1.113000);
						case 121: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.120000,0.000000,0.001999, -91.399986,-5.799993,-92.200004, 1.167998,1.126999,1.113000);
						case 123: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.120000,0.000000,-0.002000, -91.399986,-5.799993,-92.200004, 1.242998,1.126999,1.113000);
						case 124: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.120000,0.000000,-0.002000, -91.399986,-5.799993,-92.200004, 1.179998,1.157999,1.061000);
						case 125: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.120000,0.008000,0.001999, -91.399986,-5.799993,-92.200004, 1.179998,1.157999,1.061000);
						case 126: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129000,-0.009999,0.001999, -91.399986,-5.799993,-92.200004, 1.179998,1.157999,1.061000);
						case 127: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129000,0.008000,0.001999, -91.399986,-5.799993,-92.200004, 1.179998,1.157999,1.061000);
						case 147: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.095000,-0.003999,0.006000, -91.399986,-5.799993,-92.200004, 1.119998,1.157999,1.061000);
						case 148: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.095000,-0.003999,0.006000, -91.399986,-5.799993,-92.200004, 1.181998,1.157999,1.135000);
						case 151: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.095000,-0.003999,0.006000, -91.399986,-5.799993,-92.200004, 1.449998,1.497999,1.211000);
						case 154: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.095000,-0.003999,0.001999, -91.399986,-5.799993,-92.200004, 1.075998,1.218000,1.063000);
						case 156: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116000,-0.002999,0.001999, -91.399986,-5.799993,-92.200004, 1.325998,1.434000,1.209000);
						case 160: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.084000,0.015000,0.001999, -91.399986,-5.799993,-92.200004, 1.171998,1.086000,0.945000);
						case 162: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116000,0.007000,0.001999, -91.399986,-5.799993,-92.200004, 1.171998,1.086000,0.945000);
						case 163: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116000,0.007000,0.001999, -91.399986,-5.799993,-92.200004, 1.000998,1.086000,0.897000);
						case 164: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116000,0.002000,0.001999, -91.399986,-5.799993,-92.200004, 1.037998,1.086000,1.023000);
						case 165: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116000,0.002000,0.001999, -91.399986,-5.799993,-92.200004, 1.037998,1.086000,1.023000);
						case 166: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116000,0.010000,0.005000, -91.399986,-5.799993,-92.200004, 1.037998,1.086000,1.023000);
						case 170: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116000,0.010000,-0.001999, -91.399986,-5.799993,-92.200004, 1.091998,1.086000,1.215000);
						case 171: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132000,-0.007999,0.003000, -91.399986,-5.799993,-92.200004, 1.091998,1.086000,1.142000);
						case 176: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132000,-0.007999,0.003000, -91.399986,-5.799993,-92.200004, 1.157998,1.086000,1.142000);
						case 179: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112000,0.006000,0.003000, -91.399986,-5.799993,-92.200004, 1.157998,1.086000,1.142000);
						case 180: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139000,-0.006000,0.000000, -91.399986,-5.799993,-92.200004, 1.157998,1.086000,1.142000);
						case 182: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.103000,0.010000,0.000000, -91.399986,-5.799993,-92.200004, 1.044998,1.086000,1.035000);
						case 183: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.103000,0.010000,0.000000, -91.399986,-5.799993,-92.200004, 1.044998,1.086000,1.035000);
						case 184: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.103000,0.010000,0.000000, -91.399986,-5.799993,-92.200004, 1.115998,1.086000,1.088000);
						case 185: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.135000,-0.002999,0.000000, -91.399986,-5.799993,-92.200004, 1.115998,1.086000,1.088000);
						case 186: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.124000,-0.010000,0.000000, -91.399986,-5.799993,-92.200004, 1.115998,1.086000,1.088000);
						case 187: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.103000,-0.010000,0.007000, -91.399986,-5.799993,-92.200004, 1.115998,1.086000,1.088000);
						case 188: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.103000,-0.001000,0.007000, -91.399986,-5.799993,-92.200004, 1.115998,1.086000,1.088000);
						case 189: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125000,-0.008000,0.007000, -91.399986,-5.799993,-92.200004, 1.115998,1.086000,1.088000);
						case 191: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125000,-0.003000,0.001000, -91.399986,-5.799993,-92.200004, 1.160998,1.306000,1.239000);
						case 192: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125000,-0.003000,0.001000, -91.399986,-5.799993,-92.200004, 1.160998,1.306000,1.239000);
						case 200: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125000,-0.003000,0.001000, -91.399986,-5.799993,-92.200004, 1.222998,1.306000,1.103000);
						case 206: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116000,0.020999,0.001000, -91.399986,-5.799993,-92.200004, 1.038998,1.306000,0.880000);
						case 207: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.087000,0.006999,-0.000999, -91.399986,-5.799993,-92.200004, 1.038998,1.306000,0.880000);
						case 210: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.087000,-0.001000,0.002000, -91.399986,-5.799993,-92.200004, 1.038998,1.306000,0.880000);
						case 213: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.109000,-0.001000,0.002000, -91.399986,-5.799993,-92.200004, 1.180998,1.306000,0.950000);
						case 217: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116000,0.006000,0.002000, -91.399986,-5.799993,-92.200004, 1.180998,1.306000,0.950000);
						case 221: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116000,0.002000,0.002000, -91.399986,-5.799993,-92.200004, 1.301998,1.306000,1.174000);
						case 222: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116000,-0.007999,0.002000, -91.399986,-5.799993,-92.200004, 1.301998,1.306000,1.204000);
						case 223: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128000,0.017000,0.002000, -91.399986,-5.799993,-92.200004, 1.122998,1.306000,1.145000);
						case 227: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128000,0.017000,0.002000, -91.399986,-5.799993,-92.200004, 1.122998,1.306000,1.145000);
						case 228: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128000,0.004000,0.002000, -91.399986,-5.799993,-92.200004, 1.122998,1.306000,1.145000);
						case 229: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.097000,-0.009999,0.002000, -91.399986,-5.799993,-92.200004, 1.200998,1.306000,1.009000);
						case 234: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.116000,-0.020999,0.002000, -91.399986,-5.799993,-92.200004, 0.980998,1.115000,0.973000);
						case 235: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.064000,-0.004999,0.002000, -91.399986,-5.799993,-92.200004, 1.021999,1.115000,0.973000);
						case 236: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.095000,-0.003999,0.002000, -91.399986,-5.799993,-92.200004, 1.051999,1.115000,1.028000);
						case 240: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128000,0.010000,0.002000, -91.399986,-5.799993,-92.200004, 1.131999,1.115000,1.182000);
						case 250: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128000,0.001000,0.002000, -91.399986,-5.799993,-92.200004, 1.131999,1.115000,1.182000);
						case 252: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128000,0.001000,0.002000, -91.399986,-5.799993,-92.200004, 1.131999,1.115000,1.182000);
						case 258: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128000,0.001000,0.002000, -91.399986,-5.799993,-92.200004, 1.237999,1.115000,1.182000);
						case 259: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.104000,-0.002999,0.002000, -91.399986,-5.799993,-92.200004, 1.302999,1.267000,1.182000);
						case 262: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.093000,0.012000,0.001000, -91.399986,-5.799993,-92.200004, 1.099999,1.267000,1.007000);
						case 265: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.093000,0.012000,0.001000, -91.399986,-5.799993,-92.200004, 1.099999,1.267000,1.007000);
						case 266: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.093000,0.002000,-0.000999, -91.399986,-5.799993,-92.200004, 1.200999,1.267000,0.945000);
						case 267: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.100000,-0.008999,0.001000, -91.399986,-5.799993,-92.200004, 1.152999,1.267000,0.993000);
						case 272: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122000,0.000000,0.001000, -91.399986,-5.799993,-92.200004, 1.152999,1.267000,0.993000);
						case 273: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.081000,0.003000,0.001000, -91.399986,-5.799993,-92.200004, 1.152999,1.267000,0.993000);
						case 274: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.092000,0.012000,0.001000, -91.399986,-5.799993,-92.200004, 1.148999,1.267000,0.966000);
						case 275: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.092000,0.012000,0.001000, -91.399986,-5.799993,-92.200004, 1.148999,1.267000,0.966000);
						case 276: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.102000,0.012000,0.001000, -91.399986,-5.799993,-92.200004, 1.148999,1.267000,0.966000);
						case 280: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.102000,0.016000,0.001000, -91.399986,-5.799993,-92.200004, 1.148999,1.267000,0.966000);
						case 281: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.102000,0.004000,0.001000, -91.399986,-5.799993,-92.200004, 1.148999,1.267000,0.966000);
						case 282: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.110000,0.011000,0.001000, -91.399986,-5.799993,-92.200004, 1.058999,1.267000,0.956000);
						case 286: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.110000,0.005000,0.001000, -91.399986,-5.799993,-92.200004, 1.058999,1.267000,0.956000);
						case 292: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.110000,-0.002999,0.001000, -91.399986,-5.799993,-92.200004, 1.058999,1.267000,0.956000);
						case 295: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.110000,0.002000,0.001000, -91.399986,-5.799993,-92.200004, 1.177999,1.267000,1.027000);
						case 296: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117000,-0.017999,0.001000, -91.399986,-5.799993,-92.200004, 1.177999,1.267000,1.027000);
						case 300: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117000,0.006000,-0.000999, -91.399986,-5.799993,-92.200004, 1.137999,1.267000,0.925000);
						case 301: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117000,0.006000,-0.000999, -91.399986,-5.799993,-92.200004, 1.137999,1.267000,0.925000);
						case 302: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117000,0.006000,-0.000999, -91.399986,-5.799993,-92.200004, 1.137999,1.267000,0.925000);
						case 303: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117000,0.006000,-0.000999, -91.399986,-5.799993,-92.200004, 1.137999,1.267000,0.925000);
						case 304: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117000,0.006000,-0.000999, -91.399986,-5.799993,-92.200004, 1.137999,1.160000,0.918000);
						case 305: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117000,0.006000,-0.000999, -91.399986,-5.799993,-92.200004, 1.137999,1.160000,0.918000);
						case 310: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117000,0.006000,-0.000999, -91.399986,-5.799993,-92.200004, 1.137999,1.160000,0.918000);
						case 311: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117000,0.006000,-0.000999, -91.399986,-5.799993,-92.200004, 1.137999,1.160000,0.918000);
						default: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.153999, 0.000000, 0.000000, -107.499961, -4.100004, -88.399993, 1.178000, 1.070000, 1.000000);
					}
				}
				case 13: {
					switch(skin) {
						case 1: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.120999,0.000000,-0.000000, 3.400000,87.100013,88.299980, 1.000000,1.116000,1.000000);
						case 3: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140000,0.001999,-0.000000, 3.400000,87.100013,88.299980, 1.000000,1.116000,1.000000);
						case 4: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.161000,0.001999,-0.000000, 3.400000,87.100013,88.299980, 1.000000,1.116000,1.000000);
						case 5: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.152000,-0.004000,-0.000000, 3.400000,87.100013,88.299980, 1.000000,1.116000,1.000000);
						case 7: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.152000,0.007999,-0.003000, 3.400000,87.100013,88.299980, 1.000000,1.116000,1.000000);
						case 9: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118000,0.000999,-0.003000, 3.400000,87.100013,88.299980, 1.000000,1.116000,1.000000);
						case 11: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118000,0.000999,0.001999, 3.400000,87.100013,88.299980, 1.000000,1.116000,1.000000);
						case 12: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118000,-0.018000,0.001999, 3.400000,87.100013,88.299980, 1.000000,1.116000,1.000000);
						case 14: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118000,0.019999,0.001999, 3.400000,87.100013,88.299980, 1.014000,1.183000,1.000000);
						case 15: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.111000,-0.022000,0.001999, 3.400000,87.100013,88.299980, 0.920000,1.077000,1.000000);
						case 17: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142000,-0.001000,0.001999, 3.400000,87.100013,88.299980, 0.920000,1.077000,1.000000);
						case 18: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128000,-0.001000,0.001999, 3.400000,87.100013,88.299980, 1.010999,1.077000,1.000000);
						case 20: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.150000,-0.001000,0.001999, 3.400000,87.100013,88.299980, 1.010999,1.077000,1.000000);
						case 21: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127000,0.004999,0.001999, 3.400000,87.100013,88.299980, 1.010999,1.077000,1.000000);
						case 25: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127000,0.015999,0.004000, 3.400000,87.100013,88.299980, 1.010999,1.077000,1.000000);
						case 26: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127000,0.015999,0.004000, 3.400000,87.100013,88.299980, 1.095999,1.077000,1.000000);
						case 28: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127000,0.024999,-0.001000, 3.400000,87.100013,88.299980, 1.172999,1.160000,1.000000);
						case 30: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.127000,0.016999,0.000999, 3.400000,87.100013,88.299980, 1.172999,1.160000,1.000000);
						case 40: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113000,-0.008000,0.003999, 3.400000,87.100013,88.299980, 1.172999,1.178000,1.000000);
						case 44: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113000,0.018999,0.003999, 3.400000,87.100013,88.299980, 0.858999,0.969000,1.000000);
						case 45: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113000,-0.012000,0.003999, 3.400000,87.100013,88.299980, 0.858999,0.990000,1.000000);
						case 46: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144000,0.010999,0.003999, 3.400000,87.100013,88.299980, 0.959999,1.083999,1.000000);
						case 47: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.144000,-0.000000,0.003999, 3.400000,87.100013,88.299980, 0.959999,1.122000,1.000000);
						case 48: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151000,-0.008000,-0.002000, 3.400000,87.100013,88.299980, 1.074999,1.185000,1.000000);
						case 49: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113000,0.009999,0.004999, 3.400000,87.100013,88.299980, 1.074999,1.185000,1.000000);
						case 54: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113000,0.028999,0.004999, 3.400000,87.100013,88.299980, 1.074999,1.185000,1.000000);
						case 55: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113000,-0.011000,0.004999, 3.400000,87.100013,88.299980, 1.074999,1.185000,1.000000);
						case 56: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113000,-0.011000,0.004999, 3.400000,87.100013,88.299980, 1.074999,1.185000,1.000000);
						case 57: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147000,0.022999,0.004999, 3.400000,87.100013,88.299980, 1.074999,1.185000,1.000000);
						case 58: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.109000,0.000999,0.004999, 3.400000,87.100013,88.299980, 0.882999,0.963999,1.000000);
						case 59: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.152000,-0.001000,0.000999, 3.400000,87.100013,88.299980, 1.024999,1.054999,1.001000);
						case 60: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129000,0.006999,0.000999, 3.400000,87.100013,88.299980, 1.024999,1.054999,1.001000);
						case 66: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129000,0.006999,0.000999, 3.400000,87.100013,88.299980, 1.024999,1.054999,1.001000);
						case 67: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129000,0.006999,0.000999, 3.400000,87.100013,88.299980, 1.024999,1.054999,1.001000);
						case 68: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129000,0.025999,0.001999, 3.400000,87.100013,88.299980, 0.942998,0.978999,1.001000);
						case 69: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129000,-0.012000,0.002999, 3.400000,87.100013,88.299980, 0.942998,1.102999,1.001000);
						case 70: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129000,0.006999,0.007000, 3.400000,87.100013,88.299980, 0.942998,1.102999,1.001000);
						case 72: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129000,0.006999,0.008000, 3.400000,87.100013,88.299980, 0.942998,1.102999,1.001000);
						case 73: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117000,0.014999,-0.001000, 3.400000,87.100013,88.299980, 0.997998,1.126000,1.001000);
						case 76: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.130000,-0.013000,-0.001000, 3.400000,87.100013,88.299980, 1.016998,1.159000,1.001000);
						case 79: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112000,0.009999,0.008000, 3.400000,87.100013,88.299980, 0.954998,1.135000,1.001000);
						case 82: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.180000,0.009999,0.008000, 3.400000,87.100013,88.299980, 0.976998,1.135000,1.001000);
						case 83: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.172000,0.001999,0.008000, 3.400000,87.100013,88.299980, 1.003998,1.135000,1.001000);
						case 84: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.175000,-0.001000,0.008000, 3.400000,87.100013,88.299980, 1.005998,1.018000,1.001000);
						case 86: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117000,-0.001000,0.001999, 3.400000,87.100013,88.299980, 1.005998,1.018000,1.001000);
						case 90: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117000,-0.001000,0.001999, 3.400000,87.100013,88.299980, 1.108998,1.145000,1.001000);
						case 91: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117000,-0.001000,0.001999, 3.400000,87.100013,88.299980, 1.135998,1.145000,1.044000);
						case 95: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117000,-0.013000,0.001999, 3.400000,87.100013,88.299980, 0.939998,1.133000,1.044000);
						case 96: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117000,0.016999,0.003000, 3.400000,87.100013,88.299980, 1.019998,1.160000,1.044000);
						case 97: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.117000,0.001999,0.003000, 3.400000,87.100013,88.299980, 1.055998,1.104000,1.044000);
						case 98: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132000,0.019999,0.003000, 3.400000,87.100013,88.299980, 1.055998,1.104000,1.044000);
						case 100: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132000,0.011999,0.005000, 3.400000,87.100013,88.299980, 1.116998,1.189000,1.044000);
						case 101: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132000,0.008999,0.005000, 3.400000,87.100013,88.299980, 1.116998,1.189000,1.044000);
						case 102: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129000,0.008999,-0.000999, 3.400000,87.100013,88.299980, 1.116998,1.320001,1.044000);
						case 103: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132000,0.003999,0.001000, 3.400000,87.100013,88.299980, 1.116998,1.184001,1.044000);
						case 105: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.132000,0.003999,0.001000, 3.400000,87.100013,88.299980, 1.116998,1.184001,1.044000);
						case 106: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147000,-0.010000,0.001000, 3.400000,87.100013,88.299980, 1.116998,1.184001,1.044000);
						case 108: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.138000,0.001999,0.001000, 3.400000,87.100013,88.299980, 1.116998,1.184001,1.044000);
						case 109: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139000,0.006999,0.001000, 3.400000,87.100013,88.299980, 1.116998,1.184001,1.044000);
						case 111: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134000,0.009000,0.000000, 1.699999,90.200042,89.400001, 1.000000,1.000000,1.000000);
						case 112: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.099000,0.009000,0.000000, 1.699999,90.200042,89.400001, 1.000000,1.000000,1.000000);
						case 113: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.145999,0.005000,0.000000, 1.699999,90.200042,89.400001, 1.012999,1.100999,1.000000);
						case 114: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.145999,0.005000,0.000000, 1.699999,90.200042,89.400001, 1.062999,1.139999,1.000000);
						case 117: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112000,0.018999,0.000000, 1.699999,90.200042,89.400001, 0.937999,1.009999,1.000000);
						case 118: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112000,0.018999,0.000000, 1.699999,90.200042,89.400001, 0.937999,1.009999,1.000000);
						case 119: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.133999,0.010999,0.000999, 1.699999,90.200042,89.400001, 0.937999,1.099999,1.000000);
						case 120: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.133999,-0.003000,0.000999, 1.699999,90.200042,89.400001, 1.072000,1.099999,1.000000);
						case 121: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.133999,0.000999,0.000999, 1.699999,90.200042,89.400001, 1.072000,1.148000,1.000000);
						case 122: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.133999,0.000999,0.000999, 1.699999,90.200042,89.400001, 0.972000,1.061000,1.000000);
						case 123: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141000,0.000999,-0.003000, 1.699999,90.200042,89.400001, 1.165000,1.223000,1.000000);
						case 124: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141000,0.006999,0.003999, 1.699999,90.200042,89.400001, 1.056000,1.085000,1.000000);
						case 125: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.120999,0.006999,-0.000000, 1.699999,90.200042,89.400001, 1.056000,1.085000,1.000000);
						case 126: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134000,0.000999,-0.000000, 1.699999,90.200042,89.400001, 1.056000,1.106000,1.000000);
						case 127: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134000,0.010999,-0.000000, 1.699999,90.200042,89.400001, 1.056000,1.106000,1.000000);
						case 128: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.150000,0.010999,-0.000000, 1.699999,90.200042,89.400001, 1.056000,1.106000,1.000000);
						case 131: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.109000,0.010999,-0.000000, 1.699999,90.200042,89.400001, 1.056000,1.106000,1.000000);
						case 132: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.042000,0.000999,-0.000000, 1.699999,90.200042,89.400001, 0.942000,0.921000,1.000000);
						case 142: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.133000,0.000999,-0.001000, 1.699999,90.200042,89.400001, 0.942000,1.146000,1.000000);
						case 147: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.129000,-0.013000,0.008999, 1.699999,90.200042,89.400001, 0.942000,1.009000,1.000000);
						case 150: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139000,-0.024000,0.008999, 1.699999,90.200042,89.400001, 0.942000,1.129000,1.000000);
						case 151: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.139000,-0.029000,0.000999, 1.699999,90.200042,89.400001, 0.992000,1.235000,1.000000);
						case 154: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113000,-0.007000,0.000999, 1.699999,90.200042,89.400001, 0.992000,1.029000,1.000000);
						case 156: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.165000,-0.034000,0.000999, 1.699999,90.200042,89.400001, 0.992000,1.198000,1.000000);
						case 157: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118000,-0.000000,0.000999, 1.699999,90.200042,89.400001, 1.047000,1.198000,1.000000);
						case 160: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.118000,0.003999,0.000999, 1.699999,90.200042,89.400001, 0.854000,0.962999,1.000000);
						case 162: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147000,0.003999,0.000999, 1.699999,90.200042,89.400001, 0.854000,0.962999,1.000000);
						case 163: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128000,0.003999,0.000999, 1.699999,90.200042,89.400001, 0.854000,0.962999,1.000000);
						case 164: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128000,0.003999,-0.001000, 1.699999,90.200042,89.400001, 0.854000,0.962999,1.000000);
						case 165: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.128000,0.003999,-0.001000, 1.699999,90.200042,89.400001, 0.886000,1.061999,1.000000);
						case 166: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126000,0.003999,-0.001000, 1.699999,90.200042,89.400001, 0.886000,1.061999,1.000000);
						case 169: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126000,-0.013000,-0.001000, 1.699999,90.200042,89.400001, 1.030000,1.197999,1.000000);
						case 170: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126000,0.001999,-0.001000, 1.699999,90.200042,89.400001, 0.985000,1.197999,1.000000);
						case 171: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.141000,-0.005000,-0.001000, 1.699999,90.200042,89.400001, 1.070000,1.092000,1.000000);
						case 172: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136000,-0.005000,-0.001000, 4.000000,90.900016,84.900016, 1.070000,1.179999,1.000000);
						case 176: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136000,-0.000000,-0.001000, 4.000000,90.900016,84.900016, 1.070000,1.179999,1.000000);
						case 179: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.137000,0.004999,-0.001000, 4.000000,90.900016,84.900016, 1.070000,1.179999,1.000000);
						case 180: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.159000,-0.009000,-0.003000, 4.000000,90.900016,84.900016, 1.070000,1.179999,1.000000);
						case 182: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119000,0.007999,0.000999, 4.000000,90.900016,84.900016, 0.909000,1.015999,1.000000);
						case 183: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119000,0.007999,0.000999, 4.000000,90.900016,84.900016, 0.992000,1.106999,1.000000);
						case 184: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126000,0.004999,0.000999, 4.000000,90.900016,84.900016, 0.992000,1.112000,1.000000);
						case 185: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.149000,-0.009000,0.000999, 4.000000,90.900016,84.900016, 0.992000,1.112000,1.000000);
						case 186: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.148000,-0.009000,0.000999, 4.000000,90.900016,84.900016, 0.992000,1.112000,1.000000);
						case 187: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.112000,-0.009000,0.004999, 4.000000,90.900016,84.900016, 0.992000,1.112000,1.000000);
						case 188: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122000,0.004999,0.004999, 4.000000,90.900016,84.900016, 0.992000,1.112000,1.000000);
						case 189: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.136000,-0.000000,0.004999, 4.000000,90.900016,84.900016, 1.079001,1.112000,1.070999);
						case 191: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.153000,-0.015000,0.004999, 4.000000,90.900016,84.900016, 1.126001,1.186000,1.070999);
						case 192: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.153000,-0.015000,0.004999, 4.000000,90.900016,84.900016, 1.126001,1.186000,1.070999);
						case 193: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.153000,-0.006000,0.004999, 4.000000,90.900016,84.900016, 1.126001,1.186000,1.070999);
						case 194: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.153000,-0.006000,0.000999, 4.000000,90.900016,84.900016, 1.126001,1.186000,1.070999);
						case 200: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140000,-0.006000,0.000999, 4.000000,90.900016,84.900016, 1.126001,1.186000,1.070999);
						case 206: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140000,0.020999,0.000999, 4.000000,90.900016,84.900016, 0.903001,1.018000,1.070999);
						case 207: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.090000,0.005999,0.000999, 4.000000,90.900016,84.900016, 0.903001,1.018000,1.070999);
						case 212: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.113000,0.007999,0.000999, 4.000000,90.900016,84.900016, 0.903001,1.018000,1.070999);
						case 213: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.126000,0.007999,0.000999, 4.000000,90.900016,84.900016, 1.023001,1.116000,1.070999);
						case 217: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.140000,0.007999,0.000999, 4.000000,90.900016,84.900016, 1.023001,1.116000,1.070999);
						case 220: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.103000,0.023999,0.000999, 4.000000,90.900016,84.900016, 1.023001,1.116000,1.070999);
						case 221: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154000,-0.011000,0.000999, 4.000000,90.900016,84.900016, 1.023001,1.283000,1.070999);
						case 222: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.151000,-0.024000,0.000999, 4.000000,90.900016,84.900016, 1.023001,1.283000,1.070999);
						case 223: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.161000,0.002999,0.000999, 4.000000,90.900016,84.900016, 1.023001,1.113000,1.070999);
						case 226: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122000,-0.016000,0.000999, 4.000000,90.900016,84.900016, 1.023001,1.182000,1.070999);
						case 227: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122000,0.026999,0.000999, 4.000000,90.900016,84.900016, 1.023001,1.182000,1.070999);
						case 228: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.147000,0.001999,0.000999, 4.000000,90.900016,84.900016, 1.023001,1.182000,1.070999);
						case 229: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.101000,0.001999,0.000999, 4.000000,90.900016,84.900016, 1.023001,1.182000,1.070999);
						case 235: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.067000,0.007999,0.000999, 4.000000,90.900016,84.900016, 0.900001,1.023000,1.070999);
						case 236: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.110000,-0.001000,0.000999, 4.000000,90.900016,84.900016, 0.900001,1.023000,1.070999);
						case 240: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146000,-0.001000,0.000999, 4.000000,90.900016,84.900016, 0.995001,1.180000,1.070999);
						case 247: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146000,-0.003000,0.000999, 4.000000,90.900016,84.900016, 1.114001,1.180000,1.070999);
						case 248: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.174000,-0.003000,0.000999, 4.000000,90.900016,84.900016, 1.114001,1.180000,1.070999);
						case 250: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.125000,0.007999,-0.007000, 4.000000,90.900016,84.900016, 1.022000,1.180000,1.070999);
						case 252: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.134000,0.004999,-0.007000, 4.000000,90.900016,84.900016, 1.149001,1.213000,1.070999);
						case 254: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142000,0.000999,-0.001000, 4.000000,90.900016,84.900016, 1.149001,1.213000,1.070999);
						case 258: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142000,0.000999,-0.001000, 4.000000,90.900016,84.900016, 1.149001,1.213000,1.070999);
						case 259: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.142000,0.000999,-0.001000, 4.000000,90.900016,84.900016, 1.149001,1.213000,1.070999);
						case 262: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.122000,0.009999,-0.001000, 4.000000,90.900016,84.900016, 0.954001,1.015000,1.070999);
						case 265: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.103000,0.009999,-0.001000, 4.000000,90.900016,84.900016, 0.954001,1.015000,1.070999);
						case 266: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.114000,0.009999,-0.001000, 4.000000,90.900016,84.900016, 0.954001,1.190000,1.070999);
						case 267: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.104000,0.002999,-0.001000, 4.000000,90.900016,84.900016, 1.005001,1.190000,1.070999);
						case 268: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.114000,0.002999,-0.001000, 4.000000,90.900016,84.900016, 1.005001,1.190000,1.070999);
						case 272: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.133000,0.015999,-0.001000, 4.000000,90.900016,84.900016, 1.005001,1.190000,1.070999);
						case 273: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.099000,0.015999,-0.001000, 4.000000,90.900016,84.900016, 1.060001,1.131000,1.070999);
						case 274: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115000,0.015999,-0.001000, 4.000000,90.900016,84.900016, 1.060001,1.131000,1.070999);
						case 275: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115000,0.015999,-0.001000, 4.000000,90.900016,84.900016, 1.060001,1.131000,1.070999);
						case 276: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115000,0.015999,-0.001000, 4.000000,90.900016,84.900016, 1.060001,1.131000,1.070999);
						case 280: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115000,0.015999,-0.001000, 4.000000,90.900016,84.900016, 1.060001,1.131000,1.070999);
						case 281: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115000,0.015999,-0.001000, 4.000000,90.900016,84.900016, 1.060001,1.131000,1.070999);
						case 282: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115000,0.015999,-0.001000, 4.000000,90.900016,84.900016, 1.060001,1.131000,1.070999);
						case 286: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.115000,0.015999,-0.001000, 4.000000,90.900016,84.900016, 1.060001,1.131000,1.070999);
						case 291: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.150000,0.015999,-0.001000, 4.000000,90.900016,84.900016, 1.141000,1.131000,1.070999);
						case 292: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.098000,0.015999,-0.001000, 4.000000,90.900016,84.900016, 0.912000,1.110000,1.070999);
						case 294: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.143000,0.004999,-0.001000, 4.000000,90.900016,84.900016, 1.040000,1.110000,1.070999);
						case 295: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119000,0.004999,0.001999, 4.000000,90.900016,84.900016, 1.040000,1.110000,1.070999);
						case 296: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.143000,-0.021000,0.001999, 4.000000,90.900016,84.900016, 1.040000,1.110000,1.070999);
						case 297: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.155000,-0.010000,0.001999, 4.000000,90.900016,84.900016, 1.040000,1.182000,1.070999);
						case 299: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.155000,0.012999,0.001999, 4.000000,90.900016,84.900016, 1.040000,1.182000,1.070999);
						case 300: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119000,0.012999,0.001999, 4.000000,90.900016,84.900016, 1.040000,1.182000,1.070999);
						case 301: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119000,0.012999,0.001999, 4.000000,90.900016,84.900016, 1.040000,1.182000,1.070999);
						case 302: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119000,0.014999,0.001999, 4.000000,90.900016,84.900016, 1.040000,1.182000,1.070999);
						case 303: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119000,0.014999,-0.001000, 4.000000,90.900016,84.900016, 1.040000,1.090000,1.070999);
						case 304: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119000,0.014999,-0.001000, 4.000000,90.900016,84.900016, 1.040000,1.090000,1.070999);
						case 305: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119000,0.014999,-0.001000, 4.000000,90.900016,84.900016, 1.040000,1.194000,1.070999);
						case 310: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119000,0.014999,-0.001000, 4.000000,90.900016,84.900016, 1.040000,1.194000,1.070999);
						case 311: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.119000,0.014999,-0.001000, 4.000000,90.900016,84.900016, 1.040000,1.194000,1.070999);
						default: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.146000, 0.017999, 0.000000, 99.000007, 111.000000, 0.999998, 1.064000, 1.107999, 1.031000);
					}
				}
				case 14: {
					switch(skin) {
						case 0..311: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.156999, 0.019999, 0.000000, 0.099999, 88.999977, 87.400001, 1.000000, 1.183999, 1.119000);
						default: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.156999, 0.019999, 0.000000, 0.099999, 88.999977, 87.400001, 1.000000, 1.183999, 1.119000);
					}	
				}
				case 15: {
					switch(skin) {
						case 0..311: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.189000, 0.011000, 0.000000, 0.000000, 0.000000, 0.000000, 0.930000, 1.080000, 1.088999);
						default: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.189000, 0.011000, 0.000000, 0.000000, 0.000000, 0.000000, 0.930000, 1.080000, 1.088999);
					}	
				}
				case 16: {
					switch(skin) {
						case 0..311: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.087999, 0.000000, 0.000000, 82.000015, 86.799995, 2.800001, 1.172999, 1.098000, 1.074999);
						default: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.087999, 0.000000, 0.000000, 82.000015, 86.799995, 2.800001, 1.172999, 1.098000, 1.074999);
					}			
				}
				case 17: {
					switch(skin) {
						case 0..311: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.1809,0.0000,0.0000,0.0000,0.0000,0.0000,1.0000,1.0000,1.0000,0,0);
						default: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.1809,0.0000,0.0000,0.0000,0.0000,0.0000,1.0000,1.0000,1.0000,0,0);
					}	
				}
				case 18: {
					switch(skin) {
						case 0..311: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.095999, 0.000000, 0.000000, 0.000000, 0.000000, 0.000000, 1.080000, 1.000000, 1.063999);
						default: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.095999, 0.000000, 0.000000, 0.000000, 0.000000, 0.000000, 1.080000, 1.000000, 1.063999);
					}	
				}
				case 19: {
					switch(skin) {
						case 0..311: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154999, 0.016000, 0.000000, 0.000000, 0.000000, 0.000000, 1.152997, 1.290000, 1.100999);
						default: SetPlayerAttachedObject(playerid, 0, object_id, 2, 0.154999, 0.016000, 0.000000, 0.000000, 0.000000, 0.000000, 1.152997, 1.290000, 1.100999);
					}	
				}
			}
		}
		case INV_PLAYER_DEST_HEADPHONES: {
			switch(type) {
				case 1: {
					switch(skin) {
						case 0: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.305000, 0.084999, 0.005000, -95.400070, 64.799995, -86.699981, 1.106000, 1.055000, 1.058999);
						case 1: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.286000,0.089000,-0.006000, -90.599975,-121.999969,92.599967, 1.000000,1.000000,1.000000);
						case 2: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.303999,0.089000,-0.006000, -90.599975,-121.999969,92.599967, 1.040000,1.044999,1.000000);
						case 3: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.293999,0.089000,-0.006000, -90.599975,-121.999969,92.599967, 1.040000,1.044999,1.000000);
						case 4: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.334999,0.089000,-0.006000, -90.599975,-121.999969,92.599967, 1.040000,1.044999,1.000000);
						case 5: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.355999,0.071000,0.005000, -81.499992,-113.599922,94.599967, 1.099000,1.044999,1.000000);
						case 6: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.347999,0.090000,0.000000, -90.599975,-121.999969,92.599967, 1.000000,1.000000,1.000000);
						case 7: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.323998,0.104999,-0.008999, -90.599975,-121.999969,92.599967, 1.000000,1.000000,1.000000);
						case 8: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.301999,0.112999,0.001999, -90.599975,-121.999969,92.599967, 1.000000,1.000000,1.000000);
						case 9: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.314998,0.089999,0.001999, -90.599975,-108.399971,91.199943, 1.000000,1.000000,1.000000);
						case 10: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.243998,0.084000,-0.006000, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 11: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.333998,0.084000,-0.006000, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 12: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.313999,0.084000,-0.006000, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 13: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.361999,0.084000,-0.006000, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 14: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.338999,0.102000,-0.006000, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 15: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.325999,0.096000,-0.006000, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 16: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.367999,0.096000,-0.006000, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 17: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.346999,0.096000,-0.000999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 18: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.299998,0.096000,-0.000999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 19: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.354999,0.096000,-0.000999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 20: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.336999,0.096000,-0.000999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 21: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.336999,0.096000,-0.004999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 22: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.357999,0.096000,-0.004999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 23: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.333999,0.096000,-0.004999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 24: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.333999,0.096000,-0.004999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 25: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.333999,0.096000,-0.004999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 26: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.349999,0.096000,-0.004999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 27: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.338999,0.096000,-0.004999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 28: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.343999,0.096000,-0.004999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 29: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.274999, 0.094999, 0.002000, -95.400070, 64.799995, -86.699981, 1.399000, 1.298000, 1.058999);
						case 30: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.342999,0.102000,-0.004999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 31: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.190999, 0.094999, 0.002000, -95.400070, 64.799995, -86.699981, 1.225000, 1.298000, 1.058999);
						case 32: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.234999, 0.097000, 0.002000, -95.400070, 58.599975, -86.699981, 1.105000, 1.156000, 1.053999);
						case 33: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.294999,0.092000,-0.004999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 34: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.348999,0.108000,-0.004999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 35: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.328999,0.108000,-0.004999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 36: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.324999,0.101000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 37: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.324999,0.101000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 38: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.251999,0.101000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 39: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.251999,0.101000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 40: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.298999,0.086000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 41: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.320999, 0.077000, 0.002000, -95.400070, 58.599975, -86.699981, 1.105000, 1.156000, 1.053999);
						case 42: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.264999, 0.128000, 0.002000, -95.400070, 58.599975, -86.699981, 1.105000, 1.156000, 1.053999);
						case 43: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.277999,0.100000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 44: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.277999,0.100000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 45: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.299999,0.100000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 46: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.323999,0.100000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 47: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.334999,0.100000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 48: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.343999,0.100000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 49: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.244999, 0.101000, 0.002000, -95.400070, 58.599975, -86.699981, 1.105000, 1.156000, 1.053999);
						case 50: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.297999, 0.079000, -0.004999, -95.400070, 58.599975, -86.699981, 1.105000, 1.156000, 1.053999);
						case 51: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.285999, 0.104000, 0.003000, -95.400070, 58.599975, -86.699981, 1.105000, 1.156000, 1.053999);
						case 52: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.285999, 0.104000, 0.003000, -95.400070, 58.599975, -86.699981, 1.105000, 1.156000, 1.053999);
						case 53: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.183999, 0.111000, 0.003000, -95.400070, 58.599975, -86.699981, 1.105000, 1.156000, 1.053999);
						case 54: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.183999, 0.111000, 0.003000, -95.400070, 58.599975, -86.699981, 1.105000, 1.156000, 1.053999);
						case 55: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.264999, 0.085000, 0.003000, -95.400070, 58.599975, -86.699981, 1.105000, 1.156000, 1.053999);
						case 56: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.264999, 0.085000, 0.003000, -95.400070, 58.599975, -86.699981, 1.105000, 1.156000, 1.053999);
						case 57: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.354999,0.100000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 58: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.278999,0.100000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 59: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.319999,0.100000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 60: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.344999,0.109000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 61: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.319999,0.109000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 62: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.287999, 0.081999, 0.020000, -79.300003, 62.099994, -90.099990, 1.000000, 1.000000, 1.000000);
						case 63: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.280999, 0.081999, 0.020000, -79.300003, 62.099994, -90.099990, 1.000000, 1.000000, 1.000000);
						case 64: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.286999, 0.077999, 0.000999, -79.300003, 62.099994, -90.099990, 1.000000, 1.000000, 1.000000);
						case 65: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.307999, 0.080999, 0.006999, -79.300003, 62.099994, -90.099990, 1.000000, 1.000000, 1.000000);
						case 66: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.327999,0.094000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 67: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.327999,0.094000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 68: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.327999,0.094000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 69: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.327999,0.094000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 70: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.327999,0.094000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 71: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.333999,0.094000,-0.001999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 72: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.320999,0.094000,0.001000, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 73: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.320999,0.094000,0.001000, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 74: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.320999,0.094000,0.001000, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 75: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.276999, 0.080999, 0.018000, -79.300003, 62.099994, -90.099990, 1.000000, 1.000000, 1.000000);
						case 76: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.329998,0.094000,0.001000, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 77: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.207999, 0.095999, 0.009999, -79.300003, 62.099994, -90.099990, 1.000000, 1.000000, 1.000000);
						case 78: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.380998,0.109999,0.003000, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 79: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.364998,0.109999,-0.002999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 80: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.292999, 0.104999, 0.012999, -89.100006, 62.099994, -90.099990, 1.000000, 1.000000, 1.000000);
						case 81: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.292999, 0.104999, 0.012999, -89.100006, 62.099994, -90.099990, 1.000000, 1.000000, 1.000000);
						case 82: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.292999, 0.097999, 0.006999, -89.100006, 62.099994, -90.099990, 0.901000, 1.000000, 1.084000);
						case 83: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.292999, 0.097999, 0.006999, -89.100006, 62.099994, -90.099990, 0.901000, 1.000000, 1.084000);
						case 84: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.292999, 0.097999, 0.006999, -89.100006, 62.099994, -90.099990, 0.901000, 1.000000, 1.084000);
						case 85: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.321999, 0.080999, 0.005999, -89.100006, 62.099994, -90.099990, 0.956000, 1.000000, 1.084000);
						case 86: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.304999, 0.093999, 0.005999, -89.100006, 62.099994, -90.099990, 1.006000, 1.000000, 1.084000);
						case 87: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.283999, 0.093999, 0.005999, -89.100006, 62.099994, -90.099990, 1.006000, 1.000000, 1.084000);
						case 88: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.207999, 0.088999, 0.005999, -89.100006, 62.099994, -90.099990, 1.006000, 1.000000, 1.084000);
						case 89: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.207999, 0.053999, 0.005999, -89.100006, 62.099994, -90.099990, 1.006000, 1.000000, 1.084000);
						case 90: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.337998,0.100000,-0.002999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 91: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.337998,0.100000,-0.002999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 92: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.299000, 0.086999, 0.005999, -89.100006, 62.099994, -90.099990, 1.006000, 1.000000, 1.084000);
						case 93: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.328998,0.094999,-0.002999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 94: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.260998,0.094999,-0.002999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 95: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.266998,0.098999,-0.002999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 96: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.360998,0.098999,-0.002999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 97: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.311998,0.098999,-0.002999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 98: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.318998,0.098999,0.000000, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 99: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.299000, 0.086999, 0.005999, -89.100006, 62.099994, -90.099990, 1.006000, 1.000000, 1.084000);
						case 100: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.341998,0.098999,-0.002999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 101: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.321000, 0.079999, 0.005999, -89.100006, 62.099994, -90.099990, 1.157000, 1.000000, 1.084000);
						case 102: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.331998,0.102999,-0.008999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 103: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.320000, 0.083999, -0.000000, -89.100006, 62.099994, -90.099990, 1.298000, 1.000000, 1.084000);
						case 104: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.284000, 0.082999, -0.008000, -89.100006, 62.099994, -90.099990, 1.224000, 1.000000, 1.084000);
						case 105: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.366998,0.082000,-0.000999, -90.599975,-104.999977,92.599967, 1.000000,1.000000,1.000000);
						case 106: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.326998,0.100999,-0.005999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 107: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.326998,0.100999,-0.005999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 108: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.334998,0.100999,-0.005999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 109: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.334998,0.100999,-0.005999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 110: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.334998,0.100999,-0.005999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 111: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.360998,0.100999,-0.005999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 112: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.309998,0.084999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 113: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.332998,0.103999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 114: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.339998,0.103999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 115: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.335998,0.103999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 116: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.335998,0.103999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 117: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.304998,0.087999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 118: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.304998,0.087999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 119: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.327998,0.087999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 120: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.327998,0.087999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 121: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.339998,0.093999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 122: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.329998,0.091999,-0.001999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 123: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.329998,0.091999,-0.001999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 124: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.337998,0.097999,-0.001999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 125: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.335998,0.097999,-0.001999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 126: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.335998,0.097999,-0.001999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 127: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.335998,0.103999,-0.001999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 128: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.316998,0.103999,-0.001999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 129: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.195999, 0.085999, -0.002000, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 130: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.203999, 0.085999, -0.002000, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 131: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.286999, 0.085999, -0.002000, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 132: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.211999, 0.096999, 0.001999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 133: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.277999, 0.092999, 0.001999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 134: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.247998,0.103999,-0.001999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 135: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.277999, 0.099999, 0.001999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 136: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.247998,0.099999,-0.001999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 137: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.319998,0.089999,0.002000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 138: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.287999, 0.084999, 0.001999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 139: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.287999, 0.084999, 0.001999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 140: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.287999, 0.084999, 0.001999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 141: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.319998,0.089999,0.002000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 142: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.339998,0.097999,0.002000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 143: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.348998,0.109000,0.002000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 144: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.283999, 0.085999, -0.004000, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
					 	case 145: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.283999, 0.085999, -0.004000, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
					 	case 146: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.300999, 0.088999, -0.004000, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 147: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.322998,0.109000,0.007000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 148: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.322998,0.095000,0.002000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 149: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.315999, 0.062999, -0.004000, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 150: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.322998,0.095000,0.002000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 151: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.280999, 0.077999, 0.010999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 152: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.237999, 0.076999, 0.005999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 153: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.322998,0.110000,0.008000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 154: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.312998,0.110000,-0.004999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 155: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.340998,0.110000,-0.010999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 156: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.327998,0.110000,-0.005999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 157: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.280999, 0.085999, 0.005999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 158: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.280999, 0.085999, 0.005999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 159: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.280999, 0.085999, 0.005999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 160: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.303998,0.098000,0.000000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 161: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.288999, 0.082999, 0.005999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 162: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.275999, 0.077999, 0.005999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 163: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.361998,0.098000,0.000000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 164: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.355998,0.107000,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 165: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.271998,0.092000,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 166: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.271998,0.092000,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 167: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.270999, 0.087999, 0.005999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 168: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.270999, 0.087999, 0.005999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 169: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.270999, 0.087999, 0.005999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 170: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.340998,0.092000,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 171: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.340998,0.092000,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 172: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.340998,0.092000,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 173: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.337998,0.102000,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 174: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.337998,0.102000,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 175: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.337998,0.102000,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 176: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.337998,0.102000,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 177: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.337998,0.102000,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 178: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.284999, 0.083999, 0.005999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 179: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.337998,0.102000,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 180: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.337998,0.102000,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 181: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.337998,0.086000,-0.001999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 182: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.326998,0.103999,-0.001999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 183: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.333998,0.103999,-0.001999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 184: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.340998,0.103999,-0.006999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 185: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.330998,0.090999,-0.006999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 186: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.330998,0.090999,0.000000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 187: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.329998,0.111999,0.013000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 188: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.329998,0.099999,0.000000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 189: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.326998,0.099999,0.000000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 190: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.340998,0.090999,0.000000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 191: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.340998,0.090999,0.000000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 192: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.284999, 0.083999, 0.005999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 193: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.340998,0.090999,0.000000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 194: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.340998,0.090999,0.000000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 195: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.358998,0.101999,0.000000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 196: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.192999, 0.075999, 0.002999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 197: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.201999, 0.067999, 0.000999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 198: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.286999, 0.067999, 0.000999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 199: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.200999, 0.085999, 0.000999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 200: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.331998,0.098999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 201: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.269999, 0.085999, 0.000999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 202: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.324998,0.098999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 203: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.287999, 0.091999, 0.000999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 204: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.287999, 0.091999, 0.000999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 205: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.314999, 0.056999, 0.000999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 206: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.324998,0.098999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 207: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.257999, 0.087999, 0.000999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 208: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.318998,0.098999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 209: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.222999, 0.081999, 0.000999, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 210: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.256998,0.098999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 211: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.330998,0.098999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 212: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.252998,0.098999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 213: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.267999, 0.094999, -0.006000, -89.100006, 62.099994, -90.099990, 1.055000, 1.000000, 1.084000);
						case 214: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.272000, 0.071000, 0.000000, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 215: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.272000, 0.071000, 0.000000, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 216: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.272000, 0.071000, 0.000000, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 217: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.327998,0.103999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 218: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.204000, 0.070000, 0.000000, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 219: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.322998,0.091999,0.003000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 220: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.322998,0.091999,0.003000, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 221: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.351998,0.111999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 222: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.351998,0.111999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 223: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.337998,0.092999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 224: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.269000, 0.076000, 0.000000, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 225: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.269000, 0.076000, 0.000000, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 226: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.269000, 0.076000, 0.000000, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 227: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.361998,0.096999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 228: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.331998,0.109999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 229: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.274998,0.109999,-0.003999, -90.599975,-104.999977,92.599967, 1.033000,1.000000,1.000000);
						case 230: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.301998,0.101999,-0.003999, -90.599975,-104.999977,92.599967, 1.109000,1.000000,1.000000);
						case 231: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.194000, 0.080000, 0.000000, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 232: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.206000, 0.060000, -0.004999, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 233: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.336998,0.093999,-0.003999, -90.599975,-104.999977,92.599967, 0.950000,0.974000,1.000000);
						case 234: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.277998,0.093999,-0.003999, -90.599975,-104.999977,92.599967, 0.950000,0.974000,1.000000);
						case 235: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.268998,0.093999,-0.003999, -90.599975,-104.999977,92.599967, 0.950000,0.974000,1.000000);
						case 236: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.274998,0.093999,-0.003999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 237: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.244000, 0.074000, -0.004999, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 238: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.289000, 0.079000, -0.004999, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 239: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.387998,0.111999,-0.001999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 240: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.325998,0.087999,-0.001999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 241: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.311999, 0.087000, -0.004999, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 242: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.317999, 0.077000, -0.004999, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 243: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.259000, 0.088000, -0.004999, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 244: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.274000, 0.088000, -0.004999, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 245: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.290999, 0.057000, -0.004999, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 246: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.311999, 0.057000, -0.004999, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 247: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.345998,0.103999,-0.007999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 248: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.345998,0.103999,-0.007999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 249: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.288999, 0.104999, 0.006000, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 250: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.334998,0.103999,-0.002999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 251: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.289999, 0.081999, -0.000999, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 252: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.334998,0.103999,-0.005999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 253: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.231999, 0.095999, -0.008000, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 254: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.334998,0.103999,-0.005999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 255: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.332998,0.103999,0.009000, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 256: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.295999, 0.071000, -0.008000, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 257: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.273999, 0.075999, -0.008000, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 258: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.348998,0.103999,0.001000, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 259: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.348998,0.103999,0.001000, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 261: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.276998,0.103999,0.001000, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 262: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.317998,0.083999,0.001000, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 263: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.277999, 0.070000, -0.008000, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 264: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.294999, 0.104999, 0.001000, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 265: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.317998,0.083999,-0.004999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 266: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.304998,0.070999,-0.004999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 267: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.531998,0.082000,-0.039000, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 268: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.288999, 0.093999, 0.001000, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 269: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.368998,0.068000,-0.007999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 270: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.355998,0.091000,-0.007999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 271: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.339998,0.094000,0.002000, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 272: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.334998,0.094000,-0.001999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 273: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.315998,0.094000,-0.001999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 274: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.342998,0.094000,-0.001999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 275: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.342998,0.094000,-0.001999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 276: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.342998,0.094000,-0.001999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 277: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.322999, 0.097999, 0.001000, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 278: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.322999, 0.097999, 0.001000, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 279: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.322999, 0.097999, 0.001000, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 280: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.342998,0.094000,-0.001999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 281: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.342998,0.094000,-0.001999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 282: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.342998,0.094000,-0.001999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 283: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.342998,0.094000,-0.001999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 284: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.342998,0.104999,-0.001999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 285: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.342998,0.090999,0.002000, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 286: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.337998,0.086999,-0.003999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 287: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.345998,0.097999,-0.000999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 288: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.341998,0.097999,-0.000999, -90.599975,-104.999977,92.599967, 1.022999,0.974000,1.000000);
						case 289: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.307996,0.097000,-0.000999, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 290: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.307996,0.097000,0.002001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 291: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.307996,0.097000,0.002001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 292: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.328996,0.074000,0.002001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 293: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.338996,0.084000,0.002001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 294: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.338996,0.084000,0.002001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 295: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.260996,0.084000,0.002001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 296: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.260996,0.093999,0.007001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 297: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.318996,0.093999,0.000001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 298: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.312996,0.093999,0.000001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 299: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.320999, 0.097999, -0.004000, -96.400062, 58.200012, -89.899955, 1.000000, 1.000000, 1.000000);
						case 300: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.331996,0.099999,0.000001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 301: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.331996,0.099999,0.000001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 302: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.331996,0.099999,0.000001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 303: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.331996,0.099999,0.000001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 304: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.331996,0.099999,0.000001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 305: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.331996,0.099999,0.000001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 306: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.326996,0.093999,0.000001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 307: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.326996,0.093999,0.000001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 308: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.326996,0.093999,0.000001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 309: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.326996,0.093999,0.000001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 310: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.326996,0.093999,0.000001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						case 311: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.326996,0.093999,0.000001, -94.199966,-113.199882,85.200004, 1.000000,1.000000,1.000000);
						default: SetPlayerAttachedObject(playerid, 1, object_id, 1, 0.286000,0.089000,-0.006000, -90.599975,-121.999969,92.599967, 1.000000,1.000000,1.000000);
					}
				}
			}
		} 
		case INV_PLAYER_DEST_GLASSES: {
			switch(type) {
				case 1: {
					switch(skin) {
						case 1: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.102998,0.030999,-0.001001, 0.000000,90.000000,90.500007, 1.000000,1.058000,1.000000);
						case 2: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.092998,0.039999,-0.001001, 0.000000,90.000000,90.500007, 1.000000,1.058000,1.000000);
						case 3: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.104998,0.044999,-0.000001, 0.000000,90.000000,90.500007, 1.000000,1.099000,1.080000);
						case 4: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.128998,0.026999,-0.001000, 76.200012,73.100074,15.000033, 1.000000,1.130000,1.080000);
						case 5: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.128998,0.037999,-0.005000, 138.500000,87.300071,-47.999965, 1.000000,1.217000,1.080000);
						case 6: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.105997,0.029999,-0.000000, 138.500000,87.300071,-47.999965, 1.000000,1.017000,1.080000);
						case 7: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.098997,0.054999,-0.007000, 138.500000,87.300071,-47.999965, 1.000000,1.134000,1.080000);
						case 8: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.088997,0.040999,-0.003000, 138.500000,87.300071,-47.999965, 1.000000,1.134000,1.080000);
						case 9: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.066997,0.034999,-0.001000, 138.500000,87.300071,-47.999965, 1.000000,1.134000,1.080000);
						case 10: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.081997,0.039999,-0.001000, 138.500000,87.300071,-47.999965, 1.000000,1.134000,1.080000);
						case 11: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.076998,0.039999,0.000999, 138.500000,87.300071,-47.999965, 1.000000,1.134000,1.080000);
						case 12: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.076998,0.035999,0.001999, 138.500000,87.300071,-47.999965, 1.000000,1.134000,1.080000);
						case 13: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.082998,0.031999,-0.001000, 138.500000,87.300071,-47.999965, 1.000000,1.134000,1.080000);
						case 14: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.094998,0.056999,-0.001000, 138.500000,87.300071,-47.999965, 1.000000,1.166000,1.080000);
						case 15: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.079998,0.019999,-0.002000, 138.500000,87.300071,-47.999965, 1.000000,1.166000,1.080000);
						case 17: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.098998,0.035999,0.000999, 138.500000,87.300071,-47.999965, 1.000000,1.166000,1.080000);
						case 19: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.081998,0.035999,-0.003000, 138.500000,87.300071,-47.999965, 1.000000,1.166000,1.080000);
						case 20: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.102998,0.030999,-0.003000, 138.500000,87.300071,-47.999965, 1.000000,1.166000,1.080000);
						case 21: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.093998,0.047999,-0.003000, 138.500000,87.300071,-47.999965, 1.000000,1.166000,1.080000);
						case 22: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.093998,0.047999,-0.007000, 138.500000,87.300071,-47.999965, 1.000000,1.166000,1.080000);
						case 23: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.102998,0.047999,-0.007000, 138.500000,87.300071,-47.999965, 1.000000,1.166000,1.080000);
						case 24: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.090998,0.037999,-0.000000, 138.500000,87.300071,-47.999965, 1.000000,1.085000,1.080000);
						case 25: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.091998,0.034999,0.000999, 138.500000,87.300071,-47.999965, 1.000000,1.145000,1.080000);
						case 26: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.086998,0.036999,-0.003000, 138.500000,87.300071,-47.999965, 1.000000,1.145000,1.080000);
						case 27: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.096998,0.036999,-0.003000, 138.500000,87.300071,-47.999965, 1.000000,1.145000,1.080000);
						case 28: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.096998,0.046999,-0.006000, 138.500000,87.300071,-47.999965, 1.000000,1.145000,1.080000);
						case 29: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.090998,0.051999,-0.000000, 138.500000,87.300071,-47.999965, 1.000000,1.145000,1.080000);
						case 31: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.090998,0.052999,-0.004000, 138.500000,87.300071,-47.999965, 1.000000,1.145000,1.080000);
						case 39: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.080998,0.034999,-0.005000, 138.500000,87.300071,-47.999965, 1.000000,1.145000,1.080000);
						case 40: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.071998,0.030999,-0.001000, 138.500000,87.300071,-47.999965, 1.000000,1.145000,1.080000);
						case 41: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.079998,0.042999,-0.001000, 138.500000,87.300071,-47.999965, 1.000000,1.145000,1.080000);
						case 42: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.091998,0.036999,-0.002000, 138.500000,87.300071,-47.999965, 1.000000,1.145000,1.080000);
						case 44: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.088998,0.041999,-0.002000, 138.500000,87.300071,-47.999965, 1.000000,1.029000,1.027000);
						case 46: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.095998,0.059999,-0.001000, 138.500000,87.300071,-47.999965, 1.000000,1.155000,1.027000);
						case 49: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.093998,0.035999,-0.004000, 138.500000,87.300071,-47.999965, 1.000000,1.155000,1.027000);
						case 50: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.105998,0.012999,-0.008000, 138.500000,87.300071,-47.999965, 1.000000,1.155000,1.027000);
						case 54: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.085998,0.052999,-0.000000, 138.500000,87.300071,-47.999965, 1.000000,1.155000,1.027000);
						case 58: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.092998,0.028999,-0.002000, 138.500000,87.300071,-47.999965, 1.000000,0.994000,1.027000);
						case 59: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.092998,0.036999,-0.001000, 138.500000,87.300071,-47.999965, 1.000000,1.100000,1.027000);
						case 60: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.092998,0.050999,-0.005000, 138.500000,87.300071,-47.999965, 1.000000,1.130000,1.027000);
						case 61: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.087998,0.048999,-0.004000, 138.500000,87.300071,-47.999965, 0.880000,0.993001,1.027000);
						case 66: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.097998,0.041999,-0.001000, 138.500000,87.300071,-47.999965, 0.880000,1.076001,1.027000);
						case 67: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.097998,0.041999,-0.000000, 138.500000,87.300071,-47.999965, 0.880000,1.076001,1.027000);
						case 68: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.091998,0.051999,-0.002000, 138.500000,87.300071,-47.999965, 0.880000,1.076001,1.027000);
						case 69: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.070998,0.048999,-0.002000, 138.500000,87.300071,-47.999965, 0.880000,1.076001,1.027000);
						case 70: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.090998,0.055999,0.005999, 138.500000,87.300071,-47.999965, 0.880000,1.076001,1.027000);
						case 71: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.090998,0.033999,-0.000000, 138.500000,87.300071,-47.999965, 0.880000,1.076001,1.027000);
						case 72: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.090998,0.053999,-0.001000, 138.500000,87.300071,-47.999965, 0.880000,1.076001,1.027000);
						case 73: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.090998,0.045999,-0.001000, 138.500000,87.300071,-47.999965, 0.880000,1.076001,1.027000);
						case 76: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.072998,0.041999,-0.001000, 138.500000,87.300071,-47.999965, 0.880000,1.127000,1.027000);
						case 78: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.114998,0.023999,0.007999, -121.799896,96.400039,-147.299835, 0.880000,0.983000,1.027000);
						case 79: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.094998,0.036999,0.009999, -121.799896,96.400039,-147.299835, 0.880000,0.983000,1.027000);
						case 83: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.088998,0.042999,-0.000000, -121.799896,96.400039,-147.299835, 0.880000,0.983000,1.027000);
						case 90: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.076998,0.046999,-0.000000, -121.799896,96.400039,-147.299835, 0.880000,1.069000,1.027000);
						case 91: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.071998,0.040999,-0.000000, -121.799896,96.400039,-147.299835, 0.880000,1.069000,1.027000);
						case 93: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.071998,0.051999,-0.001000, -121.799896,96.400039,-147.299835, 0.880000,1.139000,1.027000);
						case 94: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.045998,0.024999,-0.000000, -121.599906,96.400039,-147.299835, 0.880000,0.950000,1.027000);
						case 95: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.084998,0.013999,-0.000000, -121.599906,96.400039,-147.299835, 0.880000,0.982000,1.027000);
						case 96: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.106998,0.041999,0.000999, -121.599906,96.400039,-147.299835, 0.880000,1.019000,1.027000);
						case 97: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.060998,0.040999,0.000999, -121.599906,96.400039,-147.299835, 0.880000,1.019000,1.027000);
						case 98: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.094998,0.068999,-0.000000, -121.599906,96.400039,-147.299835, 0.880000,1.069000,1.027000);
						case 101: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.089998,0.042999,0.000999, -121.599906,96.400039,-147.299835, 0.880000,1.069000,1.027000);
						case 102: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.089998,0.056999,-0.001000, -121.599906,96.400039,-147.299835, 0.880000,1.069000,1.027000);
						case 103: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.089998,0.050999,-0.000000, -121.599906,96.400039,-147.299835, 0.880000,1.116000,1.027000);
						case 105: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.089998,0.050999,-0.000000, -121.599906,96.400039,-147.299835, 0.880000,1.150000,1.027000);
						case 106: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.098998,0.050999,-0.003000, -121.599906,96.400039,-147.299835, 0.880000,1.150000,1.027000);
						case 107: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.100998,0.039999,-0.003000, -121.599906,96.400039,-147.299835, 1.020000,1.150000,1.027000);
						case 108: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.085998,0.037999,0.002999, -121.599906,96.400039,-147.299835, 1.020000,1.150000,1.027000);
						case 109: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.085998,0.044999,-0.004000, -121.599906,96.400039,-147.299835, 1.020000,1.147000,1.027000);
						case 110: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.085998,0.044999,-0.004000, -121.599906,96.400039,-147.299835, 1.020000,1.126000,1.027000);
						case 111: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.108998,0.029999,-0.003000, -92.899909,88.200088,-176.599822, 1.020000,1.079000,1.027000);
						case 112: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.095998,0.027999,-0.003000, -92.899909,88.200088,-176.599822, 0.904000,0.976999,1.027000);
						case 113: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.109998,0.051999,-0.001000, -92.899909,88.200088,-176.599822, 0.904000,1.115000,1.027000);
						case 117: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.085998,0.050999,-0.001000, -92.899909,90.100112,-176.599822, 0.904000,1.115000,1.027000);
						case 118: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.085998,0.050999,-0.001000, -92.899909,90.100112,-176.599822, 0.904000,1.115000,1.027000);
						case 119: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.091998,0.044999,-0.001000, -92.899909,94.700088,-176.599822, 0.904000,1.115000,1.027000);
						case 120: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.091998,0.040999,0.001999, -92.899909,92.700088,-176.599822, 0.904000,1.115000,1.027000);
						case 121: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.091998,0.029999,0.001999, -92.899909,100.800102,-176.599822, 1.055000,1.279000,1.162999);
						case 122: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.088998,0.029999,0.001999, -92.899909,100.800102,-176.599822, 1.055000,1.122000,1.093999);
						case 124: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.101998,0.033999,-0.002001, -92.899909,96.000068,-176.599822, 1.055000,1.122000,1.093999);
						case 125: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.090998,0.033999,-0.002001, -92.899909,92.200057,-174.999862, 1.025000,1.062000,1.093999);
						case 126: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.090998,0.033999,-0.000001, -92.899909,92.200057,-175.999877, 1.025000,1.062000,1.093999);
						case 127: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.101998,0.041999,-0.001001, -92.899909,92.200057,-175.999877, 1.025000,1.062000,1.093999);
						case 128: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.101998,0.047999,-0.003000, -92.899909,92.200057,-175.999877, 1.025000,1.062000,1.093999);
						case 134: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.082998,0.029999,0.001999, -92.899909,103.300056,-179.899917, 0.871000,1.031000,1.093999);
						case 135: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.071998,0.037999,-0.002000, -92.899909,103.300056,-174.699890, 0.871000,1.031000,1.093999);
						case 136: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.086998,0.025999,-0.002000, -92.899909,103.300056,-173.099945, 0.871000,1.031000,1.093999);
						case 142: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.086998,0.049999,-0.005001, -92.899909,103.300056,-176.499954, 0.871000,1.085999,1.093999);
						case 147: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.086998,0.031999,0.005999, -92.899909,103.300056,-176.499954, 0.871000,1.085999,1.093999);
						case 148: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.060998,0.045999,0.003999, -92.899909,97.400032,-176.499954, 0.871000,1.085999,1.093999);
						case 150: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.066998,0.043999,0.002999, -92.899909,97.400032,-176.499954, 0.871000,1.085999,1.093999);
						case 153: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.077998,0.023999,0.007999, -92.899909,105.900032,-176.499954, 0.871000,1.085999,1.093999);
						case 154: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.058998,0.040999,-0.002001, -92.899909,96.300025,-176.099960, 0.871000,1.085999,1.093999);
						case 155: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.087998,0.052999,-0.005001, -92.899909,96.300025,-177.899948, 0.871000,1.085999,1.093999);
						case 160: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.100998,0.028999,-0.001000, -92.899909,96.300025,-177.899948, 0.871000,1.085999,1.093999);
						case 163: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.096998,0.030999,-0.001000, -92.899909,97.100036,-177.899948, 0.871000,1.085999,1.093999);
						case 164: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.096998,0.035999,-0.001000, -92.899909,97.100036,-177.899948, 0.871000,1.085999,1.093999);
						case 165: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.075998,0.046999,-0.000001, -92.899909,97.100036,-174.299972, 0.871000,1.085999,1.093999);
						case 166: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.074998,0.043999,-0.000001, -92.899909,97.100036,-175.899978, 0.871000,1.085999,1.093999);
						case 169: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.067998,0.040999,-0.000001, -92.899909,97.100036,-175.899978, 0.871000,1.085999,1.093999);
						case 170: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.091998,0.053999,-0.005001, -92.899909,92.100044,-175.899978, 0.871000,1.069999,1.093999);
						case 171: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.091998,0.042999,-0.001000, -92.899909,92.100044,-175.899978, 0.871000,1.116999,1.093999);
						case 172: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.067998,0.044999,0.001999, -92.899909,92.100044,-175.899978, 0.871000,1.116999,1.093999);
						case 176: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.095998,0.047999,-0.005001, -92.899909,92.100044,-175.899978, 0.980000,1.186999,1.093999);
						case 177: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.095998,0.041999,-0.007001, -92.899909,92.100044,-175.899978, 0.980000,1.186999,1.093999);
						case 179: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.095998,0.043999,-0.005001, -92.899909,92.100044,-175.899978, 0.980000,1.186999,1.093999);
						case 180: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.099998,0.043999,-0.005001, -92.899909,92.100044,-175.899978, 0.980000,1.186999,1.093999);
						case 181: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.122998,0.036999,-0.003000, -92.899909,92.100044,-175.899978, 0.980000,1.043999,1.093999);
						case 182: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.079998,0.033999,-0.003000, -92.899909,92.100044,-175.899978, 0.980000,1.043999,1.093999);
						case 183: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.093998,0.028999,-0.003000, -92.899909,92.100044,-175.899978, 0.980000,1.043999,1.093999);
						case 184: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.089998,0.050999,-0.006001, -92.899909,92.100044,-175.899978, 0.980000,1.078999,1.093999);
						case 186: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.089998,0.034999,0.000999, -92.899909,92.100044,-176.700012, 0.980000,1.078999,1.093999);
						case 187: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.075998,0.023999,0.004999, -92.899909,105.300056,-176.700012, 0.980000,1.119999,1.093999);
						case 188: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.088998,0.034999,-0.000001, -92.899909,105.300056,-173.700042, 0.980000,1.119999,1.093999);
						case 189: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.092998,0.033999,0.000999, -92.899909,92.900062,-173.700042, 0.980000,1.119999,1.093999);
						case 190: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.092998,0.040999,-0.003000, -92.899909,92.900062,-173.700042, 0.980000,1.119999,1.093999);
						case 191: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.092998,0.040999,-0.003000, -92.899909,92.900062,-173.700042, 0.980000,1.119999,1.093999);
						case 192: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.087998,0.040999,-0.002000, -92.899909,92.900062,-173.700042, 0.980000,1.119999,1.093999);
						case 193: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.087998,0.037999,-0.001000, -92.899909,92.900062,-173.700042, 0.980000,1.119999,1.093999);
						case 194: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.087998,0.037999,-0.001000, -92.899909,92.900062,-173.700042, 0.980000,1.119999,1.093999);
						case 195: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.087998,0.036999,0.000999, -92.899909,92.900062,-176.100021, 0.980000,1.119999,1.093999);
						case 200: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.095998,0.037999,-0.001000, -92.899909,92.900062,-176.100021, 0.980000,1.119999,1.093999);
						case 202: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.102998,0.041999,-0.001000, -92.899909,92.900062,-176.100021, 0.980000,0.981999,1.093999);
						case 206: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.102998,0.041999,-0.001000, -92.899909,92.900062,-176.100021, 0.980000,0.981999,1.093999);
						case 210: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.084998,0.022999,-0.001000, -92.899909,92.900062,-176.100021, 0.980000,0.981999,1.093999);
						case 211: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.070998,0.040999,-0.001000, -92.899909,92.900062,-176.100021, 0.980000,0.981999,1.093999);
						case 212: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.096998,0.035999,-0.001000, -92.899909,92.900062,-176.100021, 0.839000,0.981999,1.093999);
						case 213: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.098998,0.048999,-0.002001, -92.899909,92.900062,-176.100021, 0.839000,1.098999,1.093999);
						case 214: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.063998,0.045999,-0.002001, -92.899909,92.900062,-176.100021, 0.839000,1.098999,1.093999);
						case 216: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.063998,0.044999,-0.002001, -92.899909,92.900062,-176.100021, 0.839000,1.098999,1.093999);
						case 217: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.093998,0.048999,-0.003001, -92.899909,92.900062,-176.100021, 0.839000,1.098999,1.093999);
						case 219: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.068998,0.044999,-0.003001, -92.899909,92.900062,-176.100021, 0.839000,1.098999,1.093999);
						case 220: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.054998,0.059999,-0.002001, -92.899909,92.900062,-176.100021, 0.839000,1.098999,1.093999);
						case 221: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.096998,0.046999,-0.001001, -92.899909,92.900062,-176.100021, 0.839000,1.161999,1.093999);
						case 222: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.089998,0.053999,-0.001001, -92.899909,92.900062,-176.100021, 0.839000,1.161999,1.093999);
						case 223: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.089998,0.071999,-0.000001, -92.899909,90.000053,-176.100021, 0.839000,1.161999,1.093999);
						case 224: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.061998,0.045999,-0.000001, -92.899909,90.000053,-176.100021, 0.839000,1.161999,1.093999);
						case 225: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.061998,0.045999,-0.000001, -92.899909,90.000053,-176.100021, 0.839000,1.161999,1.093999);
						case 226: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.061998,0.045999,-0.000001, -92.899909,90.000053,-176.100021, 0.839000,1.161999,1.093999);
						case 227: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.109998,0.057999,-0.000001, -92.899909,90.000053,-176.100021, 0.839000,1.161999,1.093999);
						case 228: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.101998,0.068999,-0.000000, -92.899909,90.000053,-176.100021, 0.839000,1.161999,1.093999);
						case 229: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.073998,0.035999,-0.000000, -92.899909,103.200050,-176.100021, 0.839000,1.161999,1.093999);
						case 230: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.055998,0.035999,-0.000000, -92.899909,103.200050,-176.100021, 0.839000,0.999000,1.093999);
						case 233: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.064998,0.048999,-0.000000, -92.899909,93.900032,-176.100021, 0.839000,0.999000,1.093999);
						case 235: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.053998,0.027999,-0.000000, -92.899909,93.900032,-176.100021, 0.839000,0.999000,1.093999);
						case 236: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.084998,0.038999,-0.000000, -92.899909,93.900032,-176.100021, 0.839000,1.093000,1.093999);
						case 239: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.101998,0.021999,0.004999, -92.899909,106.200004,-176.100021, 0.839000,0.959000,1.093999);
						case 240: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.089998,0.051999,0.000999, -92.899909,87.499969,-176.100021, 0.839000,1.129000,1.093999);
						case 247: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.099998,0.051999,0.000999, -92.899909,96.499946,-176.100021, 0.839000,1.129000,1.093999);
						case 248: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.088998,0.062999,-0.001000, -92.899909,96.499946,-176.100021, 0.839000,1.182000,1.093999);
						case 250: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.088998,0.054999,-0.004000, -92.899909,96.499946,-176.100021, 0.839000,1.033000,1.093999);
						case 252: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.088998,0.045999,0.000999, -92.899909,96.499946,-176.100021, 0.839000,1.033000,1.093999);
						case 254: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.097998,0.048999,-0.001001, -92.899909,96.499946,-176.100021, 0.839000,1.134000,1.093999);
						case 255: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.079998,0.031999,0.005999, -92.899909,96.499946,-176.100021, 0.839000,0.972000,0.954999);
						case 258: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.086998,0.057999,0.001999, -92.899909,96.499946,-176.100021, 0.839000,1.079000,1.113999);
						case 259: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.086998,0.057999,0.001999, -92.899909,96.499946,-176.100021, 0.839000,1.079000,1.113999);
						case 261: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.094998,0.023999,-0.001001, -92.899909,96.499946,-176.100021, 0.839000,0.945999,1.113999);
						case 262: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.081998,0.048999,-0.002001, -92.899909,88.299957,-177.600051, 0.839000,1.070999,1.113999);
						case 265: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.094997,0.037999,-0.000001, -92.899909,88.299957,-177.600051, 0.839000,1.070999,1.113999);
						case 266: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.103997,0.034999,-0.005001, -92.899909,88.299957,-177.600051, 0.839000,1.097000,1.113999);
						case 267: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.094997,0.036999,-0.001001, -92.899909,97.999961,-175.800079, 0.839000,1.097000,1.113999);
						case 270: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.093997,0.036999,-0.001001, -92.899909,97.999961,-175.800079, 0.839000,1.097000,1.113999);
						case 272: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.093997,0.050999,-0.001001, -92.899909,97.999961,-175.800079, 0.839000,1.097000,1.113999);
						case 273: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.079997,0.041999,-0.001001, -92.899909,91.199951,-177.200103, 0.839000,1.097000,1.113999);
						case 274: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.088997,0.035999,-0.003001, -92.899909,91.199951,-177.200103, 0.839000,1.097000,1.113999);
						case 275: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.086997,0.035999,-0.002001, -92.899909,91.199951,-177.200103, 0.839000,1.097000,1.113999);
						case 276: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.086997,0.033999,-0.001001, -92.899909,91.199951,-177.200103, 0.839000,1.097000,1.027999);
						case 280: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.086997,0.037999,-0.002001, -92.899909,91.199951,-177.200103, 0.839000,1.060999,1.027999);
						case 281: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.085997,0.036999,-0.002001, -92.899909,91.199951,-177.200103, 0.839000,1.060999,1.027999);
						case 282: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.087997,0.035999,-0.002001, -92.899909,91.199951,-177.200103, 0.839000,1.060999,1.027999);
						case 283: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.082997,0.035999,-0.002001, -92.899909,91.199951,-177.200103, 0.839000,1.060999,1.027999);
						case 286: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.085997,0.035999,-0.002001, -92.899909,91.199951,-177.200103, 0.839000,1.060999,1.027999);
						case 287: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.075000, 0.055000, 0.005000, 95.599983, 95.300071, -6.000004, 1.000000, 1.000000, 1.000000);
						case 288: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.086997,0.034999,-0.000001, -92.899909,91.199951,-177.200103, 0.839000,1.060999,1.027999);
						case 291: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.091998,0.050999,-0.000001, -92.899909,91.199951,-177.200103, 0.839000,1.060999,1.027999);
						case 292: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.075997,0.032000,-0.005001, 97.999969,81.400047,-4.900008, 0.878000,1.000000,1.000000);
						case 293: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.083997,0.038999,-0.008001, 97.999969,81.400047,-4.900008, 0.878000,1.000000,1.000000);
						case 295: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.079997,0.045999,-0.000001, 95.799949,87.600059,-4.900008, 0.878000,1.087000,1.000000);
						case 296: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.079997,0.040999,-0.000001, 95.799949,67.300048,-4.900008, 0.878000,1.087000,1.000000);
						case 297: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.090997,0.044999,-0.000001, 95.799949,81.400077,-4.900008, 0.878000,1.087000,1.000000);
						case 298: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.090997,0.033999,-0.004001, 95.799949,81.400077,-4.900008, 0.878000,1.087000,1.000000);
						case 299: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.090997,0.052999,-0.000001, 95.799949,81.400077,-4.900008, 0.878000,1.087000,1.000000);
						case 300: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.083997,0.033999,-0.002001, 95.799949,89.500076,-3.500008, 0.878000,1.042000,1.000000);
						case 301: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.083997,0.033999,-0.002001, 95.799949,89.500076,-3.500008, 0.878000,1.042000,1.000000);
						case 302: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.087997,0.033999,-0.003001, 95.799949,89.500076,-3.500008, 0.878000,1.042000,1.000000);
						case 303: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.087997,0.033999,-0.001001, 95.799949,89.500076,-3.500008, 0.878000,1.042000,1.000000);
						case 304: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.087997,0.033999,-0.001001, 95.799949,89.500076,-3.500008, 0.878000,1.042000,1.000000);
						case 305: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.087997,0.033999,-0.001001, 95.799949,89.500076,-3.500008, 0.878000,1.042000,1.000000);
						case 306: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.066997,0.048999,-0.004001, 95.799949,89.500076,-3.500008, 0.878000,1.042000,1.000000);
						case 307: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.066997,0.048999,-0.004001, 95.799949,89.500076,-3.500008, 0.878000,1.042000,1.000000);
						case 308: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.066997,0.048999,-0.003001, 95.799949,89.500076,-3.500008, 0.878000,1.042000,1.000000);
						case 309: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.066997,0.048999,-0.003001, 95.799949,89.500076,-3.500008, 0.878000,1.042000,1.000000);
						case 310: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.086997,0.030999,-0.003001, 95.799949,89.500076,-3.500008, 0.878000,1.042000,1.000000);
						case 311: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.086997,0.030999,-0.003001, 95.799949,89.500076,-3.500008, 0.878000,1.042000,1.000000);
						default: SetPlayerAttachedObject(playerid, 2, object_id, 2,  0.102998,0.030999,-0.001001, 0.000000,90.000000,90.500007, 1.000000,1.058000,1.000000);
					}
				}
			}
		}
		case INV_PLAYER_DEST_MASKS: {
			switch(type) {
				case 1: {
					switch(skin) {
						case 287: SetPlayerAttachedObject(playerid, 3, object_id, 2, 0.056999, 0.045999, 0.010000, -92.700035, -7.600005, -91.900047, 1.000000, 1.000000, 1.000000);
						case 0..4, 6..286, 288..311: SetPlayerAttachedObject(playerid, 3, object_id, 2, 0.068000, 0.035000, -0.004000, -90.099967, 6.300001, -88.999961, 1.083000, 0.894000, 1.080000);
						case 5: SetPlayerAttachedObject(playerid, 3, object_id, 2, 0.104000, 0.021999, -0.004000, -90.099967, 6.300001, -88.999961, 1.218000, 0.894000, 1.080000);
						default: SetPlayerAttachedObject(playerid, 3, object_id, 18, 0.136999,-0.046000,0.006000,95.599845,-35.199943,9.800123,1.000000,1.000000,1.000000);
					}
				}
				case 2: {
					switch(skin) {
						case 0..311: SetPlayerAttachedObject(playerid, 3, object_id, 2, 0.097000, 0.040000, 0.000000, 93.300003, 83.399993, 0.000000, 1.118000, 1.123000, 1.055999);
						default: SetPlayerAttachedObject(playerid, 3, object_id, 2, 0.097000, 0.040000, 0.000000, 93.300003, 83.399993, 0.000000, 1.118000, 1.123000, 1.055999);
					}
				}
				case 3: {
					switch(skin) {
						case 0..311: SetPlayerAttachedObject(playerid, 3, object_id, 2, 0.078999, 0.095000, -0.010999, 171.500015, 91.199996, -0.499999, 0.422000, 0.707000, 0.509000);
						default: SetPlayerAttachedObject(playerid, 3, object_id, 2, 0.078999, 0.095000, -0.010999, 171.500015, 91.199996, -0.499999, 0.422000, 0.707000, 0.509000);
					}
				}
				case 4: {
					switch(skin) {
						case 0..4, 6..311: SetPlayerAttachedObject(playerid, 3, object_id, 2, 0.006000, 0.136999, 0.012999, 95.499984, 74.800010, 3.799999, 1.093999, 1.118000, 1.062000);
						case 5: SetPlayerAttachedObject(playerid, 3, object_id, 2, 0.006000, 0.151999, 0.005999, 95.499984, 74.800010, 3.799999, 1.000000, 1.167999, 1.000000);
						default: SetPlayerAttachedObject(playerid, 3, object_id, 18, 0.136999,-0.046000,0.006000,95.599845,-35.199943,9.800123,1.000000,1.000000,1.000000);
					}
				}
				case 5: {
					switch(skin) {
						case 0..4, 6..20: SetPlayerAttachedObject(playerid, 3, object_id, 2, -0.069999, 0.016999, -0.032999, 0.000000, 0.000000, 0.000000, 1.197000, 1.443000, 1.322999);
						case 5: SetPlayerAttachedObject(playerid, 3, object_id, 2, -0.088999, 0.052000, -0.051999, 0.000000, 0.000000, 0.000000, 1.197000, 2.082998, 2.034999);
						case 21..48: SetPlayerAttachedObject(playerid, 3, 19469, 2, -0.101999, 0.062999, -0.051999, 0.000000, 0.000000, 0.000000, 1.197000, 1.895998, 1.785999);
						case 49..170: SetPlayerAttachedObject(playerid, 3, 19469, 2, -0.101999, 0.062999, -0.051999, 0.000000, 0.000000, 0.000000, 1.197000, 1.895998, 1.785999);
						case 171..299: SetPlayerAttachedObject(playerid, 3, 19469, 2, -0.101999, 0.040000, -0.051999, 0.000000, 0.000000, 0.000000, 1.197000, 1.895998, 1.785999);
						case 300..311: SetPlayerAttachedObject(playerid, 3, 19469, 2, -0.101999, 0.040000, -0.051999, 0.000000, 0.000000, 0.000000, 1.197000, 1.895998, 1.785999);
						default: SetPlayerAttachedObject(playerid, 3, 19469, 2, -0.101999, 0.040000, -0.051999, 0.000000, 0.000000, 0.000000, 1.197000, 1.895998, 1.785999);
					}
				}
			}
		}
		case INV_PLAYER_DEST_WATCH: {
			switch(type) {
				case 1: {
					switch(skin) {
						case 1: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.018999,-0.003998,-0.001999, 51.200016,53.199977,142.800018, 0.963999,0.916999,1.000000);
						case 2: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.018999,-0.001999,-0.005999, 51.200016,53.199977,142.800018, 1.226999,1.173999,1.000000);
						case 3: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.018999,-0.001999,-0.007999, 51.200016,53.199977,142.800018, 1.226999,1.173999,1.000000);
						case 4: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.018999,-0.001999,-0.012999, 51.200016,53.199977,142.800018, 1.226999,1.173999,1.000000);
						case 5: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.011000,-0.018998,-0.000999, 51.200016,70.499969,142.800018, 1.354999,1.441999,1.000000);
						case 8: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.011000,-0.003998,-0.011999, 51.200016,70.499969,142.800018, 1.354999,1.441999,1.000000);
						case 11: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.011000,-0.007998,-0.001999, 51.200016,70.499969,142.800018, 1.102999,1.100999,1.000000);
						case 13: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.011000,-0.007998,-0.001999, 51.200016,70.499969,142.800018, 1.102999,1.100999,1.000000);
						case 14: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.011000,-0.007998,-0.001999, 51.200016,70.499969,142.800018, 1.102999,1.100999,1.000000);
						case 15: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.018999,-0.002998,-0.015999, 51.200016,70.499969,142.800018, 1.102999,1.100999,1.000000);
						case 18: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.018999,-0.010998,-0.012999, 51.200016,70.499969,142.800018, 1.102999,1.100999,1.000000);
						case 20: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.018999,-0.006998,-0.006999, 51.200016,70.499969,142.800018, 1.102999,1.100999,1.000000);
						case 21: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.018999,-0.006998,-0.006999, 51.200016,70.499969,142.800018, 1.236999,1.188999,1.000000);
						case 23: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.018999,-0.006998,-0.006999, 51.200016,70.499969,142.800018, 1.236999,1.188999,1.000000);
						case 24: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.018999,-0.009998,-0.011999, 51.200016,70.499969,142.800018, 1.236999,1.188999,1.000000);
						case 25: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.010999,-0.008998,-0.008999, 51.200016,70.499969,142.800018, 1.236999,1.188999,1.000000);
						case 26: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.010999,-0.008998,-0.008999, 51.200016,70.499969,142.800018, 1.236999,1.188999,1.000000);
						case 28: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.010999,-0.008998,-0.005999, 51.200016,70.499969,142.800018, 1.236999,1.188999,1.000000);
						case 30: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.010999,-0.003998,-0.005999, 51.200016,70.499969,142.800018, 1.236999,1.188999,1.000000);
						case 31: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.010999,-0.003998,-0.005999, 51.200016,70.499969,142.800018, 1.236999,1.188999,1.000000);
						case 32: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.010999,-0.003998,0.008001, 51.200016,70.499969,142.800018, 0.964999,0.921999,1.000000);
						case 34: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.010999,-0.003998,-0.011998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 35: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.054000,-0.003998,-0.011998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 36: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.054000,-0.003998,-0.015999, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 37: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.054000,-0.003998,-0.015999, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 38: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.024000,-0.003998,-0.015999, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 40: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.024000,-0.003998,-0.010998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 41: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.004000,-0.005998,0.001001, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 42: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.004000,-0.005998,-0.012998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 43: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.004000,-0.005998,-0.001998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 44: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.004000,-0.005998,-0.001998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 45: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.004000,-0.015998,-0.008998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 46: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.004000,-0.008998,-0.008998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 47: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.004000,0.001001,-0.000998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 48: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.008000,0.001001,-0.003998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 49: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.008000,-0.007998,-0.003998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 51: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.008000,-0.010998,-0.011998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 52: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.008000,-0.010998,-0.011998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 53: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.008000,-0.003998,-0.011998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 55: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.008000,-0.003998,-0.001998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 56: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.008000,-0.003998,-0.003998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 57: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.026999,0.005001,-0.003998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 58: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.003000,-0.003998,-0.007998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 59: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.003000,-0.011998,-0.004998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 60: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.003000,-0.002998,-0.000998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 61: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.011999,-0.014998,-0.000998, 51.200016,70.499969,142.800018, 1.078999,1.170999,1.000000);
						case 66: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.015000,-0.008998,-0.007998, 51.200016,70.499969,142.800018, 1.271999,1.359999,1.000000);
						case 67: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.015000,-0.008998,-0.007998, 51.200016,70.499969,142.800018, 1.271999,1.359999,1.000000);
						case 69: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.015000,-0.008998,-0.004998, 51.200016,70.499969,142.800018, 0.990999,1.040999,1.000000);
						case 72: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.015000,-0.008998,-0.004998, 51.200016,70.499969,142.800018, 0.990999,1.040999,1.000000);
						case 73: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.015000,-0.010998,-0.004998, 51.200016,70.499969,142.800018, 0.990999,1.040999,1.000000);
						case 78: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.009000,-0.010998,-0.003998, 51.200016,70.499969,142.800018, 0.990999,1.040999,1.000000);
						case 79: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.009000,-0.014998,-0.005998, 51.200016,70.499969,142.800018, 1.145999,0.990999,1.000000);
						case 86: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.009000,-0.014998,-0.005998, 51.200016,70.499969,142.800018, 1.145999,0.990999,1.000000);
						case 88: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.009000,0.001001,-0.028998, 51.200016,70.499969,142.800018, 1.145999,0.990999,1.000000);
						case 90: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.009000,-0.004998,-0.007998, 51.200016,70.499969,142.800018, 1.145999,0.990999,1.000000);
						case 91: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.009000,-0.004998,-0.004998, 51.200016,70.499969,142.800018, 0.925999,0.990999,1.000000);
						case 93: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.009000,-0.004998,-0.004998, 51.200016,70.499969,142.800018, 0.925999,0.990999,1.000000);
						case 94: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.009000,-0.009998,-0.004998, 51.200016,70.499969,142.800018, 0.925999,0.990999,1.000000);
						case 95: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.009000,-0.001998,-0.004998, 51.200016,70.499969,142.800018, 0.925999,0.990999,1.000000);
						case 96: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.009000,-0.017998,-0.008998, 51.200016,70.499969,142.800018, 1.093999,1.223999,1.000000);
						case 97: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.009000,-0.040998,-0.008998, 51.200016,70.499969,142.800018, 1.093999,1.223999,1.000000);
						case 98: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.009000,-0.002998,0.001001, 51.200016,70.499969,142.800018, 1.216999,1.287999,1.000000);
						case 100: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.009000,-0.002998,-0.002998, 51.200016,70.499969,142.800018, 1.216999,1.287999,1.000000);
						case 101: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.009000,-0.007998,-0.006998, 51.200016,70.499969,142.800018, 1.216999,1.287999,1.000000);
						case 102: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.009000,-0.003998,-0.004998, 51.200016,70.499969,142.800018, 1.216999,1.287999,1.000000);
						case 104: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.009999,0.001001,-0.001998, 51.200016,70.499969,142.800018, 1.216999,1.287999,1.000000);
						case 105: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.026999,-0.003998,0.005001, 51.200016,70.499969,142.800018, 1.363999,1.386999,1.000000);
						case 106: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.026999,0.000001,0.005001, 51.200016,70.499969,142.800018, 1.281999,1.385999,1.000000);
						case 107: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.014999,0.000001,0.005001, 51.200016,70.499969,142.800018, 1.281999,1.385999,1.000000);
						case 108: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.014999,-0.003998,0.005001, 51.200016,70.499969,142.800018, 1.281999,1.385999,1.000000);
						case 109: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.014999,-0.003998,0.005001, 51.200016,70.499969,142.800018, 1.281999,1.385999,1.000000);
						case 110: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.014999,-0.003998,0.005001, 51.200016,70.499969,142.800018, 1.281999,1.385999,1.000000);
						case 112: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.022999,-0.008998,-0.012998, 51.200016,70.499969,142.800018, 1.281999,1.385999,1.000000);
						case 114: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.001998,0.001001, 51.200016,70.499969,142.800018, 1.281999,1.385999,1.000000);
						case 116: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.001998,0.001001, 51.200016,70.499969,142.800018, 1.281999,1.385999,1.000000);
						case 119: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.006000,-0.009998,-0.003998, 51.200016,70.499969,142.800018, 1.128999,1.127999,1.000000);
						case 121: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.004999,-0.007998,-0.003998, 51.200016,70.499969,142.800018, 1.232999,1.381999,1.000000);
						case 122: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.004999,-0.001998,-0.003998, 51.200016,70.499969,142.800018, 1.232999,1.381999,1.000000);
						case 124: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.004999,-0.010998,-0.003998, 51.200016,70.499969,142.800018, 1.232999,1.381999,1.000000);
						case 125: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.004999,-0.010998,-0.003998, 51.200016,70.499969,142.800018, 1.232999,1.381999,1.000000);
						case 126: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.007000,-0.010998,-0.010998, 51.200016,70.499969,142.800018, 1.232999,1.381999,1.000000);
						case 128: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.007000,-0.004998,-0.005998, 51.200016,70.499969,142.800018, 1.232999,1.202999,1.000000);
						case 129: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.024999,-0.005998,-0.005998, 51.200016,70.499969,142.800018, 1.232999,1.202999,1.000000);
						case 132: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.009999,-0.011998,0.013001, 51.200016,70.499969,142.800018, 1.088000,0.977999,1.000000);
						case 133: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.009999,-0.005998,-0.008998, 51.200016,70.499969,142.800018, 1.088000,0.977999,1.000000);
						case 134: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.009999,-0.012998,-0.005998, 51.200016,70.499969,142.800018, 1.088000,0.977999,1.000000);
						case 142: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.001000,-0.004998,-0.001998, 51.200016,70.499969,142.800018, 1.088000,0.977999,1.000000);
						case 147: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.001000,-0.004998,-0.001998, 51.200016,70.499969,142.800018, 0.984000,0.977999,1.000000);
						case 149: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.001000,-0.015998,-0.001998, 51.200016,70.499969,142.800018, 1.120999,1.087999,1.000000);
						case 151: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.001000,-0.010998,-0.005998, 51.200016,70.499969,142.800018, 1.120999,1.087999,1.000000);
						case 154: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.001000,-0.013998,-0.005998, 51.200016,70.499969,142.800018, 1.120999,1.087999,1.000000);
						case 155: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.001000,-0.000998,-0.005998, 51.200016,70.499969,142.800018, 1.250000,1.087999,1.000000);
						case 156: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.009999,-0.000998,-0.009998, 51.200016,70.499969,142.800018, 1.064000,1.210999,1.000000);
						case 160: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.021000,-0.009998,-0.008998, 51.200016,70.499969,142.800018, 1.064000,1.210999,1.000000);
						case 163: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.021000,-0.009998,-0.003998, 51.200016,70.499969,142.800018, 1.212000,1.210999,1.000000);
						case 164: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.021000,-0.009998,-0.003998, 51.200016,70.499969,142.800018, 1.212000,1.210999,1.000000);
						case 165: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.021000,-0.004998,-0.004998, 51.200016,70.499969,142.800018, 1.310000,1.304999,1.000000);
						case 166: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.021000,-0.001998,-0.004998, 51.200016,70.499969,142.800018, 1.310000,1.304999,1.000000);
						case 167: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.021000,-0.010998,-0.013999, 51.200016,70.499969,142.800018, 1.310000,1.304999,1.000000);
						case 169: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.005998,-0.004998, 51.200016,70.499969,142.800018, 1.016000,1.304999,1.000000);
						case 170: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.005998,0.002001, 51.200016,70.499969,142.800018, 1.292000,1.304999,1.000000);
						case 171: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.005998,-0.007998, 51.200016,70.499969,142.800018, 1.292000,1.304999,1.000000);
						case 172: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.008998,0.001001, 51.200016,70.499969,142.800018, 0.956000,1.095999,1.000000);
						case 173: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.006998,0.000001, 51.200016,70.499969,142.800018, 1.195000,1.197999,1.000000);
						case 174: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.003998,0.000001, 51.200016,70.499969,142.800018, 1.195000,1.197999,1.000000);
						case 175: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.003998,0.000001, 51.200016,70.499969,142.800018, 1.450000,1.353999,1.000000);
						case 176: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.003998,0.000001, 51.200016,70.499969,142.800018, 1.205000,1.137999,1.000000);
						case 177: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.003998,0.000001, 51.200016,70.499969,142.800018, 1.205000,1.137999,1.000000);
						case 179: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.001998,0.000001, 51.200016,70.499969,142.800018, 1.205000,1.137999,1.000000);
						case 180: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.001998,0.000001, 51.200016,70.499969,142.800018, 1.205000,1.137999,1.000000);
						case 181: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.017998,-0.008998, 51.200016,70.499969,142.800018, 1.205000,1.137999,1.000000);
						case 184: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.011998,-0.001998, 51.200016,70.499969,142.800018, 1.205000,1.137999,1.000000);
						case 185: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.008998,-0.010999, 51.200016,70.499969,142.800018, 1.205000,1.137999,1.000000);
						case 188: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.001998,0.000000, 51.200016,70.499969,142.800018, 1.205000,1.137999,1.000000);
						case 189: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.007998,-0.008999, 51.200016,70.499969,142.800018, 1.205000,1.137999,1.000000);
						case 191: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.007998,-0.008999, 51.200016,70.499969,142.800018, 1.205000,1.137999,1.000000);
						case 192: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.007998,-0.000999, 51.200016,70.499969,142.800018, 1.041000,1.137999,1.000000);
						case 193: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.007998,-0.000999, 51.200016,70.499969,142.800018, 1.041000,1.137999,1.000000);
						case 194: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.007998,-0.000999, 51.200016,70.499969,142.800018, 1.041000,1.137999,1.000000);
						case 195: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.007998,-0.000999, 51.200016,70.499969,142.800018, 1.041000,1.137999,1.000000);
						case 196: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.003998,-0.004999, 51.200016,70.499969,142.800018, 1.041000,1.137999,1.000000);
						case 198: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.014998,-0.004999, 51.200016,70.499969,142.800018, 1.041000,1.137999,1.000000);
						case 200: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.021999,-0.008998,-0.000999, 51.200016,70.499969,142.800018, 1.041000,1.137999,1.000000);
						case 201: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.021999,-0.008998,-0.000999, 51.200016,70.499969,142.800018, 1.041000,1.137999,1.000000);
						case 202: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.007998,-0.004999, 51.200016,70.499969,142.800018, 1.041000,1.137999,1.000000);
						case 206: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.007998,-0.004999, 51.200016,70.499969,142.800018, 1.041000,1.137999,1.000000);
						case 207: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.007998,-0.004999, 51.200016,70.499969,142.800018, 1.041000,1.137999,1.000000);
						case 209: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.007998,0.008000, 51.200016,70.499969,142.800018, 1.041000,1.137999,1.000000);
						case 210: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.007998,-0.003999, 51.200016,70.499969,142.800018, 1.041000,1.137999,1.000000);
						case 211: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.011998,-0.003999, 51.200016,70.499969,142.800018, 1.041000,1.137999,1.000000);
						case 214: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.011998,-0.003999, 51.200016,70.499969,142.800018, 1.041000,1.137999,1.000000);
						case 215: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.006998,-0.003999, 51.200016,70.499969,142.800018, 1.041000,1.137999,1.000000);
						case 216: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.006998,-0.003999, 51.200016,70.499969,142.800018, 1.041000,1.137999,1.000000);
						case 217: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.003998,-0.003999, 51.200016,70.499969,142.800018, 1.219999,1.255999,1.000000);
						case 220: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.010998,-0.003999, 51.200016,70.499969,142.800018, 1.219999,1.255999,1.000000);
						case 221: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.005998,-0.006999, 51.200016,70.499969,142.800018, 1.219999,1.255999,1.000000);
						case 222: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.005998,-0.006999, 51.200016,70.499969,142.800018, 1.219999,1.255999,1.000000);
						case 223: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.005998,-0.006999, 51.200016,70.499969,142.800018, 1.219999,1.255999,1.000000);
						case 224: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.005998,-0.006999, 51.200016,70.499969,142.800018, 1.219999,1.255999,1.000000);
						case 225: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.005998,-0.006999, 51.200016,70.499969,142.800018, 1.219999,1.255999,1.000000);
						case 226: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.005998,-0.006999, 51.200016,70.499969,142.800018, 1.074999,1.255999,1.000000);
						case 229: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.003998,-0.006999, 51.200016,70.499969,142.800018, 1.074999,1.255999,1.000000);
						case 231: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.003998,-0.006999, 51.200016,70.499969,142.800018, 1.074999,1.255999,1.000000);
						case 233: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.006998,-0.002999, 51.200016,70.499969,142.800018, 1.074999,1.255999,1.000000);
						case 234: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.006998,-0.002999, 51.200016,70.499969,142.800018, 1.074999,1.255999,1.000000);
						case 235: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.012998,-0.002999, 51.200016,70.499969,142.800018, 1.074999,1.255999,1.000000);
						case 236: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.012998,-0.002999, 51.200016,70.499969,142.800018, 1.074999,1.255999,1.000000);
						case 239: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.012998,-0.002999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 240: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.004998,-0.002999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 247: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.004998,-0.002999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 250: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.009998,-0.002999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 252: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.004998,-0.002999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 254: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.002998,-0.002999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 255: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.008998,-0.002999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 258: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.004998,-0.002999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 259: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.004998,-0.002999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 263: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.004998,-0.002999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 265: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.015998,-0.005999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 266: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.015998,-0.005999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 267: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.015998,-0.005999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 269: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.003999,-0.015998,-0.005999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 270: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.009000,-0.004998,0.005001, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 271: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.009000,-0.008998,-0.006999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 273: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.020000,-0.013998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 274: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.008000,-0.005998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 275: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.008000,-0.005998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 276: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.008000,-0.005998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 280: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.001000,-0.005998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 281: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.001000,-0.005998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 282: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.001000,-0.005998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 283: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.001000,-0.005998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 285: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.001000,-0.002998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 287: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.015000,-0.008998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 288: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.015000,-0.003998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 289: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.015000,-0.003998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 291: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.015000,-0.003998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 292: SetPlayerAttachedObject(playerid, 4, object_id, 6, 0.001999,-0.003998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 293: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.050999,-0.003998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 298: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.028999,-0.004998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 300: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.003999,-0.004998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 301: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.003999,-0.004998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 302: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.003999,-0.004998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 303: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.003999,-0.004998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 304: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.003999,-0.004998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 305: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.003999,-0.004998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 306: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.003999,-0.004998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 307: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.003999,-0.004998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 308: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.003999,-0.004998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 309: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.003999,-0.004998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 310: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.003999,-0.004998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						case 311: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.003999,-0.004998,-0.009999, 51.200016,70.499969,142.800018, 1.234999,1.255999,1.000000);
						default: SetPlayerAttachedObject(playerid, 4, object_id, 6, -0.018999,-0.003998,-0.001999, 51.200016,53.199977,142.800018, 0.963999,0.916999,1.000000);
					}
				}
			}
		}
	}
	return 1;
}

/*

	* Callbacks *

*/

/*
	OnPlayerConnect
*/

public OnPlayerConnect(playerid)
{
	ResetPlayerData(playerid);
	ResertPlayerTDs(playerid);

	#if defined Inv_OnPlayerConnect
		return Inv_OnPlayerConnect(playerid);
	#else
		return 1;
	#endif
}

/*
    ALS
*/

#if defined _ALS_OnPlayerConnect
	#undef OnPlayerConnect
#else
	#define _ALS_OnPlayerConnect
#endif
#define OnPlayerConnect Inv_OnPlayerConnect
#if defined Inv_OnPlayerConnect
	forward Inv_OnPlayerConnect(playerid);
#endif
